sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:        LM3SXXXX.c [Luminary]
    Project:     Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2020
    *********************************************************************
    04.12.2008 Add IAR5 support
    07.12.2008 Increase Ethernet buffer sizes to account for length in content and to ensure acceptance of long word writes {1}
    07.12.2008 Remove usEthRxValid[] and add usEthernetInputSize. Don't allow overlarge input frames from overwriting buffer, but extract all from FIFO
    07.12.2008 Retrigger the watchdog during erase operation since a page erase takes at least 20ms. 156k delete thus takes over 6s to complete {2}
    16.01.2009 SST SPI FLASH support                                      {3}
    04.02.2009 Change GET_FIFO_LONG to use fnGetFifo_long() when simulating {4}
    05.02.2009 Add single-shot timer interrupt                            {5}
    27.02.2009 Add RTS/CTS control                                        {6}
    04.03.2009 Change use of random number seed                           {7}
    14.03.2009 Fast GPIOs configured if available                         {8}
    24.03.2009 Add uDMA support to UARTs                                  {9}
    31.03.2009 Add ADC support                                            {10}
    11.04.2009 Add RTS/CTS hardware flow control                          {11}
    05.06.2009 Correct I2C reception                                      {12}
    29.08.2009 Add timer frequency and PWM outputs                        {13}
    08.09.2009 Add internal temperature source to single-ended inputs     {14}
    11.09.2009 Add MULTIDROP_MODE support                                 {15}
    07.11.2009 Adjust PWM to 1/10 % from 1% steps using macro based value {16}
    11.11.2009 Add extended PLL configuration for use with LM3S9BXX devices to achieve more operating frequencies {17}
    29.11.2009 Adapt Ethernet interface to support LM3S9BXX devices       {18}
    27.01.2010 Protect adc_int_complete_handler() from interrupts         {19}
    09.04.2010 Add multicast support for IPV6                             {20}
    15.05.2010 Move UART reset to after enabling peripheral clock         {21}
    15.05.2010 Allow ADC sequencer without interrupt                      {22}
    02.07.2010 Correct syntax on port J                                   {23}
    11.07.2010 Extend ADC support for Tempest parts                       {24}
    05.08.2010 Correct fnWriteBytesFlash() for SPI FLASH with non-Tempest parts {25}
    05.08.2010 Allow fnConfigSPIFileSystem() to be activated with SPI_SW_UPLOAD {26}
    11.08.2010 Correct flash erase moving from internal to external SPI FLASH {27}
    21.09.2010 Correct SPI FLASH page addressing when ATMEL FLASH is in power of twos mode {28}
    28.09.2010 Add external UART support                                  {29}
    06.10.2010 Add 16 bit timer modes                                     {30}
    10.10.2010 Clear possibly pending NVIC interrupt when entering new ones (when working with debugger they can otherwise immediately fire) {31}
    27.12.2010 Add PWM controller support                                 {32}
    04.03.2011 Add small delay after ADC power up so that it can become ready before first access {33}
    01.04.2011 Add CC Studio support                                      {34}
    02.04.2011 Remove random seed from stack to a fixed location          {35}
    07.09.2018 Add hardware operating details for simulator display       {36}
    07.10.2018 Add volatile to ensure that interrupt flags are not optimised away when code in-lining takes place {37}
    16.11.2020 I2C simulation extended to support multiple I2C buses      {38}

*/

#if defined _LM3SXXXX

//#define _RUN_FLASH_FROM_RAM                                            // program FLASH from RAM - it is possible to program while operating in FLASH but it takes longer

/* =================================================================== */
/*                           include files                             */
/* =================================================================== */

#if defined _WINDOWS
    #include "config.h"
    #define INITHW  extern
    extern void fnOpenDefaultHostAdapter(void);
    extern void fnUpdateOperatingDetails(void);                          // {36}
    #define _SIM_PORT_CHANGE   fnSimPorts(-1);                           // make sure simulator knows of change
    #define START_CODE 0
    #define _fnRAM_code fnCommandFlash
#else
    #ifdef _GNU
        #define __root
    #endif
    #define OPSYS_CONFIG                                                 // this module owns the operating system configuration
    #define INITHW  static
    #define _SIM_PORT_CHANGE
    #include "config.h"
    #if defined _COMPILE_KEIL
        extern void __main(void);                                        // Keil library initialisation routine
        #define START_CODE __main
    #elif defined COMPILE_IAR5
        extern void __iar_program_start(void);                           // IAR library initialisation routine
        #define START_CODE __iar_program_start
        #define _main main
    #elif defined ROWLEY && !defined ROWLEY_2                            // if project uses Rowley < V1.7 build 17
        #define START_CODE _main2
    #elif defined _CCSTUDIO                                              // {34}
        extern void _c_int00(void);                                      // CC Studio library initialisation routine
        #define START_CODE _c_int00
        #define _main main    
    #else
        #define START_CODE _main
    #endif
    #define _fnRAM_code fnRAM_code
#endif

#if defined SERIAL_INTERFACE && (NUMBER_EXTERNAL_SERIAL > 0)             // {29}
    #if defined EXT_UART_SC16IS7XX
        #include "spi_sc16IS7xx.h"                                       // include driver
    #endif
#endif

/* =================================================================== */
/*                          local definitions                          */
/* =================================================================== */

#define __interrupt

