sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
#if defined CHIP_HAS_uDMA && defined SERIAL_SUPPORT_DMA
    #ifdef PING_PONG_DMA                                                 // uDMA control block size at start of SRAM
        #define RESERVE_DMA_MEMORY   1024                                // assumes maximum 32 DMA channels
    #else
        #define RESERVE_DMA_MEMORY   512                                 // assumes maximum 32 DMA channels
    #endif
#else
    #define RESERVE_DMA_MEMORY       0
#endif
        
/* =================================================================== */
/*                       local structure definitions                   */
/* =================================================================== */


/* =================================================================== */
/*                global function prototype declarations               */
/* =================================================================== */


/* =================================================================== */
/*                 local function prototype declarations               */
/* =================================================================== */

#if !defined SPI_INTERFACE && (defined SPI_FILE_SYSTEM || defined SPI_SW_UPLOAD)
    static void fnConfigSPIFileSystem(unsigned char ucSpeed);
    #if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
        #if !defined SPI_FLASH_ST && !defined SPI_FLASH_SST25            // {3}
            #define SPI_FLASH_ATMEL                                      // default if not otherwise defined
        #endif
        #define _SPI_DEFINES
            #include "spi_flash_lm3s_atmel.h"
            #include "spi_flash_lm3s_stmicro.h"
            #include "spi_flash_lm3s_sst25.h"                            // {3}
        #undef _SPI_DEFINES
    #endif
#endif
#if defined FLASH_FILE_SYSTEM
    static void fnInitFlash(void);
#endif
static void LM3SXXXX_LowLevelInit(void);

/* =================================================================== */
/*                             constants                               */
/* =================================================================== */


#if (defined ETH_INTERFACE && !defined NO_INTERNAL_ETHERNET) && !defined ETHERNET_RELEASE_AFTER_EVERY_FRAME
    static const unsigned char EMAC_RX_int_message[ HEADER_LENGTH ] = { 0, 0 , TASK_ETHERNET, INTERRUPT_EVENT, EMAC_RX_INTERRUPT };   // define fixed interrupt event
#endif


/* =================================================================== */
/*                      local variable definitions                     */
/* =================================================================== */
#ifdef _CCSTUDIO                                                         // {34}
    static unsigned char __attribute__((section(".vect_tab"))) vectorTable[(sizeof(VECTOR_TABLE)) + RESERVE_DMA_MEMORY]; // reserve space at the start SRAM for the vector table and optionally for uDMA work space  
#endif

#ifdef RANDOM_NUMBER_GENERATOR
    static unsigned short *ptrSeed;
#endif
#if defined FLASH_ROW_SIZE && FLASH_ROW_SIZE > 0
    static unsigned long ulFlashRow[FLASH_ROW_SIZE/sizeof(unsigned long)]; // FLASH row backup buffer (on word boundary)
#endif

#if defined ETH_INTERFACE
    static unsigned char *ptrEthTxBuffer;
    static unsigned char *ptrEthRxBuffer[NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE]; // pointer to a number of LAN frame reception buffers
    static int iRxEthBufferPut = 0;
    static int iRxEthBufferGet = 0;
    static unsigned short usEthernetInputSize;
#endif

#ifdef USB_INTERFACE
    static USB_END_POINT *usb_endpoints;
    static unsigned short usFIF0address;
    static USB_HW usb_hardware = {0};
#endif

#ifdef _WINDOWS
    static unsigned short usPhyMode = 0;
#endif

#if defined FLASH_FILE_SYSTEM && defined _RUN_FLASH_FROM_RAM
    static void (*fnRAM_code)(unsigned long, unsigned long, unsigned long) = 0;
#endif

#if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
    #if !defined SPI_FLASH_DEVICE_COUNT
        #define SPI_FLASH_DEVICE_COUNT 1
    #endif
    static int SPI_FLASH_Danger[SPI_FLASH_DEVICE_COUNT] = {0};           // signal that the FLASH status should be checked before using since there is a danger that it is still busy
    static unsigned char ucSPI_FLASH_Type[SPI_FLASH_DEVICE_COUNT];       // list of attached FLASH devices

    #ifdef SPI_FLASH_MULTIPLE_CHIPS
        unsigned char ucChipSelect[SPI_FLASH_DEVICE_COUNT] = {
            CS0_LINE,
            CS1_LINE                                                     // at least 2 expected when multiple devices are defined
        #ifdef CS2_LINE
            ,CS2_LINE
            #ifdef CS3_LINE
            ,CS3_LINE
            #endif
        #endif
        };
        #define EXTENDED_CS , &iChipSelect
        #define _EXTENDED_CS  iChipSelect,
    #else
        #define EXTENDED_CS
        #define _EXTENDED_CS
    #endif
#endif

static int iInterruptLevel = 0;

/* =================================================================== */
/*                     global variable definitions                     */
/* =================================================================== */
#if defined ETH_INTERFACE
    extern ETHERNETQue *eth_tx_control;                                  // Ethernet structure pointers for Ethernet Interrupt handling
    extern ETHERNETQue *eth_rx_control;
#endif

#if defined I2C_INTERFACE
    extern I2CQue *I2C_rx_control[NUMBER_I2C];
    extern I2CQue *I2C_tx_control[NUMBER_I2C];
#endif

#if defined _WINDOWS                              
    extern unsigned char vector_ram[(RESERVE_DMA_MEMORY + sizeof(VECTOR_TABLE))];// vector table in simulated RAM (long word aligned)
#endif

/* =================================================================== */
/*                      local function definitions                     */
/* =================================================================== */

#if !defined _WINDOWS
    static void fnInitHW(void);
#endif


/* =================================================================== */
/*                      global function definitions                    */
/* =================================================================== */


/* =================================================================== */
/*                      STARTUP CODE                                   */
/* =================================================================== */


#if !defined _WINDOWS
    extern void __segment_init(void);
    #if defined  COMPILE_IAR
        #if defined COMPILE_IAR5
            #pragma segment=".data"
            #pragma segment=".bss"
            static unsigned char *ptrTopOfUsedMemory = 0;
            #define HEAP_START_ADDRESS ptrTopOfUsedMemory                // IAR5 compiler - last location of static variables
        #else
            #pragma segment="DATA_Z"
            #define HEAP_START_ADDRESS __segment_end("DATA_Z")           // IAR compiler - last location of static variables
        #endif
        extern void __disable_interrupt(void);
        extern void __enable_interrupt(void);
        extern void __sleep_mode(void);
    #elif defined _COMPILE_KEIL
        #define HEAP_START_ADDRESS    _keil_ram_size()
        #define __disable_interrupt() __disable_irq()                    // KEIL intrinsics
        #define __enable_interrupt()  __enable_irq()
      //#define __sleep_mode()                                           //__asm("wfi"); Keil doesn't support inline assembly in Thumb mode so this is defined in the startup assembler file
        extern void __sleep_mode(void);
    #else                                                                // disable interrupt in assembler code
        #ifdef ROWLEY_2
            #define asm(x) __asm__(x)
        #endif
        extern unsigned char __heap_end__;        
        #define HEAP_START_ADDRESS &__heap_end__                         //  last location of static variables
        #define __disable_interrupt() asm(" cpsid   i")                  // note that the space before the assembler is required by CCStudio (TI compiler)
        #define __enable_interrupt()  asm(" cpsie   i")
        #define __sleep_mode()        asm(" wfi")
    #endif
 
