sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
#ifdef _COMPILE_KEIL

typedef struct stREGION_TABLE
{
    unsigned char *ptrConst;                                             // const variables belonging to block
    unsigned char *ptrDestination;                                       // destination in RAM
    unsigned long  ulLength;                                             // length of the block in SRAM
    unsigned long  ulUnknown;                                            // entry unknown
} REGION_TABLE;

// Calculate the end of used SRAM from the Keil linker information
//
static unsigned char *_keil_ram_size(void)
{
    extern REGION_TABLE Region$$Table$$Base;                            // table location supplied by linker
    extern REGION_TABLE Region$$Table$$Limit;                           // end of table list
    REGION_TABLE *ptrEntries = &Region$$Table$$Base;                    // first block
    unsigned char *ptrRam = ptrEntries->ptrDestination;                 // RAM address
    do {
        ptrRam += ptrEntries->ulLength;                                 // add length
        ptrEntries++;                                                   // move to next block
    } while (ptrEntries != &Region$$Table$$Limit);
    return ptrRam;
}
#endif

// main entry for the target code
//
extern int _main(void)
{	
#if defined MULTISTART
    MULTISTART_TABLE *prtInfo;
    unsigned char *pucHeapStart = HEAP_START_ADDRESS;
#endif
#if defined RANDOM_NUMBER_GENERATOR
  //unsigned short usRandomSeed;                                         // we put an uninitialised variable on to the stack for use as a random seed
    ptrSeed = RANDOM_SEED_LOCATION; // &usRandomSeed;                    // {35}
#endif
#if defined COMPILE_IAR5
    if (__sfe(".bss") > __sfe(".data")) {                                // set last used SRAM address
        ptrTopOfUsedMemory = __sfe(".bss");
    }
    else {
        ptrTopOfUsedMemory = __sfe(".data");
    }
 #endif
    fnInitHW();                                                          // perform hardware initialisation (note that we do not have heap yet)
    #ifdef MULTISTART
    prtInfo = ptMultiStartTable;                                         // if the user has already set to alternative start configuration
    if (prtInfo == 0) {                                                  // no special start required
_abort_multi:
        fnInitialiseHeap(ctOurHeap, HEAP_START_ADDRESS);                 // initialise heap
        uTaskerStart((UTASKTABLEINIT *)ctTaskTable, ctNodes, PHYSICAL_QUEUES); // start the operating system
        while ((prtInfo = (MULTISTART_TABLE*)uTaskerSchedule()) == 0) {} // schedule uTasker
    }

    do {
        pucHeapStart = HEAP_START_ADDRESS;
        if (prtInfo->new_hw_init) {                                      // info to next task configuration available
            pucHeapStart = prtInfo->new_hw_init(JumpTable);              // get heap details from next configuration
            if (!pucHeapStart) {
                goto _abort_multi;                                       // this can happen if the jump table version doesn't match - prefer to stay in boot mode than start an application which will crash
            }
        }

        fnInitialiseHeap(prtInfo->ptHeapNeed, pucHeapStart);             // initialise the new heap
                                                                         // start the operating system with next configuration
        uTaskerStart((UTASKTABLEINIT *)prtInfo->ptTaskTable, prtInfo->ptNodesTable, PHYSICAL_QUEUES);
        while ((prtInfo = (MULTISTART_TABLE*)uTaskerSchedule()) == 0) {} // schedule uTasker

    } while (1);
    #else
    fnInitialiseHeap(ctOurHeap, HEAP_START_ADDRESS);                     // initialise heap
    uTaskerStart((UTASKTABLEINIT *)ctTaskTable, ctNodes, PHYSICAL_QUEUES); // start the operating system

    while (1) {
        uTaskerSchedule();                                               // schedule uTasker
    }
    #endif
                                                                         // we never return....
    return 0;
}
#endif                                                                   // end if not _WINDOWS

#if defined _COMPILE_KEIL
// Keil demands the use of a main function with int return value
//
extern int main(void)
{
    _main();
    return 0;
}
#endif

// Function used to enter processor interrupts
//
static void fnEnterInterrupt(int iInterruptID, unsigned char ucPriority, void (*InterruptFunc)(void))
{
    volatile unsigned long *ptrIntSet = IRQ0_31_SER_ADD;                 // {7}
    volatile unsigned char *ptrPriority = IRQ0_3_PRIORITY_REGISTER_ADD;  // {37}
    VECTOR_TABLE *ptrVect;
    void ( **processor_ints )( void );
    unsigned long ulInterruptBit;
#ifdef _WINDOWS                                                          // back up the present enabled interrupt registers
    unsigned long ulState0 = IRQ0_31_SER;
    unsigned long ulState1 = IRQ32_63_SER;
    IRQ0_31_SER = IRQ32_63_SER = IRQ0_31_CER = IRQ32_63_CER = 0;         // reset registers
#endif
#ifdef _WINDOWS
    ptrVect = (VECTOR_TABLE *)((unsigned char *)((unsigned char *)&vector_ram + RESERVE_DMA_MEMORY));
#else
    ptrVect = (VECTOR_TABLE *)(RAM_START_ADDRESS + RESERVE_DMA_MEMORY);
#endif
    processor_ints = (void (**)(void))&ptrVect->processor_interrupts;
    processor_ints += iInterruptID;
    *processor_ints = InterruptFunc;

    ptrIntSet += (iInterruptID/32);                                      // move to the corresponding set enable register address
    ulInterruptBit = (0x01 << (iInterruptID%32));
    *(ptrIntSet + (IRQ0_31_CPR_ADD - IRQ0_31_SER_ADD)) = ulInterruptBit; // {31} clear possibly pending bit (can occur when working with debugger)
    *ptrIntSet = ulInterruptBit;                                         // enable the interrupt

    ptrPriority += iInterruptID;
    *ptrPriority = ucPriority;                                           // define the interrupt's priority
#ifdef _WINDOWS
    IRQ0_31_SER  |= ulState0;                                            // synchronise the interrupt masks
    IRQ32_63_SER |= ulState1;
    IRQ0_31_CER   = IRQ0_31_SER;
    IRQ32_63_CER  = IRQ32_63_SER;
#endif
}


#ifdef RANDOM_NUMBER_GENERATOR
// How the random number seed is set depends on the hardware possibilities available.
//
extern void fnInitialiseRND(unsigned short *usSeedValue)                 // {7}
{
    if ((*usSeedValue = *ptrSeed) == 0) {                                // we hope that the content of the random seed is random after a power up
        *usSeedValue = 0x127b;                                           // we must not set a zero - so we set a fixed value
    }                                                                    // after a reset it should be well random since it will contain the value at the reset time
    *ptrSeed = fnRandom();                                               // ensure that the seed value is modified between resets
}
#endif


// Basic hardware initialisation of specific hardware
//
INITHW void fnInitHW(void)                                               // perform hardware initialisation
{
#if defined GLOBAL_HARDWARE_TIMER
  static __interrupt void hwtimer_interrupt(void);
  volatile unsigned int dummy;
#endif
#if defined _WINDOWS
    unsigned long ulPortPullups[] = {
    #if PART_DC4 & GPIOA_PRESENT4
        PORTA_DEFAULT_INPUT,                                             // set the port states out of reset in the project file app_hw_lm3sxxxx.h
    #endif
    #if PART_DC4 & GPIOB_PRESENT4
        PORTB_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOC_PRESENT4
        PORTC_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOD_PRESENT4
        PORTD_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOE_PRESENT4
        PORTE_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOF_PRESENT4
        PORTF_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOG_PRESENT4
        PORTG_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOH_PRESENT4
        PORTH_DEFAULT_INPUT,
    #endif
    #if PART_DC4 & GPIOJ_PRESENT4
        PORTJ_DEFAULT_INPUT,                                             // {23}
    #endif
    #if defined SUPPORT_ADC && (PART_DC1 & ADC0_PRESENT1)
        ((AN0_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),                   // initial voltages when simulating
        ((AN1_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN2_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN3_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN4_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN5_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN6_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN7_START_VOLTAGE ) / ADC_REFERENCE_VOLTAGE),
    #endif
    #if defined SUPPORT_ADC && (PART_DC1 & ADC1_PRESENT1)                // second ADC - assume 16 ADC inputs available
        ((AN8_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),  // initial voltages when simulating
        ((AN9_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN10_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN11_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN12_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN13_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN14_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
        ((AN15_START_VOLTAGE) / ADC_REFERENCE_VOLTAGE),
    #endif
    };
    #ifdef RANDOM_NUMBER_GENERATOR
    static unsigned short usRandomSeed = 0;
    ptrSeed = &usRandomSeed;                                             // {35} note that the target works differently
    #endif
    fnInitialiseDevice((void *)ulPortPullups);
#endif
    LM3SXXXX_LowLevelInit();
#if defined FLASH_ROW_SIZE && FLASH_ROW_SIZE > 0
    uMemset(ulFlashRow, 0xff, FLASH_ROW_SIZE);                           // flush the intermediate FLASH buffer
#endif
    INIT_WATCHDOG_LED();                                                 // allow user configuration of a blink LED
    INIT_WATCHDOG_DISABLE();                                             // initialise ready for checking of watchdog disabled
    if (WATCHDOG_DISABLE() == 0) {
        RCGC0 |= CGC_WDT;                                                // enable clocks to the watchdog module
        SRCR0 &= ~CGC_WDT;                                               // ensure watchdog module is not in reset
        WDTLOCK = WD_ACCESS;                                             // ensure we can access the watchdog registers
        WDTTEST = WD_STALL;                                              // allow watchdog counter stalling when debugging
        WDTLOAD = (WATCHDOG_TIMEOUT_MS * (MASTER_CLOCK/1000/2));         // allow user configuration of timeout in ms (times out twice before reset)
        WDTCTL = WD_RESEN;                                               // enable reset on second timeout
        WDTCTL = (WD_RESEN | WD_INTEN);                                  // enable watchdog and interrupt
        WDTICR = 0;                                                      // retrigger the watchdog, causing reload from load register
#if defined _WINDOWS
        WDTVALUE = WDTLOAD;                                              // latch the reload value to the counter
#endif
        WDTLOCK = 0;                                                     // lock against further uncontrolled accesses
    }

#if defined _WINDOWS
    fnSimPorts(-1);                                                      // ensure port states are recognised
#endif

    fnUserHWInit();                                                      // allow the user to initialise hardware specific things

#if defined _WINDOWS
    fnSimPorts(-1);                                                      // ensure port states are recognised
#endif

#if !defined SPI_INTERFACE && (defined SPI_FILE_SYSTEM || defined SPI_SW_UPLOAD)
    #if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
    fnConfigSPIFileSystem(MAX_SPI);                                      // configure SPI interface for maximum speed
    #define _CHECK_SPI_CHIPS                                             // insert manufacturer dependent code
        #include "spi_flash_lm3s_atmel.h"
        #include "spi_flash_lm3s_stmicro.h"
        #include "spi_flash_lm3s_sst25.h"                                // {3}
    #undef _CHECK_SPI_CHIPS
    #else
    fnConfigSPIFileSystem(SPI_2MEG);                                     // configure SPI interface for SPI file system and 2M speed
    #endif
#endif
#if defined FLASH_FILE_SYSTEM
    fnInitFlash();
#endif

#if defined GLOBAL_HARDWARE_TIMER                                        // initialise the timer for use with global hardware timers
    PMC_PCER = TC2;                                                      // enable clocks to timer 2 in PMC
    TC_CCR_2 = (TIM_CLKDIS | TIM_SWTRG);                                 // disable timer clock and reset timer

