sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
    dummy = TC_SR_2;                                                     // read status register to reset possible pending interrupt

    fnEnterInterrupt(TC2, PRIORITY_HW_TIMER, hwtimer_interrupt);

    #if MILLISEC == LOW_RES_MS
    TC_CMR_2  = (TIMER_CLOCK_5 | WAVE | WAVSEL_UP_TRG_RC | CPCSTOP | CPCDIS);// MCK/1024, wave mode, trigger on register RC, stop after triggering
    #elif MILLISEC == MED_RES_MS
    TC_CMR_2  = (TIMER_CLOCK_4 | WAVE | WAVSEL_UP_TRG_RC | CPCSTOP | CPCDIS);// MCK/128, wave mode, trigger on register RC, stop after triggering
    #else
    TC_CMR_2  = (TIMER_CLOCK_3 | WAVE | WAVSEL_UP_TRG_RC | CPCSTOP | CPCDIS);// MCK/32, wave mode, trigger on register RC, stop after triggering
    #endif
#endif
}


// Support watchdog re-triggering of specific hardware
//
extern void fnRetriggerWatchdog(void)
{
    WDTICR = 0;                                                          // retrigger the watchdog, causing reload from load register
    TOGGLE_WATCHDOG_LED();                                               // blink an LED for visualisation
}

// Routine to disable interrupts during critical region
//
extern void uDisable_Interrupt(void)
{
#if defined _WINDOWS
    LM3Sxxxx.CORTEX_M3_REGS.ulPRIMASK = INTERRUPT_MASKED;                // mark that interrupts are masked
#else
    __disable_interrupt();                                               // disable interrupts to core
#endif
    iInterruptLevel++;                                                   // monitor the level of disable nesting
}

// Routine to re-enable interrupts on leaving a critical region (IAR uses intrinsic function)
//
extern void uEnable_Interrupt(void)
{
#if defined _WINDOWS
    if (iInterruptLevel == 0) {
        *(int *)0 = 0;                                                   // basic error - cause simulator exception
        // A routine is enabling interrupt although they are presently off. This may not be a serious error but it is unexpected so best check why...
    }
#endif
    if ((--iInterruptLevel) == 0) {                                      // only when no more interrupt nesting,
#if defined _WINDOWS
        LM3Sxxxx.CORTEX_M3_REGS.ulPRIMASK = 0;                           // mark that interrupts are not masked
#else
        __enable_interrupt();                                            // enable processor interrupts
#endif
    }
}

// TICK interrupt
//
static __interrupt void _RealTimeInterrupt(void)
{
    INT_CONT_STATE_REG = PENDSTCLR;                                      // reset interrupt
#if defined _WINDOWS
    INT_CONT_STATE_REG &= ~(PENDSTSET | PENDSTCLR);
#endif
    uDisable_Interrupt();                                                // ensure tick handler can not be interrupted
    fnRtmkSystemTick();                                                  // operating system tick
    uEnable_Interrupt();
}

// Routine to initialise the Real Time Tick interrupt (uses Cortex M3 SysTick timer)
//
#define REQUIRED_MS ((1000000/TICK_RESOLUTION))                          // the TICK frequency we require in kHz
#define TICK_DIVIDE (((MASTER_CLOCK + REQUIRED_MS/2)/REQUIRED_MS) - 1)   // the divide ratio required


extern void fnStartTick(void)
{
    VECTOR_TABLE *ptrVect;
#if defined _WINDOWS
    ptrVect = (VECTOR_TABLE *)((unsigned char *)((unsigned char *)&vector_ram + RESERVE_DMA_MEMORY));
#else
    ptrVect = (VECTOR_TABLE *)(RAM_START_ADDRESS + RESERVE_DMA_MEMORY);
#endif

    SYSTICK_RELOAD = TICK_DIVIDE;                                        // set reload value to determine the period
    ptrVect->ptrSysTick = _RealTimeInterrupt;                            // enter interrupt handler
    SYSTEM_HANDLER_12_15_PRIORITY_REGISTER |= (SYSTICK_PRIORITY << 24);  // enter the SYSTICK priority
    SYSTICK_CSR = (SYSTICK_CORE_CLOCK | SYSTICK_ENABLE | SYSTICK_TICKINT); // enable timer and its interrupt
#if defined _WINDOWS
    SYSTICK_RELOAD &= SYSTICK_COUNT_MASK;                                // mask any values which are out of range
    SYSTICK_CURRENT = SYSTICK_RELOAD;                                    // prime the reload count
#endif
}


#if defined ETH_INTERFACE

    #if defined USE_IGMP && !defined NO_INTERNAL_ETHERNET                // {74}
        #if defined USE_IPV6
            #define MAX_MULTICAST_FILTERS (IGMP_MAX_HOSTS + 2)
        #else
            #define MAX_MULTICAST_FILTERS (IGMP_MAX_HOSTS + 1)
        #endif
        static unsigned char ucGroupHashes[MAX_MULTICAST_FILTERS] = {0};
    #endif

#if defined USE_IGMP || defined USE_IPV6
static unsigned char fnCalculateHash(unsigned char *ptrMac)
{
    #define CRC_POLY 0xedb88320                                          // CRC-32 polynomial in reverse direction
    unsigned long ulCRC32 = 0xffffffff;
    int i, iBit;
    unsigned char ucByte;
    for (i = 0; i < MAC_LENGTH; i++) {
        ucByte = *ptrMac++;
        for (iBit = 0; iBit < 8; iBit++) {
            if ((ulCRC32 ^ ucByte) & 1) {
                ulCRC32 = (ulCRC32 >> 1) ^ CRC_POLY;
            }
            else {
                ulCRC32 >>= 1;
            }
            ucByte >>= 1;
        }
    }
    ulCRC32 >>= 26;                                                      // the upper 6 bits of the CRC32 determine the hash entry location
    return (unsigned char)ulCRC32;
}

static unsigned long GALR = 0;
static unsigned long GAUR = 0;

static void fnEnableMulticastHash(unsigned char ucHashRef)
{
    if (ucHashRef < 32) {
        GALR |= (0x00000001 << ucHashRef);                               // enter single group hash entry
    }
    else {
        ucHashRef -= 32;
        GAUR |= (0x00000001 << ucHashRef);
    }
    MACRCTL |= MAC_AMUL;
}
#endif

#if defined USE_IGMP                                                     // {74}
static void fnDisableMulticastHash(unsigned char ucHashRef)
{

    if (ucHashRef < 32) {
        GALR &= ~(0x00000001 << ucHashRef);                              // enter single group hash entry
    }
    else {
        ucHashRef -= 32;
        GAUR &= ~(0x00000001 << ucHashRef);
    }
    if ((GALR == 0) && (GAUR == 0)) {
        MACRCTL &= ~MAC_AMUL;
    }
}

