sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
// IGMP adds and removes multicast host groups and requires the receiver's multicast filtering to be modified in the process
//
extern void fnModifyMulticastFilter(QUEUE_TRANSFER action, unsigned char *ptrIP)
{
    int iFree = -1;
    int iMatch = -1;
    int i;
    int iHashCount = 0;
    unsigned char ucMac[MAC_LENGTH];
    unsigned char ucHashRef;
    switch (action) {
    case REMOVE_IPV4_FILTER:
    case ADD_IPV4_FILTER:                                                // a filter has to be enabled for this IPv4 address
        ucMac[0] = 0x01;                                                 // IANA owned multicast ethernet address block
        ucMac[1] = 0x00;
        ucMac[2] = 0x5e;                                                 // enter the multicast MAC address belonging to IANA for this purpose
        ucMac[3] = (*(ptrIP + 1) & 0x7f);                                // add 23 bits of the destination IP address
        ucMac[4] = *(ptrIP + 2);
        ucMac[5] = *(ptrIP + 3);
        ucHashRef = fnCalculateHash(ucMac);
        break;
    default:                                                             // ignore any other calls
        return;
    }
    for (i = 0; i < MAX_MULTICAST_FILTERS; i++) {                        // check whether the entry exists
        if (ucGroupHashes[i] == ucHashRef) {                             // existing hash entry found
            iMatch = i;
            iHashCount++;                                                // count the number of groups requiring this hash
        }
        else if (ucGroupHashes[i] == 0) {                                // free location
            iFree = i;                                                   // remember the free entry
        }
    }
    if (action == ADD_IPV4_FILTER) {                                     // the entry doesn't exist so we add it
        if (iFree < 0) {
            _EXCEPTION("No more hash entry space");
        }
        else {
            ucGroupHashes[iFree] = ucHashRef;                            // note that this hash is required
            fnEnableMulticastHash(ucHashRef);                            // enable the hash entry
        }
    }
    else if (action == REMOVE_IPV4_FILTER) {
        if (iMatch >= 0) {                                               // remove an entry for this hash
            ucGroupHashes[iMatch] = 0;                                   // entry free
            if (iHashCount == 1) {                                       // single entry so it can be disabled
                fnDisableMulticastHash(ucHashRef);
            }
        }
    }
}
#endif
/* =================================================================== */
/*                          Ethernet Interface                         */
/* =================================================================== */

// This is called when an Ethernet event has been received. Generally it is due to a reception and returns channel and message details.
// We are more or less forced to copy a number of input buffers to a linear input buffer so that it can be handled by standard routines
// Therefore we step through one or a number of receive buffer descriptors, receiving the amound of data in them.
//
extern signed char fnEthernetEvent(unsigned char *ucEvent, ETHERNET_FRAME *rx_frame)
{
    if (EMAC_RX_INTERRUPT == *ucEvent) {
        if (*(unsigned short *)ptrEthRxBuffer[iRxEthBufferGet] == 0) {
            return -1;                                                   // nothing (else) waiting
        }
        rx_frame->frame_size = *(unsigned short *)ptrEthRxBuffer[iRxEthBufferGet];
        rx_frame->ptEth = (ETHERNET_FRAME_CONTENT *)(ptrEthRxBuffer[iRxEthBufferGet] + sizeof(unsigned short)); // return pointer to the input buffer - after increment to beyond the stored length
        return 0;                                                        // channel received from 0 (we use only 0)
    }
    #ifdef USE_IP_STATS
    else if (ETHERNET_RX_OVERRUN == *ucEvent) {
        fnIncrementEthernetStats(TOTAL_LOST_RX_FRAMES, DEFAULT_NETWORK); // we lost a frame due to RX overrun so count the event
    }
        #if defined USE_IP_STATS && !defined ETHERNET_RELEASE_AFTER_EVERY_FRAME
    else {
        fnIncrementEthernetStats(TOTAL_OTHER_EVENTS, DEFAULT_NETWORK);   // count other unexpected events
    }
        #endif
    #endif
    return -1;                                                           // invalid channel
}


// Routine to read a word from the PHY
//
static unsigned short fnReadMII(unsigned long ulRegAdr)
{
    MACRIS_IACK = MDINT;                                                 // clear MDI interrupt
    MACMCTL = (READ_FROM_PHY | ulRegAdr);                                // command read from given address

    #ifdef _WINDOWS
    if (LM3SXXXX_PHY_IDENTIFIER_1 == ulRegAdr) {                         // simulate reads from identifier register
        MACMRXD = (PHY_IDENTIFIER >> 16);
    }
    else if (LM3SXXXX_PHY_IDENTIFIER_2 == ulRegAdr) {
        MACMRXD = (PHY_IDENTIFIER & 0x0000ffff);
    }
        #ifdef _TEMPEST_CLASS                                            // {18}
    else if (LM3SXXXX_PHY_INTERRUPT_STATUS == ulRegAdr) {
        MACMRXD = PHY_ENERGYON_INT;
    }    
        #else
    else if (LM3SXXXX_INTERRUPT_CONTROL_STATUS_REGISTER == ulRegAdr) {
        MACMRXD = PHY_LINK_UP_INT;
    }
        #endif
    else if (LM3SXXXX_BASIC_STATUS_REGISTER == ulRegAdr) {
        MACMRXD = PHY_100MEG_FULL_DUPLEX;
    }
    #endif

    while (!(MACRIS_IACK & MDINT)) {}                                    // wait for reception to complete

    return (unsigned short)MACMRXD;                                      // return the value read
}

// Routine to write a word to the PHY
//
static void fnWriteMII(unsigned long ulRegAdr, unsigned short usData)
{
    MACMTXD = usData;
    MACRIS_IACK = MDINT;                                                 // clear MDI interrupt
    MACMCTL = (WRITE_TO_PHY | ulRegAdr);                                 // command read from given address

    #ifdef _WINDOWS
    if (LM3SXXXX_BASIC_CONTROL_REGISTER == ulRegAdr) {
        usPhyMode = usData;
    }
    #endif
    while (!(MACRIS_IACK & MDINT)) {}                                    // wait for reception to complete
}


// EMAC interrupt dispatcher
//
__interrupt void EMAC_Interrupt(void)
{
    unsigned long ulMask = (unsigned long)MACIM;                         // EMAC interrupt mask
    #ifdef _WINDOWS
    extern unsigned long fnGetFifo_long(void);
    #define GET_FIFO_LONG() fnGetFifo_long();                            // {4}
    #else
    #define GET_FIFO_LONG() MACDATA
    #endif
    while ((MACRIS_IACK & ulMask) != 0) {                                // while enabled interrupts are waiting
    #ifdef LAN_REPORT_ACTIVITY
        unsigned char EMAC_int_message[ HEADER_LENGTH ] = { 0, 0, INTERRUPT_TASK_LAN_EXCEPTIONS, INTERRUPT_EVENT, EMAC_TX_INTERRUPT };
    #endif
        if (MACRIS_IACK & (RXINT | RXER | FOV)) {                        // reception frame available
            if (MACRIS_IACK & (RXER | FOV)) {                            // error
                unsigned char EMAC_err_message[ HEADER_LENGTH ];         // = { 0, 0, INTERRUPT_TASK_LAN_EXCEPTIONS, INTERRUPT_EVENT, ETHERNET_RX_ERROR };
                EMAC_err_message[MSG_DESTINATION_NODE] = EMAC_err_message[MSG_SOURCE_NODE] = 0;
                EMAC_err_message[MSG_DESTINATION_TASK] = INTERRUPT_TASK_LAN_EXCEPTIONS;
                EMAC_err_message[MSG_SOURCE_TASK] = INTERRUPT_EVENT;
                EMAC_err_message[MSG_INTERRUPT_EVENT] = ETHERNET_RX_ERROR;
                if (MACRIS_IACK & FOV) {
                    EMAC_err_message[MSG_INTERRUPT_EVENT] = ETHERNET_RX_OVERRUN;
                }
                uDisable_Interrupt();                                    // ensure message cannot be interrupted
                    fnWrite(INTERNAL_ROUTE, EMAC_err_message, HEADER_LENGTH); // inform the Ethernet task
                uEnable_Interrupt();                                     // release
            }
            else {
                unsigned long *ptrRxBuffer = (unsigned long *)ptrEthRxBuffer[iRxEthBufferPut]; // buffer is aligned
                unsigned long ulMacRxFrameLength = GET_FIFO_LONG();
                if (*(unsigned short *)ptrEthRxBuffer[iRxEthBufferPut] != 0) { // if the user has not yet retrieved last buffer, we reject latest frame and reset the Rx FIFO
                    unsigned char EMAC_err_message[ HEADER_LENGTH ];     // = { 0, 0, INTERRUPT_TASK_LAN_EXCEPTIONS, INTERRUPT_EVENT, ETHERNET_RX_ERROR };
                    EMAC_err_message[MSG_DESTINATION_NODE] = EMAC_err_message[MSG_SOURCE_NODE] = 0;
                    EMAC_err_message[MSG_DESTINATION_TASK] = INTERRUPT_TASK_LAN_EXCEPTIONS;
                    EMAC_err_message[MSG_SOURCE_TASK] = INTERRUPT_EVENT;
                    EMAC_err_message[MSG_INTERRUPT_EVENT] = ETHERNET_RX_ERROR;
                    MACRCTL |= MAC_RSTFIFO;                              // flush FIFO
                    uDisable_Interrupt();                                // ensure message cannot be interrupted
                        fnWrite(INTERNAL_ROUTE, EMAC_err_message, HEADER_LENGTH); // inform the Ethernet task
                    uEnable_Interrupt();                                 // release
                    MACRCTL &= ~MAC_RSTFIFO;
                }
                else {
                    unsigned long ulExtraInput;
                    *ptrRxBuffer = ulMacRxFrameLength - sizeof(unsigned short); // put the length and first 2 bytes into the buffer
                    ulMacRxFrameLength &= 0x0000ffff;                    // mask out the length
                    if (ulMacRxFrameLength > usEthernetInputSize) {
                        ulExtraInput = (ulMacRxFrameLength - usEthernetInputSize); // discard extra bytes
                        ulMacRxFrameLength = usEthernetInputSize;        // the size that we can accept
                        *(unsigned short *)ptrRxBuffer = usEthernetInputSize;
                    }
                    else {
                        ulExtraInput = 0;
                    }

                    while (1) {
                        *(++ptrRxBuffer) = GET_FIFO_LONG();              // copy all data from RX FIFO
                        if (ulMacRxFrameLength <= sizeof(unsigned long)) {
                            while (ulExtraInput) {
                                ulMacRxFrameLength = GET_FIFO_LONG();    // flush extra input
                                if (ulExtraInput <= 4) {
                                    break;
                                }
                                ulExtraInput -= sizeof(unsigned long);
                            }
                            break;
                        }
                        ulMacRxFrameLength -= sizeof(unsigned long);
                    }
                    if (++iRxEthBufferPut >= NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE) {
                        iRxEthBufferPut = 0;
                    }
    #if defined ETHERNET_RELEASE_AFTER_EVERY_FRAME
                    uTaskerStateChange(TASK_ETHERNET, UTASKER_ACTIVATE); // schedule the Ethernet task
    #else
                    uDisable_Interrupt();                                // ensure message can not be interrupted
                        fnWrite(INTERNAL_ROUTE, (unsigned char*)EMAC_RX_int_message, HEADER_LENGTH); // inform the Ethernet task that there is a valid input buffer waiting
        #ifdef LAN_REPORT_ACTIVITY
                        EMAC_int_message[MSG_INTERRUPT_EVENT] = EMAC_RX_INTERRUPT;
                        fnWrite(INTERNAL_ROUTE, (unsigned char*)EMAC_int_message, HEADER_LENGTH); // inform the task of event
        #endif
                    uEnable_Interrupt();                                 // release
    #endif
                }
            }
            MACRIS_IACK = (RXINT | RXER | FOV);                          // reset rx flags
    #ifdef _WINDOWS
            MACRIS_IACK &= ~(RXINT | RXER | FOV);                        // clear interrupt flags when simulating
    #endif
        }

