sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
        if (MACRIS_IACK & (TXEMP | TXER)) {                              // frame transmitted
            eth_tx_control->ETH_queue.chars = 0;                         // reset the transmission buffer for next use
            eth_tx_control->ETH_queue.put = eth_tx_control->ETH_queue.QUEbuffer;
    #ifdef LAN_REPORT_ACTIVITY
            if (MACRIS_IACK & TXER) {                                    // collision detection
                EMAC_int_message[MSG_INTERRUPT_EVENT] = ETHERNET_COLLISION;
            }
            uDisable_Interrupt();                                        // ensure message can not be interrupted
            fnWrite(INTERNAL_ROUTE, (unsigned char*)EMAC_int_message, HEADER_LENGTH); // inform the task of event
            uEnable_Interrupt();                                         // release
    #endif
            MACRIS_IACK = (TXEMP | TXER);                                // reset tx flags
    #ifdef _WINDOWS
            MACRIS_IACK &= ~(TXEMP | TXER);                              // clear interrupt flags when simulating
            MACTR &= ~NEWTX;                                             // transmitter no longer in use
    #endif
        }

        if (MACRIS_IACK & PHYINT) {                                      // PHY interrupt
    #ifdef INTERRUPT_TASK_PHY
            unsigned short usInterrupt = fnReadMII(LM3SXXXX_PHY_INTERRUPT_STATUS); // read the cause(s) of the interrupt, which resets the bits
            unsigned char int_phy_message[HEADER_LENGTH]; // = { 0, 0 , INTERRUPT_TASK_PHY, INTERRUPT_EVENT, UNKNOWN_INTERRUPT };    // define standard interrupt event
            int_phy_message[MSG_DESTINATION_NODE] = int_phy_message[MSG_SOURCE_NODE] = 0;
            int_phy_message[MSG_DESTINATION_TASK] = INTERRUPT_TASK_PHY;
            int_phy_message[MSG_SOURCE_TASK] = INTERRUPT_EVENT;
            int_phy_message[MSG_INTERRUPT_EVENT] = UNKNOWN_INTERRUPT;
            if ((PHY_ENERGYON_INT | PHY_AUTONEG_COMPLETE_INT) & usInterrupt) {
                usInterrupt = fnReadMII(LM3SXXXX_BASIC_STATUS_REGISTER); // check the  details of link
                if (usInterrupt & (PHY_100MEG_HALF_DUPLEX | PHY_100MEG_FULL_DUPLEX)) {
                    int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
                }
                else {
                    int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
                }
            }
            else if (PHY_LINK_DOWN_INT & usInterrupt) {
                int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_DOWN;
            }
        #ifdef _TEMPEST_CLASS                                            // {18}
        #else
            unsigned short usInterrupt = fnReadMII(LM3SXXXX_INTERRUPT_CONTROL_STATUS_REGISTER);// read the cause(s) of the interrupt, which resets the bits
            unsigned char int_phy_message[HEADER_LENGTH]; // = { 0, 0 , INTERRUPT_TASK_PHY, INTERRUPT_EVENT, UNKNOWN_INTERRUPT };    // define standard interrupt event
            int_phy_message[MSG_DESTINATION_NODE] = int_phy_message[MSG_SOURCE_NODE] = 0;
            int_phy_message[MSG_DESTINATION_TASK] = INTERRUPT_TASK_PHY;
            int_phy_message[MSG_SOURCE_TASK] = INTERRUPT_EVENT;
            int_phy_message[MSG_INTERRUPT_EVENT] = UNKNOWN_INTERRUPT;
            if (PHY_LINK_UP_INT & usInterrupt) {
                usInterrupt = fnReadMII(LM3SXXXX_BASIC_STATUS_REGISTER); // check the  details of link
                if (usInterrupt & (PHY_100MEG_HALF_DUPLEX | PHY_100MEG_FULL_DUPLEX)) {
                    int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_100;
                }
                else {
                    int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_UP_10;
                }
            }
            else if (PHY_LINK_DOWN_INT & usInterrupt) {
                int_phy_message[MSG_INTERRUPT_EVENT] = LAN_LINK_DOWN;
            }
    #endif
            uDisable_Interrupt();                                        // ensure interrupts remain blocked when putting message to queue
            fnWrite(INTERNAL_ROUTE, (unsigned char*)int_phy_message, HEADER_LENGTH); // Inform the corresponding task
            uEnable_Interrupt();                                         // release
    #else
        #ifdef _TEMPEST_CLASS                                            // {18}
            fnReadMII(LM3SXXXX_PHY_INTERRUPT_STATUS);                    // read the cause(s) of the interrupt, which resets the bits
        #else
            fnReadMII(LM3SXXXX_INTERRUPT_CONTROL_STATUS_REGISTER);       // read the cause(s) of the interrupt, which resets the bits
        #endif
    #endif
            MACRIS_IACK = PHYINT;                                        // reset interrupt flag
    #ifdef _WINDOWS
            MACRIS_IACK &= ~(PHYINT);                                    // clear interrupt flag when simulating
    #endif
        }
    }
}


// Ethernet configuration routine
//
extern int fnConfigEthernet(ETHTABLE *pars)
{
    unsigned long  ulPhyIdentifier;
    unsigned long  ulTemp;
    unsigned short usMIIData;

    RCGC2 |= (CGC_EPHY0 | CGC_EMAC0);                                    // enable power to the EMAC and PHY
    SRCR2 &= ~(CGC_EPHY0 | CGC_EMAC0);                                   // ensure they are not held in reset

    MACMDV = ((MASTER_CLOCK / 5) - 1);                                   // set the MII clock speed to 2.5MHz

    #ifdef USE_IPV6                                                      // {20}
    ulTemp =  network.ucOurMAC[3] << 24;                                 // set the MAC address
    ulTemp |= network.ucOurMAC[2] << 16;
    ulTemp |= network.ucOurMAC[1] << 8;
    ulTemp |= network.ucOurMAC[0];
    MACIA0 = ulTemp;
    ulTemp =  network.ucOurMAC[5] << 8;
    ulTemp |= network.ucOurMAC[4];
    MACIA1 = ulTemp;
    #else
    ulTemp =  pars->ucMAC[3] << 24;                                      // set the MAC address
    ulTemp |= pars->ucMAC[2] << 16;
    ulTemp |= pars->ucMAC[1] << 8;
    ulTemp |= pars->ucMAC[0];
    MACIA0 = ulTemp;
    ulTemp =  pars->ucMAC[5] << 8;
    ulTemp |= pars->ucMAC[4];
    MACIA1 = ulTemp;
    #endif

    if (pars->usMode & FULL_DUPLEX) {                                    // program the transmission operating mode
        MACTCTL = (MAC_TX_CRC | MAC_DUPLEX | MAC_PADEN);                 // full duplex operation
    }
    else {
        MACTCTL = (MAC_TX_CRC | MAC_PADEN);                              // half duplex operation
    }
    if (pars->usMode & PROMISCUOUS) {                                    // program the reception operating mode
        MACRCTL = (MAC_RSTFIFO | MAC_BADCRC | MAC_PRMS);                 // promiscuous mode
    }
    #ifdef USE_IPV6                                                      // {20}
    else if (pars->usMode & CON_MULTICAST) {                             // if multicast reception is to be configured
        MACRCTL = (MAC_RSTFIFO | MAC_BADCRC | MAC_AMUL);
    }
    #endif
    else {
        MACRCTL = (MAC_RSTFIFO | MAC_BADCRC);                            // non-promiscuous mode
    }

