sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
    ulPhyIdentifier = fnReadMII(LM3SXXXX_PHY_IDENTIFIER_1);              // check that the PHY is working correctly by reading its identifier
    ulPhyIdentifier <<= 16;
    ulPhyIdentifier |= fnReadMII(LM3SXXXX_PHY_IDENTIFIER_2);             // check that the PHY is working correctly by reading its identifier

    if ((ulPhyIdentifier & PHY_MASK) != PHY_IDENTIFIER) {
        return -1;                                                       // if the identifier is incorrect the phy isn't resonding correctly
    }

    if (pars->usMode & LAN_LEDS) {                                       // enable LEDs to be controlled by PHY
        _CONFIG_PERIPHERAL(F, EMAC0, 2, (PORTF_BIT2 | PORTF_BIT3), (PF3_LED0 | PF2_LED1)); // connect PHY control outputs to LED port lines
    }

    if (pars->usMode & (LAN_10M | LAN_100M)) {                           // if fixed speed
        usMIIData = 0;
        if (pars->usMode & LAN_100M)  {
            usMIIData |= PHY_SELECT_100M_SPEED;
        }
        if (pars->usMode & FULL_DUPLEX) {
            usMIIData |= PHY_FULL_DUPLEX_MODE;
        }
    }
    else {                                                               // else autonegotiate
        usMIIData = (PHY_ENABLE_AUTO_NEGOTIATION | PHY_RESTART_AUTO_NEGOTIATION);
    }

    if (pars->usMode & LOOPBACK) {
        usMIIData |= PHY_LOOP_BACK;                                      // test loop back at PHY
    }

    fnWriteMII(LM3SXXXX_BASIC_CONTROL_REGISTER, usMIIData);              // write the PHY operating mode

    ulTemp = 0;
    usEthernetInputSize = pars->usSizeRx;                                // save the length of input buffer used
    usMIIData = pars->usSizeRx + sizeof(unsigned short);                 // {1} ensure the buffer size has space to hold the length and is divisable by 4 (reuse variable usMIIData)
    while (usMIIData & 0x3) {
        usMIIData++;
    }
    while (ulTemp < NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE) {
        ptrEthRxBuffer[ulTemp++] = uMalloc((MAX_MALLOC)usMIIData);       // allocate a receive buffer pool (aligned addresses)
    }
    ptrEthTxBuffer = uMalloc((MAX_MALLOC)(pars->usSizeTx + sizeof(unsigned short))); // allocate a single tx message buffer (aligned address)
    ptrEthTxBuffer += sizeof(unsigned short);                            // make space for length when sending - the start of length is aligned

    MACIM = 0;                                                           // disable all interrupts
    MACRIS_IACK = (PHYINT | RXINT | TXEMP | TXER | FOV | RXER);          // reset pending interrupts

    fnEnterInterrupt(irq_Ethernet_Controller_ID, PRIORITY_EMAC, EMAC_Interrupt);

    MACIM = (PHYINT | RXINT | TXEMP | TXER | FOV | RXER);                // enable EMAC and PHY interrupts
#ifdef _TEMPEST_CLASS                                                    // {18}
    fnWriteMII(LM3SXXXX_PHY_INTERRUPT_MASK,                              // enable various PHY interrupts
//             PHY_REMOTE_FAULT_INT_ENABLE
//             PHY_LINK_PARTNER_ACK_INT_ENABLE
//             PHY_PARALLEL_DETECT_FAULT_INT_ENABLE
//             PHY_PAGE_RECEIVED_INT_ENABLE
//             PHY_RECEIVE_ERROR_INT_ENABLE
//             PHY_JABBER_INT_ENABLE
              (PHY_ENERGYON_INT_ENABLE | PHY_AUTONEG_COMPLETE_INT_ENABLE | PHY_LINK_DOWN_INT_ENABLE)
               );
#else
    fnWriteMII(LM3SXXXX_INTERRUPT_CONTROL_STATUS_REGISTER,               // enable various PHY interrupts
//             PHY_REMOTE_FAULT_INT_ENABLE
//             PHY_LINK_PARTNER_ACK_INT_ENABLE
//             PHY_PARALLEL_DETECT_FAULT_INT_ENABLE
//             PHY_PAGE_RECEIVED_INT_ENABLE
//             PHY_RECEIVE_ERROR_INT_ENABLE
//             PHY_JABBER_INT_ENABLE
              (PHY_LINK_UP_INT_ENABLE | PHY_LINK_DOWN_INT_ENABLE)
               );
#endif

    MACRCTL &= ~MAC_RSTFIFO;
    MACTCTL |= MAC_TXEN;                                                 // enable transmitter
    MACRCTL |= MAC_RXEN;                                                 // enable receiver

    #ifdef _WINDOWS
    fnOpenDefaultHostAdapter();                                          // simulate link up
    #endif
    return 0;
}



#ifdef _WINDOWS
// This routine is supplied to aid the simulator. It checks whether Ethereal frames should be accepted based
// on the programmed MAC address and the Ethernet operating mode
//
extern int fnCheckEthernetMode(unsigned char *ucData, unsigned short usLen)
{
    unsigned char ucProgrammedMAC[MAC_LENGTH];
    
    if (usLen < (2*MAC_LENGTH + 2)) {
        return 0;                                                        // too short to be a valid Ethernet frame
    }

    ucProgrammedMAC[5] = (unsigned char)(MACIA1>>8);                     // check mac address
    ucProgrammedMAC[4] = (unsigned char)(MACIA1);
    ucProgrammedMAC[3] = (unsigned char)(MACIA0>>24);
    ucProgrammedMAC[2] = (unsigned char)(MACIA0>>16);
    ucProgrammedMAC[1] = (unsigned char)(MACIA0>>8);
    ucProgrammedMAC[0] = (unsigned char)(MACIA0);

    if (!uMemcmp(&ucData[MAC_LENGTH], ucProgrammedMAC, MAC_LENGTH)) {
        return 0;                                                        // we never accept echos of our own transmissions
    }

    if (!(uMemcmp(ucData, cucBroadcast, MAC_LENGTH))) {
        return 1;                                                        // broadcast - always accept it
    }

    if (!(uMemcmp(ucData, ucProgrammedMAC, MAC_LENGTH))) {
        return 2;                                                        // our MAC
    }

    if (MACRCTL & MAC_PRMS) {
        return 3;                                                        // in promiscuous mode we accept everything
    }

    if ((MACRCTL & MAC_AMUL) && (*(ucData + 1) & 0x01)) {                // {20} if multicast frames are enabled accept multicast frames
        return 4;
    }

    return 0;                                                            // no match so reject
}
#endif


// This can be called by the Ethernet driver to wait a short time for the transmit buffer to become free
//
extern int fnWaitTxFree(void)
{
    volatile int iMaxWait = 0xffff;

    while (MACTR & NEWTX) {
        if (!(--iMaxWait)) {
            return 1;                                                    // abort because we have waited too long
        }
    }
    return 0;
}

