sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
// This can be called by the ethernet driver to find out how many receive buffers the Ethernet Controller has
//
extern int fnGetQuantityRxBuf(void)
{
    return NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE;
}

// This can be called by the ethernet driver to get the address of the corresponding Ethernet receive buffer
//
extern unsigned char *fnGetRxBufferAdd(int iBufNr)
{
    return (ptrEthRxBuffer[iBufNr]);
}

// This can be called by the ethernet driver to get the address of the corresponding Ethernet transmit buffer
//
extern unsigned char *fnGetTxBufferAdd(int iBufNr)
{
    return ptrEthTxBuffer;
}

// This can be called by the ethernet driver to free an Ethernet receive buffer after it has been used
//
extern void fnFreeEthernetBuffer(int iBufNr)
{
    *(unsigned short*)ptrEthRxBuffer[iRxEthBufferGet] = 0;               // free the buffer
    if (++iRxEthBufferGet >= NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE) {  // set to next
        iRxEthBufferGet = 0;
    }
}

// Data has been prepared, now send it over the ETHERNET interface
//
extern QUEUE_TRANSFER fnStartEthTx(QUEUE_TRANSFER DataLen, unsigned char *ptr_put)
{
    #ifdef _WINDOWS
    #define PUT_FIFO_LONG(x)
    QUEUE_TRANSFER length;
    #else
    #define PUT_FIFO_LONG(x) MACDATA = x
    #endif
    #if defined _WINDOWS
    unsigned char *ptrSentData;
    while (DataLen < 60) {                                               // device performs automatic zero padding
        *ptr_put++ = 0x00;                                               // pad with zeros if smaller than 60 [chip must send at least 60]
        DataLen++;
    }
    length = DataLen;
    #endif

    ptr_put -= (DataLen + 2);                                            // move back to long word boundary and put length in the buffer
    *ptr_put++ = (unsigned char)(DataLen - ETH_HEADER_LEN);              // put length (LSB) - only data without Ethernet header
    *ptr_put++ = (unsigned char)((DataLen - ETH_HEADER_LEN) >> 8);       // put length (MSB) - only data without Ethernet header
    #if defined _WINDOWS
    ptrSentData = ptr_put;
    #endif
    ptr_put -= 2;                                                        // put back to start (on long word boundary)
    DataLen += 2;                                                        // include length

    if (fnWaitTxFree() != 0) {                                           // ensure output FIFO is free
        return 0;                                                        // waited too long, failed
    }

    while (1) {
        PUT_FIFO_LONG(*(unsigned long *)ptr_put);
        if (DataLen <= sizeof(unsigned long)) {
            break;
        }
        ptr_put += sizeof(unsigned long);
        DataLen -= sizeof(unsigned long);
    }

    MACTR = NEWTX;                                                       // start transmission

    #if defined _WINDOWS
    fnSimulateEthTx(length, ptrSentData);
    if (usPhyMode & PHY_LOOP_BACK) {                                     // if the PHY is in loop back mode, simulate reception of sent frame
        fnSimulateEthernetIn(ptrSentData, length, 1);
    }
        #ifdef PSEUDO_LOOPBACK                                           // if we detect an IP frame being sent to our own address we loop it back to the input
    else if (((*(ptr_put + 12)) == 0x08) && (!(uMemcmp(&network[DEFAULT_NETWORK].ucOurIP[0], (ptr_put + 26), IPV4_LENGTH)))) {
        fnSimulateEthernetIn(ptr_put, length, 1);
    }
        #endif
    MACRIS_IACK |= TXEMP;
    if (MACIM & TXEMP) {                                                 // if interrupt enabled
        VECTOR_TABLE *ptrVect = (VECTOR_TABLE *)((unsigned char *)((unsigned char *)&vector_ram + RESERVE_DMA_MEMORY));
        ptrVect->processor_interrupts.irq_Ethernet_Controller();         // simulate end of transmission - tx interrupt
    }
    #endif
    return (DataLen);
}
#endif                                                                   // end of Ethernet option


#if defined SUPPORT_PORT_INTERRUPTS || defined SUPPORT_HW_FLOW
static LM3XXXXX_PORT_CONTROL *fnGetPortBlock(unsigned char ucPortReference)
{
    switch (ucPortReference) {
    #if (PART_DC4 & GPIOA_PRESENT4)
    case PORTA:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_A_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOB_PRESENT4)
    case PORTB:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_B_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOC_PRESENT4)
    case PORTC:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_C_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOD_PRESENT4)
    case PORTD:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_D_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOE_PRESENT4)
    case PORTE:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_E_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOF_PRESENT4)
    case PORTF:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_F_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOG_PRESENT4)
    case PORTG:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_G_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOH_PRESENT4)
    case PORTH:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_H_BLOCK + 0x3fc);
    #endif
    #if (PART_DC4 & GPIOJ_PRESENT4)
    case PORTJ:
        return (LM3XXXXX_PORT_CONTROL *)(GPIO_PORT_J_BLOCK + 0x3fc);
    #endif
    default:
        return 0;
    }
}
#endif


#ifdef SERIAL_INTERFACE
/* =================================================================== */
/*                    Serial Interface - UART                          */
/* =================================================================== */

    #ifdef _WINDOWS
    extern unsigned char ucTxLast[CHIP_HAS_UARTS] = {0};
    #endif

// Collect a pointer to defined UART control block
//
static LM3XXXXX_UART_CONTROL *fnSelectChannel(QUEUE_HANDLE Channel)
{
    switch (Channel) {
    case 0:
        return (LM3XXXXX_UART_CONTROL *)UART_0_BLOCK;
    #if CHIP_HAS_UARTS > 1
    case 1:
        return (LM3XXXXX_UART_CONTROL *)UART_1_BLOCK;
    #endif
    #if CHIP_HAS_UARTS > 2
    case 2:
        return (LM3XXXXX_UART_CONTROL *)UART_2_BLOCK;
    #endif
    }
    return 0;                                                            // invalid
}

#if defined SERIAL_SUPPORT_DMA && defined CHIP_HAS_uDMA                  // {9}
    #ifdef _WINDOWS
        #define fnGetDMA_control(x)  (DMA_CONTROL_STRUCTURE *)((CAST_POINTER_ARITHMETIC)&vector_ram + (x*sizeof(DMA_CONTROL_STRUCTURE)));
    #else
        #define fnGetDMA_control(x)  (DMA_CONTROL_STRUCTURE *)(RAM_START_ADDRESS + (x*sizeof(DMA_CONTROL_STRUCTURE)));
    #endif
#endif

// configure the SCI hardware
//
extern void fnConfigSCI(QUEUE_HANDLE Channel, TTYTABLE *pars)
{
    LM3XXXXX_UART_CONTROL *uart;
    unsigned short usSpeedInteger;
    unsigned char  ucSpeedFraction;

    switch (Channel) {                                                   // enable clocks to the peripheral and configure pins
    case 0:
        _CONFIG_PERIPHERAL(A, UART0, 1, (PORTA_BIT0 | PORTA_BIT1), (PA0_U0Rx | PA1_U0Tx));
    #if defined SERIAL_SUPPORT_DMA && defined CHIP_HAS_uDMA
        if (pars->ucDMAConfig & UART_TX_DMA) {
            DMA_CONTROL_STRUCTURE *ptrDmaControl = fnGetDMA_control(DMA_UART0_TRANSMIT_CH);
            ptrDmaControl->DMADSTENDP = (volatile unsigned char *)UARTDR_0_ADDR; // set fixed transfer destination address
            DMAALTCLR = DMA_UART0_TRANSMIT_BIT;                          // set to primary DMA control block
            DMAUSEBURSTCLR = DMA_UART0_TRANSMIT_BIT;                     // respond to single and burst requests
            DMAREQMASKCLR = DMA_UART0_TRANSMIT_BIT;                      // enable DMA requests for the channel
            UARTDMACTL_0 = TXDMAE;                                       // enable DMA transmit operation on UART
        }
    #endif
        break;
    #if CHIP_HAS_UARTS > 1
    case 1:
        #if defined UART1_ON_PORT_C
        _CONFIG_PERIPHERAL(C, UART1, 1, (PORTC_BIT6 | PORTC_BIT7), (PC6_U1Rx | PC7_U1Tx));
        #else
        _CONFIG_PERIPHERAL(D, UART1, 1, (PORTD_BIT2 | PORTD_BIT3), (PD2_U1Rx | PD3_U1Tx));
        #endif
        #if defined SERIAL_SUPPORT_DMA && defined CHIP_HAS_uDMA
        if (pars->ucDMAConfig & UART_TX_DMA) {
            DMA_CONTROL_STRUCTURE *ptrDmaControl = fnGetDMA_control(DMA_UART1_TRANSMIT_CH);
            ptrDmaControl->DMADSTENDP = (volatile unsigned char *)UARTDR_1_ADDR; // set fixed transfer destination address
            DMAALTCLR = DMA_UART1_TRANSMIT_BIT;                          // set to primary DMA control block
            DMAUSEBURSTCLR = DMA_UART1_TRANSMIT_BIT;                     // respond to single and burst requests
            DMAREQMASKCLR = DMA_UART1_TRANSMIT_BIT;                      // enable DMA requests for the channel
            UARTDMACTL_1 = TXDMAE;                                       // enable DMA transmit operation on UART
        }
        #endif
        break;
    #endif
    #if CHIP_HAS_UARTS > 2
    case 2:
        _CONFIG_PERIPHERAL(G, UART2, 1, (PORTG_BIT0 | PORTG_BIT1), (PG0_U2Rx | PG1_U2Tx));
        #if defined  SERIAL_SUPPORT_DMA && defined CHIP_HAS_uDMA
        if (pars->ucDMAConfig & UART_TX_DMA) {
            DMA_CONTROL_STRUCTURE *ptrDmaControl = fnGetDMA_control(DMA_UART2_TRANSMIT_CH);
            ptrDmaControl->DMADSTENDP = (volatile unsigned char *)UARTDR_2_ADDR; // set fixed transfer destination address
            DMAALTCLR = DMA_UART2_TRANSMIT_BIT;                          // set to primary DMA control block
            DMAUSEBURSTCLR = DMA_UART2_TRANSMIT_BIT;                     // respond to single and burst requests
            DMAREQMASKCLR = DMA_UART2_TRANSMIT_BIT;                      // enable DMA requests for the channel
            UARTDMACTL_2 = TXDMAE;                                       // enable DMA transmit operation on UART
        }
        #endif
        break;
    default:
    #if NUMBER_EXTERNAL_SERIAL > 0                                       // {29}
        fnConfigExtSCI((QUEUE_HANDLE)(Channel - NUMBER_SERIAL), pars);   // pass on to external UART driver
        #if defined SUPPORT_HW_FLOW
        if ((pars->Config & RTS_CTS) != 0) {                             // HW flow control defined so configure RTS/CTS pins
            fnControlLine(Channel, (CONFIG_RTS_PIN | CONFIG_CTS_PIN), 0);
        }
        #endif
    #endif
        return;
    #endif
    }
    uart = fnSelectChannel(Channel);
    uart->UARTCTL = 0;                                                   // {21} disable before configuring
    #if defined SUPPORT_HW_FLOW                                          // {6}
    if (pars->Config & RTS_CTS) {                                        // HW flow control defined so configure RTS/CTS pins
        fnControlLine(Channel, (CONFIG_RTS_PIN | CONFIG_CTS_PIN), 0);
    }
    #endif

    switch (pars->ucSpeed) {
    case SERIAL_BAUD_300:
        usSpeedInteger = ((MASTER_CLOCK/16)/300);                        // set 300
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)300) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)300))) + (float)0.5));
        break;
    case SERIAL_BAUD_600:
        usSpeedInteger = ((MASTER_CLOCK/16)/600);                        // set 600
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)600) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)600))) + (float)0.5));
        break;
    case SERIAL_BAUD_1200:
        usSpeedInteger = ((MASTER_CLOCK/16)/1200);                       // set 1200
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)1200) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)1200))) + (float)0.5));
        break;
    case SERIAL_BAUD_2400:
        usSpeedInteger = ((MASTER_CLOCK/16)/2400);                       // set 1200
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)2400) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)2400))) + (float)0.5));
        break;
    case SERIAL_BAUD_4800:
        usSpeedInteger = ((MASTER_CLOCK/16)/4800);                       // set 4800
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)4800) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)4800))) + (float)0.5));
        break;
    case SERIAL_BAUD_9600:
        usSpeedInteger = ((MASTER_CLOCK/16)/9600);                       // set 9600
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)9600) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)9600))) + (float)0.5));
        break;
    case SERIAL_BAUD_14400:
        usSpeedInteger = ((MASTER_CLOCK/16)/14400);                      // set 14400
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)14400) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)14400))) + (float)0.5));
        break;
    default:                                                             // if not valid value set this one
    case SERIAL_BAUD_19200:
        usSpeedInteger = ((MASTER_CLOCK/16)/19200);                      // set 19200
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)19200) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)19200))) + (float)0.5));
        break;
    case SERIAL_BAUD_38400:
        usSpeedInteger = ((MASTER_CLOCK/16)/38400);                      // set 38400
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)38400) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)38400))) + (float)0.5));
        break;
    case SERIAL_BAUD_57600:
        usSpeedInteger = ((MASTER_CLOCK/16)/57600);                      // set 57600
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)57600) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)57600))) + (float)0.5));
        break;
    case SERIAL_BAUD_115200:
        usSpeedInteger = ((MASTER_CLOCK/16)/115200);                     // set 115200
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)115200) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)115200))) + (float)0.5));
        break;
    case SERIAL_BAUD_230400:
        usSpeedInteger = ((MASTER_CLOCK/16)/230400);                     // set 230400
        ucSpeedFraction = (unsigned char)((float)((64 * ((float)(((float)MASTER_CLOCK/(float)16)/(float)230400) - (int)(float)(((float)MASTER_CLOCK/(float)16)/(float)230400))) + (float)0.5));
        break;
    }

