sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
    uart->UARTIBRD = usSpeedInteger;                                     // prepare the baud rate settings
    uart->UARTFBRD = ucSpeedFraction;

#if defined UART_EXTENDED_MODE
    if (pars->Config & MULTIDROP_MODE_TX) {                              // {15}
        uart->UARTLCRH = (UART_STICK_PARITY | UART_PARITY_ENABLE | UART_PARITY_EVEN); // stick parity '0' The 9th bits is always sent as '0' and checked for '0'
    }
    else {
#endif
        if (pars->Config & (RS232_ODD_PARITY | RS232_EVEN_PARITY)) {
            if (pars->Config & RS232_ODD_PARITY) {
                uart->UARTLCRH = (UART_PARITY_ENABLE | UART_PARITY_ODD); // program odd parity
            }
            else {
                uart->UARTLCRH = (UART_PARITY_ENABLE | UART_PARITY_EVEN);// program even parity
            }
        }
        else {
            uart->UARTLCRH = UART_PARITY_DISABLED;                       // no parity
        }
#ifdef UART_EXTENDED_MODE
    }
#endif

    if (pars->Config & TWO_STOPS) {
        uart->UARTLCRH |= UART_2_STOP_BITS;                              // set 2 stop bits rather than 1 stop bit
    }

    if (pars->Config & CHAR_7) {
        uart->UARTLCRH |= UART_7_BIT_CHAR;                               // set 7 bit characters
    }
    else {
        uart->UARTLCRH |= UART_8_BIT_CHAR;                               // set 8 bit characters
    }

    #ifdef _WINDOWS
    fnConfigSimSCI(Channel, MASTER_CLOCK/(uart->UARTIBRD*16), pars);     // open a serial port on PC if desired
    #endif
    uart->UARTCTL = UARTEN;                                              // enable UART
}

// SCI0 interrupt
//
static __interrupt void SCI0_Interrupt(void)
{
    while (UARTMIS_0 != 0) {                                             // while interrupts present from UART0
        if (UARTMIS_0 & UART_RXIM) {                                     // reception interrupt pending
            _CLEAR_INTERRUPT(UARTICR, 0, UART_RXIM);                     // clear the interrupt
            fnSciRxByte((unsigned char)UARTDR_0, 0);                     // receive data interrupt - read the byte
        }

        if (UARTMIS_0 & UART_TXIM) {                                     // transmission interrupt pending
            _CLEAR_INTERRUPT(UARTICR, 0, UART_TXIM);                     // clear the interrupt
            fnSciTxByte(0);                                              // transmit data empty interrupt - write next byte
        }
    }
    #ifdef _WINDOWS
    UARTICR_0 = 0;                                                       // clear interrupt clear register
    #endif
}

#ifdef UART_EXTENDED_MODE
// The Luminary Micro UART doesn't inherently support multi-drop mode so we use the parity bit as extended bit
//
extern unsigned char fnGetMultiDropByte(QUEUE_HANDLE channel)            // {15}
{
    volatile unsigned long *ptrStatus = (UARTDR_0_ADDR + 1);
    ptrStatus += (channel * ((UART_1_BLOCK - UART_0_BLOCK)/sizeof(unsigned long))); // set to UARTRSR_ECR_x
    if (*ptrStatus & UART_PE) {                                          // check for parity error (expecting '0' for no parity)
        return 0x01;
    }
    else {
        return 0x00;
    }
}
#endif

#if CHIP_HAS_UARTS > 1
// SCI1 interrupt
//
static __interrupt void SCI1_Interrupt(void)
{
    while (UARTMIS_1 != 0) {                                             // while interrupts present from UART1
        if (UARTMIS_1 & UART_RXIM) {                                     // reception interrupt pending
            _CLEAR_INTERRUPT(UARTICR, 1, UART_RXIM);                     // clear the interrupt
            fnSciRxByte((unsigned char)UARTDR_1, 1);                     // receive data interrupt - read the byte
        }

        if (UARTMIS_1 & UART_TXIM) {                                     // transmission interrupt pending
            _CLEAR_INTERRUPT(UARTICR, 1, UART_TXIM);                     // clear the interrupt
            fnSciTxByte(1);                                              // transmit data empty interrupt - write next byte
        }
    }
    #ifdef _WINDOWS
    UARTICR_1 = 0;                                                       // clear interrupt clear register
    #endif
}
#endif
#if CHIP_HAS_UARTS > 2
// SCI2 interrupt
//
static __interrupt void SCI2_Interrupt(void)
{
    while (UARTMIS_2 != 0) {                                             // while interrupts present from UART2
        if (UARTMIS_2 & UART_RXIM) {                                     // reception interrupt pending
            _CLEAR_INTERRUPT(UARTICR, 2, UART_RXIM);                     // clear the interrupt
            fnSciRxByte((unsigned char)UARTDR_2, 2);                     // receive data interrupt - read the byte
        }

        if (UARTMIS_2 & UART_TXIM) {                                     // transmission interrupt pending
            _CLEAR_INTERRUPT(UARTICR, 2, UART_TXIM);                     // clear the interrupt
            fnSciTxByte(2);                                              // transmit data empty interrupt - write next byte
        }
    }
    #ifdef _WINDOWS
    UARTICR_2 = 0;                                                       // clear interrupt clear register
    #endif
}
#endif

static void fnConfigUARTInterrupt(QUEUE_HANDLE Channel)
{
    switch (Channel) {                                                   // enter the interrupt handler
    case 0:
        fnEnterInterrupt(irq_UART0_ID, PRIORITY_UART0, SCI0_Interrupt);  // configure and enter the handling interrupt routine in the vector table
        break;
    #if CHIP_HAS_UARTS > 1
    case 1:
        fnEnterInterrupt(irq_UART1_ID, PRIORITY_UART1, SCI1_Interrupt);; // configure and enter the handling interrupt routine in the vector table
        break;
    #endif
    #if CHIP_HAS_UARTS > 2
    case 2:
        fnEnterInterrupt(irq_UART2_ID, PRIORITY_UART2, SCI2_Interrupt);; // configure and enter the handling interrupt routine in the vector table
        break;
    #endif
    }
}

#if defined SERIAL_SUPPORT_DMA                                           // {9}

// Set up the uDMA for reception of the defined character block
//
extern void fnPrepareRxDMA(QUEUE_HANDLE channel, unsigned char *ptrStart, QUEUE_TRANSFER rx_length)
{
    #if defined CHIP_HAS_uDMA
    #endif
}

// Start transfer of a block via uDMA
//
extern QUEUE_TRANSFER fnTxByteDMA(QUEUE_HANDLE channel, unsigned char *ptrStart, QUEUE_TRANSFER tx_length)
{
    #if defined CHIP_HAS_uDMA
    DMA_CONTROL_STRUCTURE *ptrDmaControl;
    unsigned long ulChannel;
    if (tx_length == 0) {
        return 0;
    }
    else if (tx_length > MAX_TX_DMA) {                                   // limit to the uDMA length
        tx_length = MAX_TX_DMA;
    }
    switch (channel) {
    case 0:
        ptrDmaControl = fnGetDMA_control(DMA_UART0_TRANSMIT_CH);
        ulChannel = DMA_UART0_TRANSMIT_BIT;
            #ifdef _WINDOWS
        iDMA |= DMA_UART0_TRANSMIT_BIT;
            #endif
        break;
        #if CHIP_HAS_UARTS > 1
    case 1:
        ptrDmaControl = fnGetDMA_control(DMA_UART1_TRANSMIT_CH);
        ulChannel = DMA_UART1_TRANSMIT_BIT;
            #ifdef _WINDOWS
        iDMA |= DMA_UART1_TRANSMIT_BIT;
            #endif
        break;
        #endif
        #if CHIP_HAS_UARTS > 2
    case 2:
        ptrDmaControl = fnGetDMA_control(DMA_UART2_TRANSMIT_CH);
        ulChannel = DMA_UART2_TRANSMIT_BIT;
            #ifdef _WINDOWS
        iDMA |= DMA_UART2_TRANSMIT_BIT;
            #endif
        break;
        #endif
    default:
        return 0;
    }
    tx_length--;
    ptrDmaControl->DMASRCENDP = (ptrStart + tx_length);                  // set the last source address (inclusive)
    ptrDmaControl->DMACHCTL = ((XFERMODE_BASIC | ARBSIZE_4 | SRCSIZE_8_BIT | DSTSIZE_8_BIT | SRCINC_BYTE | DSTINC_NO_INC) | (tx_length << XFERSIZE_SHIFT));
    #ifdef _WINDOWS
    DMAENASET |= ulChannel;                                              // start the transmission
    #else
    DMAENASET = ulChannel;                                               // start the transmission
    #endif
    return (tx_length + 1);                                              // return the length of data accepted
    #else
    return 0;
    #endif
}
    #ifdef SERIAL_SUPPORT_XON_XOFF
extern QUEUE_TRANSFER fnRemainingDMA_tx(QUEUE_HANDLE channel)
{
    return 0;
}
    #endif

