sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
extern QUEUE_TRANSFER fnAbortTxDMA(QUEUE_HANDLE channel, QUEQUE *ptrQueue)
{
    #if defined CHIP_HAS_uDMA
    DMA_CONTROL_STRUCTURE *ptrDmaControl;
    switch (channel) {
    case 0:
        DMAENACLR = DMA_UART0_TRANSMIT_BIT;                              // stop DMA activity on this transmission channel
        #ifdef _WINDOWS
        DMAENASET &= ~DMA_UART0_TRANSMIT_BIT;
        #endif
        ptrDmaControl = fnGetDMA_control(DMA_UART0_TRANSMIT_CH);
        break;
        #if CHIP_HAS_UARTS > 1
    case 1:
        DMAENACLR = DMA_UART1_TRANSMIT_BIT;                              // stop DMA activity on this transmission channel
        #ifdef _WINDOWS
        DMAENASET &= ~DMA_UART1_TRANSMIT_BIT;
        #endif
        ptrDmaControl = fnGetDMA_control(DMA_UART1_TRANSMIT_CH);
        break;
        #endif
        #if CHIP_HAS_UARTS > 2
    case 2:
        DMAENACLR = DMA_UART2_TRANSMIT_BIT;                              // stop DMA activity on this transmission channel
        #ifdef _WINDOWS
        DMAENASET &= ~DMA_UART2_TRANSMIT_BIT;
        #endif
        ptrDmaControl = fnGetDMA_control(DMA_UART2_TRANSMIT_CH);
        break;
        #endif
    default:
        return 0;
    }
    if ((ptrDmaControl->DMACHCTL & XFERMODE_MASK) == 0) {                // return the number of transfers still open
        return 0;
    }
    else {
        return (unsigned short)(((unsigned short)((ptrDmaControl->DMACHCTL & XFERSIZE_MASK) >> XFERSIZE_SHIFT)) + 1);
    }
    return 0;
    #else
    return 0;
    #endif
}
#endif

// Enable reception on the defined channel
//
extern void fnRxOn(QUEUE_HANDLE Channel)
{
    LM3XXXXX_UART_CONTROL *uart;

#if NUMBER_EXTERNAL_SERIAL > 0                                           // {29}
    if (Channel >= NUMBER_SERIAL) {
        fnExtSCIRxOn((QUEUE_HANDLE)(Channel - NUMBER_SERIAL));           // pass on to external UART driver
        return;
    }
#endif
    uart = fnSelectChannel(Channel);
    fnConfigUARTInterrupt(Channel);                                      // ensure interrupt is configured
    uart->_UARTICR = UART_RXIM;                                          // clear any pending interrupts
    uart->UARTIM |= UART_RXIM;                                           // enable interrupt on reception
    uart->UARTCTL |= UARTRXEN;                                           // enable the receiver
    #ifdef _WINDOWS
    uart->_UARTICR = 0;
    #endif
}

// Disable reception on the defined channel
//
extern void fnRxOff(QUEUE_HANDLE Channel)
{
    LM3XXXXX_UART_CONTROL *uart;
#if NUMBER_EXTERNAL_SERIAL > 0                                           // {29}
    if (Channel >= NUMBER_SERIAL) {
        fnExtSCIRxOff((QUEUE_HANDLE)(Channel - NUMBER_SERIAL));          // pass on to external UART driver
        return;
    }
#endif
    uart = fnSelectChannel(Channel);
    uart->UARTIM &= ~UART_RXIM;                                          // disable interrupt on reception
    uart->UARTCTL &= ~UARTRXEN;                                          // disable the receiver
}

// Enable transmission on the defined channel
//
extern void fnTxOn(QUEUE_HANDLE Channel)
{
    LM3XXXXX_UART_CONTROL *uart;
#if NUMBER_EXTERNAL_SERIAL > 0                                           // {29}
    if (Channel >= NUMBER_SERIAL) {
        fnExtSCITxOn((QUEUE_HANDLE)(Channel - NUMBER_SERIAL));          // pass on to external UART driver
        return;
    }
#endif
    uart = fnSelectChannel(Channel);
    fnConfigUARTInterrupt(Channel);                                      // ensure interrupt is configured
    uart->_UARTICR = UART_TXIM;                                          // clear any pending interrupts
    uart->UARTIM |= UART_TXIM;                                           // enable interrupt on transmission
    uart->UARTCTL |= UARTTXEN;                                           // enable the transmitter
    #ifdef _WINDOWS
    uart->_UARTICR = 0;
    #endif
}

// Disable transmission on the defined channel
//
extern void fnTxOff(QUEUE_HANDLE Channel)
{
    LM3XXXXX_UART_CONTROL *uart;
#if NUMBER_EXTERNAL_SERIAL > 0                                           // {29}
    if (Channel >= NUMBER_SERIAL) {
        fnExtSCITxOff((QUEUE_HANDLE)(Channel - NUMBER_SERIAL));          // pass on to external UART driver
        return;
    }
#endif
    uart = fnSelectChannel(Channel);
    uart->UARTIM &= ~UART_TXIM;                                          // disable interrupt on transmission
    uart->UARTCTL &= ~UARTTXEN;                                          // disable the transmitter
}

#if defined UART_BREAK_SUPPORT
extern void fnStartBreak(QUEUE_HANDLE channel)
{
}

extern void fnStopBreak(QUEUE_HANDLE channel)
{
}
#endif

// The TTY driver uses this call to disable the transmit interrupt of the serial port
//
extern void fnClearTxInt(QUEUE_HANDLE channel)
{
}


// The TTY driver uses this call to send a byte of data over the serial port
//
extern int fnTxByte(QUEUE_HANDLE channel, unsigned char ucTxByte)
{
    LM3XXXXX_UART_CONTROL *uart;

    #if NUMBER_EXTERNAL_SERIAL > 0                                       // {29}
    if (channel >= NUMBER_SERIAL) {
        fnExtSCI_send((QUEUE_HANDLE)(channel - NUMBER_SERIAL), ucTxByte);// pass on to the external interface for transmission
        return 0;
    }
    #endif

    uart = fnSelectChannel(channel);
    if ((uart->UARTFR & UARTTXFE) == 0) {
        return 1;                                                        // presently busy
    }
    if (ucTxByte == 0x13) {
        ucTxByte = 0x13;
    }
    uart->UARTDR = ucTxByte;                                             // transmit the data

    #ifdef _WINDOWS
    uart->UARTFR &= ~(UARTTXFE);                                         // mark transmitter presently not empty
    ucTxLast[channel] = (unsigned char)uart->UARTDR;                     // back up the data written so that it can't get lost when rx data uses the simulated register
    switch (channel) {                                                   // activate first interrupt
    case 0:
        iInts |= CHANNEL_0_SERIAL_INT;
        break;
    case 1:
        iInts |= CHANNEL_1_SERIAL_INT;
        break;
    case 2:
        iInts |= CHANNEL_2_SERIAL_INT;
        break;
    }
    #endif
    return 0;                                                            // OK, we were not busy
}

#if defined SUPPORT_HW_FLOW
static void fnSetRTS(QUEUE_HANDLE channel, int iState)                   // {6}
{
    switch (channel) {
    #if defined RTS_0_PIN
    case 0:
        if (iState != 0) {
            RTS_0_PORT &= ~RTS_0_PIN;                                    // assert RTS
        }
        else {
            RTS_0_PORT |= RTS_0_PIN;                                     // negate RTS
        }            
        break;
    #endif
    #if CHIP_HAS_UARTS > 1 && defined RTS_1_PIN                          // only if second UART is available
    case 1:
        if (iState != 0) {
            RTS_1_PORT &= ~RTS_1_PIN;                                    // assert RTS
        }
        else {
            RTS_1_PORT |= RTS_1_PIN;                                     // negate RTS
        }           
        break;
    #endif
    #if CHIP_HAS_UARTS > 2 && defined RTS_2_PIN                          // only if third UART is available
    case 2:
        if (iState != 0) {
            RTS_2_PORT &= ~RTS_2_PIN;                                    // assert RTS
        }
        else {
            RTS_2_PORT |= RTS_2_PIN;                                     // negate RTS
        }   
        break;
    #endif
    #if NUMBER_EXTERNAL_SERIAL > 0                                       // {29}
    default:
        fnSetExtRTS((QUEUE_HANDLE)(channel - NUMBER_SERIAL), iState);
        break;
    #endif
    }
}


// The Luminary-Micro devices (generally) do not have RTS/CTS pins and so these are controlled by user defined ports
//
extern void fnControlLine(QUEUE_HANDLE channel, unsigned short usModifications, UART_MODE_CONFIG OperatingMode)
{
    if (usModifications & (CONFIG_RTS_PIN | CONFIG_CTS_PIN)) {           // {6}
        if (usModifications & CONFIG_RTS_PIN) {
            switch (channel) {
        #if CHIP_HAS_UARTS > 0 && defined RTS_0_PIN
            case 0:
                RCGC2 |= RTS_0_PORT_POWER;                               // power up the port and configure as digital output
                RTS_0_PORT_ENABLE |= RTS_0_PIN;
                RTS_0_PORT_DDR |= RTS_0_PIN;  
                break;
        #endif
        #if CHIP_HAS_UARTS > 1 && defined RTS_1_PIN                      // only if second UART is available
            case 1:
                RCGC2 |= RTS_1_PORT_POWER;                               // power up the port and configure as digital output
                RTS_1_PORT_ENABLE |= RTS_1_PIN;
                RTS_1_PORT_DDR |= RTS_1_PIN; 
                break;
        #endif
        #if CHIP_HAS_UARTS > 2 && defined RTS_2_PIN                      // only if third UART is available
            case 2:
                RCGC2 |= RTS_2_PORT_POWER;                               // power up the port and configure as digital output
                RTS_2_PORT_ENABLE |= RTS_2_PIN;
                RTS_2_PORT_DDR |= RTS_2_PIN; 
                break;
        #endif
            }
        #if NUMBER_EXTERNAL_SERIAL > 0                                   // {29}
            if ((channel >= CHIP_HAS_UARTS) && (usModifications & SET_RS485_MODE)) {
                fnSetRS485Mode((QUEUE_HANDLE)(channel - CHIP_HAS_UARTS), (usModifications & SET_RS485_NEG));
            }
            else {
                fnSetRTS(channel, 0);                                    // drive the RTS line in negated state
            }
        #else
            fnSetRTS(channel, 0);                                        // drive the RTS line in negated state
        #endif
        }
        if (usModifications & CONFIG_CTS_PIN) {
            switch (channel) {
        #if defined CTS_0_PIN
            case 0:
                RCGC2 |= CTS_0_PORT_POWER;                               // power up the port and configure as digital output
                CTS_0_PORT_ENABLE |= CTS_0_PIN;
                CTS_0_PORT_DDR &= ~CTS_0_PIN;
                break;
        #endif
        #if CHIP_HAS_UARTS > 1 && defined CTS_1_PIN                      // only if second UART is available
            case 1:
                RCGC2 |= CTS_1_PORT_POWER;                               // power up the port and configure as digital output
                CTS_1_PORT_ENABLE |= CTS_1_PIN;
                CTS_1_PORT_DDR &= ~CTS_1_PIN;
                break;
        #endif
        #if CHIP_HAS_UARTS > 2 && defined CTS_2_PIN                      // only if third UART is available
            case 2:
                RCGC2 |= CTS_2_PORT_POWER;                               // power up the port and configure as digital output
                CTS_2_PORT_ENABLE |= CTS_2_PIN;
                CTS_2_PORT_DDR &= ~CTS_2_PIN;
                break;
        #endif
            }
        }
    }

    if (usModifications & (SET_RTS | SET_CTS)) {                         // SET_CTS may be used in DCE mode and results in the same action as SET_RTS
        fnSetRTS(channel, 1);                                            // drive asserted RTS
    }
    else if (usModifications & (CLEAR_RTS | CLEAR_CTS)) {                // deactivate RTS
        fnSetRTS(channel, 0);                                            // drive negated RTS
    }
}

static const unsigned char cts_port[CHIP_HAS_UARTS] = {
#if defined CTS_0_PIN
    CTS_0_PORT, 
#else
    0,
#endif
#if CHIP_HAS_UARTS > 1
    #if defined CTS_1_PIN
    CTS_1_PORT,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 2
    #if defined CTS_2_PIN
    CTS_2_PORT,
    #else
    0,
    #endif
#endif
};

static const unsigned char cts_irq_priority[CHIP_HAS_UARTS] = {
#if defined CTS_0_PIN
    CTS_0_INT_PRIORITY, 
#else
    0,
#endif
#if CHIP_HAS_UARTS > 1
    #if defined CTS_1_PIN
    CTS_1_INT_PRIORITY, 
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 2
    #if defined CTS_2_PIN
    CTS_2_INT_PRIORITY, 
    #else
    0,
    #endif
#endif
};

