sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
static const unsigned char cts_port_bit[CHIP_HAS_UARTS] = {
#if defined CTS_0_PIN
    CTS_0_PIN,
#else
    0,
#endif
#if CHIP_HAS_UARTS > 1
    #if defined CTS_1_PIN
    CTS_1_PIN,
    #else
    0,
    #endif
#endif
#if CHIP_HAS_UARTS > 2
    #if defined CTS_2_PIN
    CTS_2_PIN,
    #else
    0,
    #endif
#endif
};

static void cts0_change(void)
{
    #if defined CTS_0_PIN
    LM3XXXXX_PORT_CONTROL *port = fnGetPortBlock(cts_port[0]);
    fnRTS_change(0, ((port->GPIODATA & cts_port_bit[0]) == 0));         // control transmission according to state of CTS line
    #endif
}

#if CHIP_HAS_UARTS > 1
static void cts1_change(void)
{
    #if defined CTS_1_PIN
    LM3XXXXX_PORT_CONTROL *port = fnGetPortBlock(cts_port[1]);
    fnRTS_change(1, ((port->GPIODATA & cts_port_bit[1]) == 0));         // control transmission according to state of CTS line
    #endif
}
#endif
#if CHIP_HAS_UARTS > 2
static void cts2_change(void)
{
    #if defined CTS_2_PIN
    LM3XXXXX_PORT_CONTROL *port = fnGetPortBlock(cts_port[2]);
    fnRTS_change(2, ((port->GPIODATA & cts_port_bit[2]) == 0));         // control transmission according to state of CTS line
    #endif
}
#endif

static void ( *cts_change[CHIP_HAS_UARTS] )( void ) = {
    cts0_change,
#if CHIP_HAS_UARTS > 1
    cts1_change,
#endif
#if CHIP_HAS_UARTS > 2
    cts2_change,
#endif
};


// Modify control line interrupt operation
//
extern QUEUE_TRANSFER fnControlLineInterrupt(QUEUE_HANDLE channel, unsigned short usModifications, UART_MODE_CONFIG OperatingMode)
{
    QUEUE_TRANSFER ControlLines = 0;
    #if NUMBER_EXTERNAL_SERIAL > 0                                       // {29}
    if (channel >= NUMBER_SERIAL) {
        return (fnControlExtLineInterrupt((QUEUE_HANDLE)(channel - NUMBER_SERIAL), usModifications, OperatingMode));
    }
    #endif
    if (usModifications & (ENABLE_CTS_CHANGE | DISABLE_CTS_CHANGE)) {    // {11}
        INTERRUPT_SETUP interrupt_setup;                                 // interrupt configuration parameters
        interrupt_setup.int_type = PORT_INTERRUPT;                       // identifier when configuring
        if (usModifications & ENABLE_CTS_CHANGE) {
            interrupt_setup.int_handler = cts_change[channel];           // handling function
        }
        else {
            interrupt_setup.int_handler = 0;                             // disable interrupts
        }
        interrupt_setup.int_port = cts_port[channel];                    // the port used
        interrupt_setup.int_priority = cts_irq_priority[channel];        // port interrupt priority
        interrupt_setup.int_port_bit = cts_port_bit[channel];            // the input connected
        interrupt_setup.int_port_characteristic = PULLUP_ON;             // enable pull-up resistor at input
        interrupt_setup.int_port_sense = IRQ_BOTH_EDGES;                 // interrupt on both edges
        fnConfigureInterrupt(&interrupt_setup);                          // configure test interrupt
    }
    if (RCGC2 & (0x1 << cts_port[channel])) {                            // only read when the port is powered
        LM3XXXXX_PORT_CONTROL *port = fnGetPortBlock(cts_port[channel]);
        if ((port != 0) && (!(port->GPIODATA & cts_port_bit[channel]))) {
            ControlLines |= SET_CTS;                                     // CTS line is active
        }
    }
    return ControlLines;
}
#endif
#endif                                                                   // end serial UART support


/* =================================================================== */
/*                           FLASH driver                              */
/* =================================================================== */

#if defined FLASH_FILE_SYSTEM
// Routine to command FLASH - we optionally put it in SRAM and run it with disabled interrupts (_RUN_FLASH_FROM_RAM)
//
static void fnCommandFlash(unsigned long ulCommand, unsigned long ptrAdd, unsigned long ulValue)
{
    FMD = ulValue;                                                       // data value
    FMA = ptrAdd;                                                        // address in flash
    FMC = (WRKEY | ulCommand);                                           // command
        #if defined _WINDOWS
    switch (FMC & 0x0000000f) {
    case FLASH_WRITE:
        if ((~(*(unsigned long *)FMA)) & ulValue) {
            *(unsigned char *)0 = 0;                                     // signal attempt to program bits from 0 to 1
        }
        *(unsigned long *)FMA = FMD;
        break;

    case FLASH_ERASE:
        fnDeleteFlashSector(fnGetFlashAdd((unsigned char *)ptrAdd));      // simulate deletion
        break;
    }
    FMC &= ~0x0000000f;
        #endif
    while (FMC & ulCommand) {}                                           // wait until the command has been executed (about 50us)
}

// Initialise flash and routines in RAM ready for later use
//
static void fnInitFlash(void)
{
    #ifdef _RUN_FLASH_FROM_RAM
    #define PROG_WORD_SIZE 100                                           // adequate space for the small program
    static unsigned short usProgSpace[PROG_WORD_SIZE];                   // make space for the routine on stack (this will have an even boundary)
    unsigned char *ptrThumb2 = (unsigned char *)fnCommandFlash;
    int i = 0;

    ptrThumb2--;                                                         // thumb 2 address
    while (i < PROG_WORD_SIZE) {                                         // copy program to SRAM
        usProgSpace[i++] = *(unsigned short *)ptrThumb2;
        ptrThumb2 += sizeof (unsigned short);
    }
    ptrThumb2 = (unsigned char *)usProgSpace;
    ptrThumb2++;                                                         // create a thumb 2 call
    fnRAM_code = (void(*)(unsigned long, unsigned long, unsigned long))(ptrThumb2);
    #endif

    USECRL = ((MASTER_CLOCK/1000000)-1);                                 // set FLASH programming usec value to suit system clock rate
}
#endif

#if !defined SPI_INTERFACE && (defined SPI_FILE_SYSTEM || defined SPI_SW_UPLOAD) // {26}
// Configure the SPI interface for file system use
//
static void fnConfigSPIFileSystem(unsigned char ucSpeed)
{
    _CONFIG_PERIPHERAL(A, SSI0, 1, (PORTA_BIT2 | PORTA_BIT4 | PORTA_BIT5), (PA2_SSI0Clk | PA4_SSI0Rx | PA5_SSI0Tx)); // use SSIRX,SSITX,SSICLK
             
    CONFIGURE_CS_LINES();                                                // configure chip select outputs
 
    SSICR1_0 = 0;                                                        // ensure disabled (master mode)
    SSICPSR_0 = 2;                                                       // set clock prescaler (even prescale 2..254)

