sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
    fnGetParsFile((unsigned char *)PARAMETER_BLOCK_1, (unsigned char *)ulValidUse, sizeof(ulValidUse)); // the first 2 long word locations define the validity of the block. 0x55555555 0x55555555 means it is fully valid. 0x55555555 0xffffffff means it contains temporary unvalidated data

    if (PRESENT_TEMP_BLOCK != ucValid) {
        ulCompare = 0x55555555;                                          // we are looking for validated pattern
    }
    else {
        ulCompare = 0xffffffff;                                          // we are looking for temporary pattern
    }

    if ((ulValidUse[0] == 0x55555555) && (ulValidUse[1] == ulCompare)) {
        return 1;                                                        // first block matched request
    }
    #ifdef USE_PAR_SWAP_BLOCK
    else {
        fnGetParsFile((unsigned char *)PARAMETER_BLOCK_2, (unsigned char *)ulValidUse, sizeof(ulValidUse));
        if ((ulValidUse[0] == 0x55555555) && (ulValidUse[1] == ulCompare)) {
            return 2;                                                    // second block matched request
        }
    }
    #endif
    return 0;                                                            // all other cases indicate the searched block doesn't exist
}
#else
// The LM3SXXXX has 1k byte blocks which can be individually modified so we use one or more of these, and a backup if desired
//
extern unsigned char fnGetValidPars(unsigned char ucValid)
{
    unsigned char ucValidUse[2];
    unsigned char ucCompare;

    // The first 2 byte locations define the validity of the block. 0x55 0x55 means it is fully valid. 0x55 0xff means it contains temporary unvalidated data
    fnGetParsFile(PARAMETER_BLOCK_1, ucValidUse, sizeof(ucValidUse));

    if (PRESENT_TEMP_BLOCK != ucValid) {
        ucCompare = 0x55;                                                // we are looking for validated pattern
    }
    else {
        ucCompare = 0xff;                                                // we are looking for temporary pattern
    }

    if ((ucValidUse[0] == 0x55) && (ucValidUse[1] == ucCompare)) {
        return 1;                                                        // first block matched request
    }
    #ifdef USE_PAR_SWAP_BLOCK
    else {
        fnGetParsFile(PARAMETER_BLOCK_2, (unsigned char*)ucValidUse, sizeof(ucValidUse));
        if ((ucValidUse[0] == 0x55) && (ucValidUse[1] == ucCompare)) {
            return 2;                                                    // second block matched request
        }
    }
    #endif

    return 0;                                                            // all other cases indicate the searched block doesn't exist
}
#endif

// Delete all sectors contained in a parameter block
//
static int fnDeleteParBlock(unsigned char *ptrAddInPar)
{
    return (fnEraseFlashSector(ptrAddInPar, PARAMETER_BLOCK_SIZE));
}

extern int fnGetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
#ifdef _TEMPEST_CLASS
    unsigned long *ptrPar = PARAMETER_BLOCK_1;
#else
    unsigned char *ptrPar = PARAMETER_BLOCK_1;
#endif

    #ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
    #endif

    ptrPar += (usParameterReference);
    ptrPar += 2;                                                         // first parameter starts after validation information

    while (usLength--) {
        fnGetParsFile((unsigned char *)ptrPar, ucValue++, 1);
        ptrPar++;
    }
    return 0;
}

// Write parameters to the defined block
//
#ifdef _TEMPEST_CLASS
extern int fnSetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned long *ptrPar = PARAMETER_BLOCK_1, *ptrStart;
    unsigned long ulValid = 0x55555555;
    int iBlockUse = 0;
    int iCommitNewStatus = 0;
    unsigned long ulValidCheck;
    unsigned long ulCheck;

    if (TEMP_PARS & ucValidBlock) {
        ucValidBlock &= ~TEMP_PARS;
        iBlockUse = 1;
    }

    if (ucValidBlock & BLOCK_INVALID) {                                  // no valid parameter blocks have been found so we can use the first for saving the data.
        fnDeleteParBlock((unsigned char *)PARAMETER_BLOCK_1);            // we delete it to be sure it is fresh
    #ifdef USE_PAR_SWAP_BLOCK
        fnDeleteParBlock((unsigned char *)PARAMETER_BLOCK_2);
    #endif
        ucValidBlock = 1;
    }

    #ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_SIZE/sizeof(unsigned long));
    }
    #endif
    ptrStart = ptrPar;
    ptrPar += (usParameterReference);
    ptrPar += 2;                                                         // first parameter starts after validation information

    if (!usLength) {                                                     // command rather than normal write
        if (iBlockUse) {                                                 // if we have a new set waiting, set it to use state
            iBlockUse = 0;
    #ifdef USE_PAR_SWAP_BLOCK
            if (ptrStart == PARAMETER_BLOCK_1) {
                ptrPar = PARAMETER_BLOCK_2;
            }
            else {
                ptrPar = PARAMETER_BLOCK_1;
            }
            fnDeleteParBlock((unsigned char *)ptrPar);
    #endif
        }
        else {                                                           // we must delete the block
            fnDeleteParBlock((unsigned char *)ptrStart);
            if (usParameterReference) {
                return 0;                                                // we don't validate it again
            }
        }
    }
    else {
        while (usLength--) {
#if defined _WINDOWS || defined _LITTLE_ENDIAN
            ulCheck = (0xffffff00 | *ucValue++);
#else
            ulCheck = (0x00ffffff | (*ucValue++ << 24));
#endif
            fnWriteBytesFlash((unsigned char *)ptrPar++, (unsigned char *)&ulCheck, sizeof(ulCheck)); // write each parameter to FLASH (each byte occupies a long word)
        }
        if (((CAST_POINTER_ARITHMETIC)ptrPar & (FLASH_ROW_SIZE-1)) != 0) {
            if (ptrPar > (ptrStart + (FLASH_ROW_SIZE/sizeof(unsigned long)))) {
                fnWriteBytesFlash(0, 0, 0);                              // commit any open FLASH row buffer
            }
        }
    }
    fnGetParsFile((unsigned char *)ptrStart, (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
    if (ulValidCheck != ulValid) {
        fnWriteBytesFlash((unsigned char *)ptrStart, (unsigned char *)&ulValid, sizeof(ulValid)); // validate data
        iCommitNewStatus = 1;
    }
    if (!iBlockUse) {
        fnGetParsFile((unsigned char *)(ptrStart + 1), (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
        if (ulValidCheck != ulValid) {
            fnWriteBytesFlash((unsigned char *)(ptrStart + 1), (unsigned char *)&ulValid, sizeof(ulValid)); // use data
            iCommitNewStatus = 1;
        }
    }
    if (iCommitNewStatus != 0) {
        fnWriteBytesFlash(0, 0, 0);                                      // commit the parameter block status
    }
    return 0;
}
#else
extern int fnSetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned char *ptrPar = PARAMETER_BLOCK_1, *ptrStart;
    unsigned char ucValid = 0x55;
    int iBlockUse = 0;

    if (TEMP_PARS & ucValidBlock) {
        ucValidBlock &= ~TEMP_PARS;
        iBlockUse = 1;
    }

    if (ucValidBlock & BLOCK_INVALID) {                                  // no valid parameter blocks have been found so we can use the first for saving the data.
        fnDeleteParBlock(PARAMETER_BLOCK_1);                             // we delete it to be sure it is fresh
    #ifdef USE_PAR_SWAP_BLOCK
        fnDeleteParBlock(PARAMETER_BLOCK_2);
    #endif
        ucValidBlock = 1;
    }

    #ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
    #endif
    ptrStart = ptrPar;
    ptrPar += (usParameterReference);
    ptrPar += 2;                                                         // first parameter starts after validation information

    if (!usLength) {                                                     // command rather than normal write
        if (iBlockUse) {                                                 // if we have a new set waiting, set it to use state
            iBlockUse = 0;
    #ifdef USE_PAR_SWAP_BLOCK
            if (ptrStart == PARAMETER_BLOCK_1) {
                ptrPar = PARAMETER_BLOCK_2;
            }
            else {
                ptrPar = PARAMETER_BLOCK_1;
            }
            fnDeleteParBlock(ptrPar);
    #endif
        }
        else {                                                           // we must delete the block
            fnDeleteParBlock(ptrStart);
            if (usParameterReference) return 0;                          // we don't validate it again
        }
    }
    else {
        fnWriteBytesFlash(ptrPar, ucValue, usLength);                    // the LM3SXXXX can do accumulative writes so we can simply call the normal write function
    }
                                                                         // now we must validate the parameter block which we have just written to
    fnWriteBytesFlash(ptrStart, &ucValid, sizeof(ucValid));              // validate data
    if (!iBlockUse) {
        fnWriteBytesFlash(ptrStart+sizeof(ucValid), &ucValid, sizeof(ucValid)); // use data
    }
    return 0;
}
#endif

#endif




#if defined I2C_INTERFACE
/* =================================================================== */
/*                            I2C Interface                            */
/* =================================================================== */

// Collect a pointer to defined I2C control block
//
static LM3XXXXX_I2C_CONTROL *fnSelectI2CChannel(QUEUE_HANDLE Channel)
{
    #if CHIP_HAS_I2C > 1
    switch (Channel) {
    case 0:
        return (LM3XXXXX_I2C_CONTROL *)I2C0_BLOCK;
    case 1:
        return (LM3XXXXX_I2C_CONTROL *)I2C1_BLOCK;
    }
    return 0;                                                            // invalid
    #else
    return (LM3XXXXX_I2C_CONTROL *)I2C0_BLOCK;
    #endif
}

static void fnI2CInt(QUEUE_HANDLE Channel, LM3XXXXX_I2C_CONTROL *iic, I2CQue *ptI2CQue)
{
    if (ptI2CQue->ucState & RX_ACTIVE) {                                 // receiving
        *I2C_rx_control[Channel]->I2C_queue.put++ = (unsigned char)iic->I2CMDR; // {12} read the received byte (not dependent on ptI2CQue->ucPresentLen)
        I2C_rx_control[Channel]->I2C_queue.chars++;                      // and put it into the rx buffer
        if (I2C_rx_control[Channel]->I2C_queue.put >= I2C_rx_control[Channel]->I2C_queue.buffer_end) {
            I2C_rx_control[Channel]->I2C_queue.put = I2C_rx_control[Channel]->I2C_queue.QUEbuffer;
        }
    #if defined _WINDOWS
        if (ptI2CQue->ucPresentLen != 0) {
            iic->I2CMDR = fnSimI2C_devices(Channel, I2C_RX_DATA, 0);     // {38} simulate the interrupt directly
        }
        iic->I2CMCS =(I2C_DATACK);                                       // simulate the interrupt directly
        iic->I2CMMIS = iic->I2CMRIS = I2C_INTERRUPT_BIT;                 // simulate the interrupt mask setting
        iInts |= (I2C_INT0 << Channel);
    #endif

