sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
        if (ptI2CQue->ucPresentLen) {                                    // more to be received
            ptI2CQue->ucPresentLen--;
            if (ptI2CQue->ucPresentLen == 0) {                           // last read
                iic->I2CMCS = (I2C_RUN | I2C_STOP);                      // start transfer of last byte with no ack, followed by a stop condition
            }
            else {
                iic->I2CMCS = (I2C_RUN | I2C_DATACK);                    // start transfer of further acked byte
            }
        }
        else {
            I2C_rx_control[Channel]->msgs++;                             // a reception message ready
            if (I2C_rx_control[Channel]->wake_task) {                    // if a task is defined to receive this reception transfer
                uDisable_Interrupt();                                    // ensure interrupts remain blocked during subroutines
                uTaskerStateChange(I2C_rx_control[Channel]->wake_task, UTASKER_ACTIVATE);// wake up owner task since a reception message is ready
                uEnable_Interrupt();                                     // release
            }
            if (!(ptI2CQue->I2C_queue.chars)) {                          // all transmission complete
                iic->I2CMIMR = 0;                                        // disable further interrupts
                ptI2CQue->ucState = 0;
            }
            else {
                fnTxI2C(ptI2CQue, Channel);                              // we have another message to send so we can send a repeated start condition
            }
        }
        return;
    }

    if (ptI2CQue->ucPresentLen) {                                        // send next byte if available
        ptI2CQue->ucPresentLen--;
        iic->I2CMDR = *ptI2CQue->I2C_queue.get++;                        // prepare next byte
        if (ptI2CQue->ucPresentLen == 0) {                               // last byte
            iic->I2CMCS = (I2C_RUN | I2C_STOP);                          // send byte followed by stop condition
        }
        else {
            iic->I2CMCS = (I2C_RUN);                                     // send byte without start/stop
        }
        if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
            ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;     // handle the ring buffer
        }
    #ifdef _WINDOWS
        iic->I2CMCS =(I2C_DATACK);                                       // simulate the interrupt directly
        iic->I2CMMIS = iic->I2CMRIS = I2C_INTERRUPT_BIT;                 // simulate the interrupt mask setting
        fnSimI2C_devices(Channel, I2C_TX_DATA, (unsigned char)iic->I2CMDR); // {38}
        iInts |= (I2C_INT0 << Channel);
    #endif
    }
    else {
        if (0 == ptI2CQue->I2C_queue.chars) {                            // all transmission complete
            iic->I2CMIMR = 0;                                            // disable further interrupts
            ptI2CQue->ucState = 0;
            if (ptI2CQue->wake_task ) {
                uDisable_Interrupt();                                    // ensure interrupts remain blocked during subroutines
                uTaskerStateChange(ptI2CQue->wake_task, UTASKER_ACTIVATE);// wake up owner task since all transmission has terminated
                uEnable_Interrupt();                                     // release
            }
        }
        else {
            fnTxI2C(ptI2CQue, Channel);                                  // we have another message to send so we can send a repeated start condition
        }
    }
}

static __interrupt void I2C_Interrupt_0(void)
{
    I2CMICR_0 = I2C_INTERRUPT_BIT;                                       // clear pending interrupt
    #ifdef _WINDOWS
    I2CMMIS_0 = I2CMRIS_0 = 0;
    #endif
    fnI2CInt(0, (LM3XXXXX_I2C_CONTROL *)I2C0_BLOCK, I2C_tx_control[0]);
}

    #if CHIP_HAS_I2C > 1
static __interrupt void I2C_Interrupt_1(void)
{
    I2CMICR_1 = I2C_INTERRUPT_BIT;                                       // clear pending interrupt
        #ifdef _WINDOWS
    I2CMMIS_1 = I2CMRIS_1 = 0;
        #endif
    fnI2CInt(1, (LM3XXXXX_I2C_CONTROL *)I2C1_BLOCK, I2C_tx_control[1]);
}
    #endif

// Configure the I2C hardware
//
void fnConfigI2C(I2CTABLE *pars)
{
    LM3XXXXX_I2C_CONTROL *iic = fnSelectI2CChannel(pars->Channel);
    #if CHIP_HAS_I2C > 1
    if (pars->Channel == 0)
    #endif
    {
        _CONFIG_PERIPHERAL(B, I2C0, 1, (PORTB_BIT2 | PORTB_BIT3), (PB2_I2C0SCL | PB3_I2C0SDA));

        GPIOODR_B |= (PORTB_BIT2 | PORTB_BIT3);                          // select open drain function
        I2CMICR_0 = I2C_INTERRUPT_BIT;                                   // clear pending interrupts
        fnEnterInterrupt(irq_I2C0_ID, PRIORITY_I2C0, I2C_Interrupt_0);
    }
    #if CHIP_HAS_I2C > 1
    else {
        _CONFIG_PERIPHERAL(A, I2C1, 1, (PORTA_BIT6 | PORTA_BIT7), (PA6_I2C1SCL | PA7_I2C1SDA));

        GPIOODR_A |= (PORTA_BIT6 | PORTA_BIT7);                          // select open drain function
        I2CMICR_1 = I2C_INTERRUPT_BIT;                                   // clear pending interrupts
        fnEnterInterrupt(irq_I2C1_ID, PRIORITY_I2C1, I2C_Interrupt_1);
    }
    #endif

    iic->I2CMCR = I2C_MFE;                                               // enable master mode of operation
    switch (pars->usSpeed) {
    case 400:                                                            // high speed I2C
        iic->I2CMTPR = ((MASTER_CLOCK / (2 * (SCL_LP + SCL_HP) * 400000)) - 1);
        break;
    case 100:
    default:                                                             // default to 100kHz
        iic->I2CMTPR = ((MASTER_CLOCK / (2 * (SCL_LP + SCL_HP) * 100000)) - 1);
        break;
    case 50:
        iic->I2CMTPR = ((MASTER_CLOCK / (2 * (SCL_LP + SCL_HP) * 50000)) - 1);
        break;
    }
    #if defined _WINDOWS
    fnConfigSimI2C(pars->Channel, (pars->usSpeed * 1000));
    #endif
}

// Send a first byte to I2C bus
//
extern void fnTxI2C(I2CQue *ptI2CQue, QUEUE_HANDLE Channel)
{
    LM3XXXXX_I2C_CONTROL *iic = fnSelectI2CChannel(Channel);

    ptI2CQue->ucPresentLen = *ptI2CQue->I2C_queue.get++;                 // get present length
    if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
        ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;         // handle circular buffer
    }
    iic->I2CMSA = *ptI2CQue->I2C_queue.get++;                            // the slave address
    if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
        ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;         // handle circular buffer
    }
    if (iic->I2CMSA & 0x01) {                                            // reading
        if (--ptI2CQue->ucPresentLen == 0) {                             // {12}
            iic->I2CMCS = (I2C_RUN | I2C_START | I2C_STOP);              // start transfer of single byte followed by a stop condition
        }
        else {
            iic->I2CMCS = (I2C_RUN | I2C_START | I2C_DATACK);            // start transfer of first of multiple bytes with acks
        }
        iic->I2CMIMR = I2C_INTERRUPT_BIT;                                // {12} enable interrupt on completion
    #if defined _WINDOWS
        fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)iic->I2CMSA); // {38}
    #endif
        ptI2CQue->ucState = (RX_ACTIVE | TX_ACTIVE);                     // flag active receiving
        ptI2CQue->I2C_queue.chars -= 3;
        I2C_rx_control[Channel]->wake_task = *ptI2CQue->I2C_queue.get++; // enter task to be woken when reception has completed
        if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
            ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;     // handle circular buffer
        }
    #if defined _WINDOWS
        iic->I2CMCS =(I2C_ADRACK | I2C_DATACK);                          // simulate the interrupt directly
        iic->I2CMDR = fnSimI2C_devices(Channel, I2C_RX_DATA, 0);         // {38}
        iInts |= (I2C_INT0 << Channel);
    #endif
    }
    else {                                                               // writing
        iic->I2CMDR = *ptI2CQue->I2C_queue.get++;                        // send first data byte
        if (ptI2CQue->ucPresentLen == 1) {
            iic->I2CMCS = (I2C_RUN | I2C_START | I2C_STOP);              // start transfer of single byte followed by a stop condition
        }
        else {
            iic->I2CMCS = (I2C_RUN | I2C_START);                         // start transfer of first of multiple bytes
        }
        iic->I2CMIMR = I2C_INTERRUPT_BIT;                                // enable interrupt on completion
    #ifdef _WINDOWS
        iic->I2CMMIS = iic->I2CMRIS = I2C_INTERRUPT_BIT;                 // simulate the interrupt mask setting
        fnSimI2C_devices(Channel, I2C_ADDRESS, (unsigned char)iic->I2CMSA); // {38}
    #endif
        if (ptI2CQue->I2C_queue.get >= ptI2CQue->I2C_queue.buffer_end) {
            ptI2CQue->I2C_queue.get = ptI2CQue->I2C_queue.QUEbuffer;     // handle circular buffer
        }
        ptI2CQue->ucState = (TX_ACTIVE);                                 // flag active transmitting
        ptI2CQue->I2C_queue.chars -= (ptI2CQue->ucPresentLen+1);
        ptI2CQue->ucPresentLen--;
    #ifdef _WINDOWS
        iic->I2CMCS =(I2C_ADRACK | I2C_DATACK);                          // simulate the interrupt directly
        fnSimI2C_devices(Channel, I2C_TX_DATA, (unsigned char)iic->I2CMDR); // {38}
        iInts |= (I2C_INT0 << Channel);
    #endif
    }
}
#endif


#if defined USB_INTERFACE

// This routine is called from the USB driver with interrupts blocked for deferred read of a reception buffer
//
extern int fnConsumeUSB_out(unsigned char ucEndpointRef)
{
    return USB_BUFFER_NO_DATA;                                           // report no more data so that the driver doesn't call again. The interrupt routine will handle all waiting buffers itself.
}

// This routine handles all SETUP and OUT frames. It can send an empty data frame if required by control endpoints or stall on errors.
// It usually clears the handled input buffer when complete, unless the buffer is specified to remain owned by the processor.
//
static int fnProcessInput(int iEndpoint_ref, USB_HW *ptrUSB_HW, unsigned char ucFrameType)
{
    uDisable_Interrupt();                                                // ensure interrupts remain blocked when putting messages to queue
    switch (fnUSB_handle_frame(ucFrameType, (unsigned char *)ptrUSB_HW->ptrFIFO, iEndpoint_ref, ptrUSB_HW)) { // generic handler routine
    case TERMINATE_ZERO_DATA:                                            // send zero data packet to complete status stage of control transfer
      //CLEAR_RXRDY();
        FNSEND_ZERO_DATA(ptrUSB_HW, iEndpoint_ref);
        if (iEndpoint_ref == 0) {
            ptrUSB_HW->usEP0State = USB_STATE_ADDRESSING;                // expect ACK
        }
        break;
    case BUFFER_CONSUMED_EXPECT_MORE:                                    // control endpoint expects extra OUT frames (only on endpoint 0)
        PARTIAL_CLEAR_RXRDY();
        ptrUSB_HW->usEP0State = USB_STATE_OUT;
        break;
    case MAINTAIN_OWNERSHIP:                                             // don't free the buffer - the application will do this later
        uEnable_Interrupt();                                             // release
        return MAINTAIN_OWNERSHIP;
    case STALL_ENDPOINT:                                                 // send stall (only on endpoint 0)
      //CLEAR_RXRDY();
        USBCSRL0 = EP0_STALL;                                               
        ptrUSB_HW->usEP0State = USB_STATE_STALL;
        fnSetUSBEndpointState(iEndpoint_ref, USB_ENDPOINT_STALLED, 0);
        _SIM_USB(0, USB_SIM_STALL, iEndpoint_ref, ptrUSB_HW);
        break;
    default:
      //CLEAR_RXRDY();
        break;
    }
    uEnable_Interrupt();                                                 // release
    return 0;
}

// Copy the data to be transmitted to the FIFO. This may only be called when there is a buffer to accept the data.
//
extern void fnSendUSB_FIFO(unsigned char *ptrData, unsigned short usLength, int iEndpoint, USB_HW *ptrUSB_HW)
{
    unsigned short usPacketLength = usLength;
#ifdef _WINDOWS    
    volatile unsigned char *ptrFIFO_buffer = (unsigned char *)ptrUSB_HW->ptrFIFO;
#endif
    if ((iEndpoint == 0) && (USBCSRL0 & EP0_DEVICE_RXRDY)) {
        CLEAR_RXRDY();
    }
#ifdef _WINDOWS
    fnPutUSB_FIFOLength(iEndpoint, usLength);
    while (usLength--) {
        *ptrFIFO_buffer++ = *ptrData++;                                  // write each byte to the tx FIFO
    }
#else
    while (usLength--) {
        *ptrUSB_HW->ptrFIFO = *ptrData++;                                // write each byte to the tx FIFO
    }
#endif
    if (iEndpoint == 0) {
        if (usPacketLength == ENDPOINT_0_SIZE) {                         // this is not the last packet
            USBCSRL0 = EP0_DEVICE_TXRDY;
            usb_hardware.usEP0State = USB_STATE_TX;                      // sending multiple packets
        }
        else {
            USBCSRL0 = (EP0_DEVICE_TXRDY | EP0_DATAEND);                 // this is the last packet
            usb_hardware.usEP0State = USB_STATE_LAST_TX;                 // sending last packet
        }
    }
    else {
        if (usPacketLength == ptrUSB_HW->ptrEndpoint->usEndpointSize) {  // this is not the last packet
            *ptrUSB_HW->ptr_ucUSB_BDControl = DEVICE_TXRDY;              // sending multiple packets
        }
        else {
            *ptrUSB_HW->ptr_ucUSB_BDControl = DEVICE_TXRDY;              // this is the last packet
        }
    }

#ifdef _WINDOWS
    fnFIFO_buffer_out(iEndpoint);                                        // simulate double buffer operation
#endif
}

