sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
/****************************** INT TEST BUFFER ********************/
int iTest = 0;
unsigned char ucInts[1000];

#define DEBUG_USB_INT(x)   ucInts[iTest++] = x
#define DEBUG_USB_HW(x)    ucInts[iTest++] = x
#define DEBUG_USB_EP0(x)   ucInts[iTest++] = x
#define DEBUG_USB_EP123(x) ucInts[iTest++] = x
/*******************************************************************/


// USB OTG Interrupt handler
//
static __interrupt void usb_otg_isr(void)
{
    unsigned short usUSB_Int_status; 
DEBUG_USB_INT('I');
    while (1) {
        if ((usUSB_Int_status = (unsigned char)(USBIS & USBIE)) != 0) {  // read present status (clearing interrupt flags)
    #ifdef _WINDOWS
            USBIS = 0;
    #endif
DEBUG_USB_HW('H');
            if (usUSB_Int_status & RESET_INT) {                          // reset detected - D+ and D- in SE0 (single ended logic 0) state for > 2.5us
                usFIF0address = 64;                                      // only endpoint 0 fifo exists after a reset
                USBIE = (RESET_INT);                                     // disable resume and suspend interrupts
                uDisable_Interrupt();                                    // ensure message can not be interrupted
                fnUSB_handle_frame(USB_RESET_DETECTED, 0, 0, &usb_hardware);// generic handler routine
                uEnable_Interrupt();                                     // release
                usb_hardware.ucUSBAddress = 0;                           // reset the address to revert back to the default state
                usb_hardware.usEP0State = 0;
DEBUG_USB_HW('R');
            }
            if (usUSB_Int_status & SUSPEND_INT) {                        // supend state detected - 3ms of idle USB bus detected (low speed D+ = 0, D- = 1 / high speed D+ = 1, D- = 0)
                USBIE = (RESET_INT | RESUME_INT);                        // disable suspend and enable resume interrupt
                uDisable_Interrupt();                                    // ensure message can not be interrupted
                fnUSB_handle_frame(USB_SUSPEND_DETECTED, 0, 0, 0);       // generic handler routine
                uEnable_Interrupt();                                     // release
DEBUG_USB_HW('S');
            }
            if (usUSB_Int_status & RESUME_INT) {                         // resume detected - 10ms inverted idle USB bus state (low speed D+ = 1, D- = 0 / high speed D+ = 0, D- = 1)
                USBIE = (RESET_INT | SUSPEND_INT);                       // disable resume and enable suspend interrupt
                uDisable_Interrupt();                                    // ensure message can not be interrupted
                fnUSB_handle_frame(USB_RESUME_DETECTED, 0, 0, 0);        // generic handler routine
                uEnable_Interrupt();                                     // release
DEBUG_USB_HW('r');
            }
        }
        else if (((usUSB_Int_status = USBTXIS) & USBTXIE) != 0) {        // transmit (or endpoint 0 rx) interrupt(s) [read clears flags]
    #ifdef _WINDOWS
            USBTXIS = 0;
    #endif
            if (usUSB_Int_status & EP0_TX_RX_INT) {                      // handle endpoint 0
DEBUG_USB_EP0('0');
DEBUG_USB_EP0((unsigned char)(usUSB_Int_status >> 8));
DEBUG_USB_EP0((unsigned char)(usUSB_Int_status));
DEBUG_USB_EP0(USBCSRL0);
DEBUG_USB_EP0(usb_hardware.usEP0State);
                if (usb_hardware.usEP0State & (USB_STATE_TX | USB_STATE_LAST_TX)) {
                    if (USBCSRL0 & EP0_SETEND) {                         // host has prematurely terminated a transfer
                        USBCSRL0 = EP0_SETENDC;                          // reset the flag
    #ifdef _WINDOWS
                        USBCSRL0 = 0;
    #endif
                        usb_hardware.usEP0State = USB_STATE_IDLE;
DEBUG_USB_EP0('X');
                        continue;
                    }
                }
                switch (usb_hardware.usEP0State) {
                case USB_STATE_IDLE:                                     // endpoint 0 is idle and waiting for a SETUP token
                case USB_STATE_OUT:
                    if (USBCSRL0 & EP0_DEVICE_RXRDY) {
DEBUG_USB_EP0('C');
                        if ((usb_hardware.usLength = USBCOUNT0) != 0) {
DEBUG_USB_EP0((unsigned char)(usb_hardware.usLength + '0'));
                            usb_hardware.ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO0_ADD, 0);
                            usb_hardware.ptr_ucUSB_BDControl = USBTXCTRADD0;
                            usb_hardware.ptrEndpoint = &usb_endpoints[0];
                            if (usb_hardware.usEP0State == USB_STATE_OUT) { // expecting further data
                                fnProcessInput(0, &usb_hardware, USB_CONTROL_OUT_FRAME);
                            }
                            else {
                                fnProcessInput(0, &usb_hardware, USB_SETUP_FRAME);
                            }
                        }
                        else {
DEBUG_USB_EP0('0');
                        }
                    }
                    break;
                case USB_STATE_TX:                                       // endpoint 0 is sending multiple packets. Interrupts are interpreted as ACKs
DEBUG_USB_EP0('A');
                    usb_hardware.ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO0_ADD, 0);
                    usb_hardware.ptr_ucUSB_BDControl = USBTXCTRADD0;
                    usb_hardware.ptrEndpoint = &usb_endpoints[0];
                    uDisable_Interrupt();                                // ensure message can not be interrupted
                    fnUSB_handle_frame(USB_TX_ACKED, 0, 0, &usb_hardware);// handle ack event
                    uEnable_Interrupt();                                 // release
                    break;
                case USB_STATE_RX:                                       // endpoint 0 has received a SETUP token and is now expecting fouther OUT data
DEBUG_USB_EP0('R');
                    usb_hardware.usLength = USBCOUNT0;
DEBUG_USB_EP0((unsigned char)(usb_hardware.usLength));
                    fnProcessInput(0, &usb_hardware, USB_CONTROL_OUT_FRAME); // control endpoint
                    break;
                case USB_STATE_LAST_TX:
DEBUG_USB_EP0('T');
                    usb_hardware.usEP0State = USB_STATE_STATUS;
                    break;
                case USB_STATE_STATUS:                                   // endpoint 0 is sending a single packet or the last of multiple packtets and expecting the status stage reception
DEBUG_USB_EP0('S');
                    if ((usb_hardware.usLength = USBCOUNT0) == 0) {
DEBUG_USB_EP0((unsigned char)(usb_hardware.usLength));
                        fnProcessInput(0, &usb_hardware, USB_CONTROL_OUT_FRAME); // control endpoint
                        usb_hardware.usEP0State = USB_STATE_IDLE;
                    }
                    break;
                case USB_STATE_ADDRESSING:
DEBUG_USB_EP0('a');
                    USBFADDR = usb_hardware.ucUSBAddress;                // program the address to be used
                    // fall through
                case USB_STATE_STALL:                                    // endpoint 0 has sent a stall and the status handshake is expected
                    usb_hardware.usEP0State = USB_STATE_IDLE;
                    break;
                }
            }
            if (usUSB_Int_status & (EP1_TX_INT | EP2_TX_INT | EP3_TX_INT)) { // handle tx interrupt(s) on endpoint(s) 1..3
DEBUG_USB_EP123('t');
                if (usUSB_Int_status & EP1_TX_INT) {
DEBUG_USB_EP123('1');
                }
                if (usUSB_Int_status & EP2_TX_INT) {
DEBUG_USB_EP123('2');
DEBUG_USB_EP123(USBTXCSRL2);
                    usb_hardware.ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO2_ADD, 1);
                    usb_hardware.ptr_ucUSB_BDControl = USBTXCTRADD2;
                    usb_hardware.ptrEndpoint = &usb_endpoints[2];
                    uDisable_Interrupt();                                // ensure message can not be interrupted
                    fnUSB_handle_frame(USB_TX_ACKED, 0, 2, &usb_hardware);// handle ack event
                    uEnable_Interrupt();                                 // release
                }
                if (usUSB_Int_status & EP3_TX_INT) {
DEBUG_USB_EP123('3');
                }
            }
        }
        else if (((usUSB_Int_status = USBRXIS) & USBRXIE) != 0) {        // rx interrupt(s) on endpoint(s) 1..3
    #ifdef _WINDOWS
            USBRXIS = 0;                                                 // read of USBRXRIS resets all interrupt flags
    #endif
DEBUG_USB_EP123('r');
            if (usUSB_Int_status & EP1_RX_INT) {
DEBUG_USB_EP123('1');
DEBUG_USB_EP123(USBRXCSRL1);
                if (USBRXCSRL1 & DEVICE_RXRDY) {                         // packet received
                    usb_hardware.ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO1_ADD, 0);
                    usb_hardware.ptr_ucUSB_BDControl = USBRXCTRADD1;
                    usb_hardware.ptrEndpoint = &usb_endpoints[1];
                    usb_hardware.usLength = USBRXCOUNT1;
DEBUG_USB_EP123((unsigned char)usb_hardware.usLength);
                    if (fnProcessInput(1, &usb_hardware, USB_OUT_FRAME) != MAINTAIN_OWNERSHIP) {
                        USBRXCSRL1 = 0;                                  // reset DEVICE_RXRDY flag
                    }
                }
            }
            if (usUSB_Int_status & EP2_RX_INT) {
DEBUG_USB_EP123('2');
/*                if (USBRXCSRL2 & DEVICE_RXRDY) { // packet received
                    usb_hardware.ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO2_ADD, 0);
                    usb_hardware.ptr_ucUSB_BDControl = USBRXCTRADD2;
                    usb_hardware.ptrEndpoint = &usb_endpoints[2];
                    usb_hardware.usLength = USBRXCOUNT2;
                    fnProcessInput(2, &usb_hardware, USB_OUT_FRAME);
                    USBRXCSRL2 = 0;                                      // reset DEVICE_RXRDY flag
                }*/
            }
            if (usUSB_Int_status & EP3_RX_INT) {
DEBUG_USB_EP123('3');
/*                if (USBRXCSRL3 & DEVICE_RXRDY) { // packet received
                    usb_hardware.ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO3_ADD, 0);
                    usb_hardware.ptr_ucUSB_BDControl = USBRXCTRADD3;
                    usb_hardware.ptrEndpoint = &usb_endpoints[3];
                    usb_hardware.usLength = USBRXCOUNT3;
                    fnProcessInput(3, &usb_hardware, USB_OUT_FRAME);
                    USBRXCSRL3 = 0;                                      // reset DEVICE_RXRDY flag
                }*/
            }
        }
        else {
            break;
        }
    }
DEBUG_USB_INT(' ');
    if (iTest > 950) {                                                   // ensure no overrun in debug buffer
        iTest = 0;
    }
}

// USB Configuration
//
extern void fnConfigUSB(QUEUE_HANDLE Channel, USBTABLE *pars)
{
    volatile unsigned long ulDummy;
    RCGC2 |= CGC_USB0;                                                   // enable clocks to USB
    SRCR2 &= ~CGC_USB0;                                                  // ensure not held in reset
    RCC2 &= ~USBPWRDWN;                                                  // enable USB PLL

