sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
#if defined USB_BUS_SWITCH
    #if defined _LM3S3748 || defined _LM3S3768
    RCGC2 |= CGC_GPIOH;                                                  // port H must be enabled to use USB control lines on it
    SRCR2 &= ~CGC_GPIOH;
    GPIOAFSEL_H |= (PORTH_BIT3 | PORTH_BIT4);                            // connect USB0EPEN and USB0PFLT pins
    GPIODEN_H |= (PORTH_BIT3 | PORTH_BIT4);
    GPIOPUR_H |= (PORTH_BIT4);                                           // enable pullup on input
    #elif defined _LM3S5732
    RCGC2 |= CGC_GPIOC;                                                  // port C must be enabled to use USB control lines on it
    SRCR2 &= ~CGC_GPIOC;
    GPIOAFSEL_C |= (PORTC_BIT5 | PORTC_BIT6);                            // connect USB0EPEN and USB0PFLT pins
    GPIODEN_C |= (PORTC_BIT5 | PORTC_BIT6);
    GPIOPUR_C |= (PORTH_BIT6);                                           // enable pullup on input
    #endif
#endif

    if (++pars->ucEndPoints > NUMBER_OF_USB_ENDPOINTS) {                 // add endpoint 0
        pars->ucEndPoints = NUMBER_OF_USB_ENDPOINTS;                     // limit to maximum available in device
    }

    usb_endpoints = uMalloc((MAX_MALLOC)(sizeof(USB_END_POINT) * pars->ucEndPoints)); // get zeroed endpoint control structures

    usb_endpoints[0].usEndpointSize = ENDPOINT_0_SIZE;                   // endpoint size on control endpoint 0

    USBTXIE = EP0_TX_RX_INT;                                             // enable tx/rx interrupts on endpoint 0
    ulDummy = USBIS;                                                     // clear possible interrupts
    ulDummy = USBTXIS;                                                   // clear possible tx interrupts
    ulDummy = USBRXIS;                                                   // clear possible rx interrupts
    fnEnterInterrupt(irq_USB_ID, PRIORITY_USB_OTG, usb_otg_isr);         // enter the interrupt handler
    USBIE = (RESET_INT);                                                 // enable reset interrupt

    while (!(RIS & USBPLLLRIS)) {                                        // wait for USBPLL to lock
#ifdef _WINDOWS
        RIS |= USBPLLLRIS;
#endif
    }

    if ((pars->usConfig & USB_HOST_MODE) == 0) {
#ifdef EK_LM3S3748                                                       // set HOST/DEVICE muliplexer accoringly
        GPIODIR_H  |= (PORTH_BIT2);
        GPIODATA_H |= (PORTH_BIT2);                                      // drive '1' for device (see also errata 10.3 for A0 device)
        GPIODEN_H  |= (PORTH_BIT2);
        USBGPCS = DEVMOD;                                                // force device mode
#endif
        USBPOWER = SOFTCONN;                                             // connect USB D+/D- lines. The device will now only respond to a USB reset.
    }
#ifdef EK_LM3S3748                                                       // set HOST/DEVICE muliplexor accoringly
    else {
        GPIODIR_H  |= (PORTH_BIT2);
        GPIODATA_H &= ~(PORTH_BIT2);                                     // driver '0' for host
        GPIODEN_H  |= (PORTH_BIT2);
        USBGPCS = 0;                                                     // force host mode
    }
#endif
}

// Set the transmit control and buffer to next active one and check whether it is free
//
extern int fnGetUSB_HW(int iEndpoint, USB_HW *ptr_usb_hardware)
{
    switch (iEndpoint) {
    case 0:
        if (USBCSRL0 & EP0_DEVICE_TXRDY) {
            return ENDPOINT_NOT_FREE;
        }
        ptr_usb_hardware->ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO0_ADD, 1);
        break;
    case 1:
        if (USBTXCSRL1 & DEVICE_TXRDY) {
            return ENDPOINT_NOT_FREE;
        }
        ptr_usb_hardware->ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO1_ADD, 1);
        ptr_usb_hardware->ptrEndpoint = &usb_endpoints[1];
        ptr_usb_hardware->ptr_ucUSB_BDControl = USBTXCTRADD1;

        break;
    case 2:
        if (USBTXCSRL2 & DEVICE_TXRDY) {
            return ENDPOINT_NOT_FREE;
        }
        ptr_usb_hardware->ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO2_ADD, 1);
        ptr_usb_hardware->ptrEndpoint = &usb_endpoints[2];
        ptr_usb_hardware->ptr_ucUSB_BDControl = USBTXCTRADD2;
        break;
    case 3:
        if (USBTXCSRL3 & DEVICE_TXRDY) {
            return ENDPOINT_NOT_FREE;
        }
        ptr_usb_hardware->ptrFIFO = (unsigned char *)fnGetUSB_FIFOAdd(USBFIFO3_ADD, 1);
        ptr_usb_hardware->ptrEndpoint = &usb_endpoints[3];
        ptr_usb_hardware->ptr_ucUSB_BDControl = USBTXCTRADD3;
        break;
    }
    return ENDPOINT_FREE;
}

// The hardware interface used to activate USB endpoints
//
extern void fnActivateHWEndpoint(unsigned char ucEndpointType, unsigned char ucEndpointRef, unsigned short usEndpointLength, unsigned short usMaxEndpointLength)
{
  //#define DOUBLE_BUFFERED
    USB_END_POINT *endpoint = (usb_endpoints + ucEndpointRef);
    unsigned char ucSize = 8;
    unsigned char ucMode = 0;
    unsigned char ucEndpointBit = (0x01 << ucEndpointRef);
    int iRegisterOffset;

    if (ENDPOINT_DISABLE == ucEndpointType) {
        USBIE = (RESET_INT);                                             // disable suspend and resume interrupts when not configured
        USBTXIE &= ~ucEndpointBit;                                       // disable tx interrupts on the endpoint
        USBRXIE &= ~ucEndpointBit;                                       // disable rx interrupts on the endpoint
        return;
    }
    USBIE = (RESET_INT | SUSPEND_INT);                                   // since we have just been configured, enable suspend interrupt
    USBEPIDX = ucEndpointRef;                                            // set configuration index
    ucEndpointRef--;                                                     // for subsequent address offset use
    iRegisterOffset = ((USBTXMAXP2ADD - USBTXMAXP1ADD) * ucEndpointRef);
#ifdef _WINDOWS
    fnGetUSB_FIFO_config();                                              // get the present FIFO configuration from the simulator
#endif
    endpoint->usEndpointSize = usEndpointLength;                         // enter the endpoint length for later reference
    while (usEndpointLength < 2048) {                                    // calculate the size setting
        usEndpointLength *= 2;
        ucSize--;
    }
    switch (ucEndpointType & ~IN_ENDPOINT) {
    case ENDPOINT_ISOCHRONOUS:
        ucMode = USB_ISO;
        break;
    case ENDPOINT_BULK:
    case ENDPOINT_INTERRUPT:
        if (!(ucEndpointType & IN_ENDPOINT)) {
            ucMode = DISNYET_PIDERR;
        }
        break;
    default:                                                             // control endpoint
        break;
    }
    if (ucEndpointType & IN_ENDPOINT) {
#ifdef DOUBLE_BUFFERED
        USBTXFIFOSZ = (ucSize | FIFO_DOUBLE_BUFFERED);                   // set the size of the transmission buffers in the FIFO
        USBTXDPKTBUFDIS &= ~ucEndpointBit;                               // ensure that double buffering is not disabled on this endpoint
#else
        USBTXFIFOSZ = ucSize;                                            // set the size of the transmission buffers in the FIFO
        USBTXDPKTBUFDIS |= ucEndpointBit;                                // ensure that double buffering is disabled on this endpoint
#endif
        USBTXFIFOADD = (usFIF0address/8);                                // set the starting address of the first transmission FIFO
        *(USBTXMAXP1ADD + (iRegisterOffset/sizeof(unsigned short))) = endpoint->usEndpointSize;
        *(USBRXCSRH1ADD + iRegisterOffset) = 0;
#ifdef USB_DMA_MODE
        *(USBTXCSRH1ADD + iRegisterOffset) = (ucMode | (USB_DMA | USB_TX));
#else
        *(USBTXCSRH1ADD + iRegisterOffset) = (ucMode | USB_TX);
#endif
        USBTXIE |= ucEndpointBit;                                        // enable tx interrupts on the endpoint
    }
    else {
#ifdef DOUBLE_BUFFERED
        USBRXFIFOSZ = (ucSize | FIFO_DOUBLE_BUFFERED);                   // set the size of the reception buffers in the FIFO
        USBRXDPKTBUFDIS &= ~ucEndpointBit;                               // ensure that double buffering is not disabled on this endpoint
#else
        USBRXFIFOSZ = ucSize;                                            // set the size of the reception buffers in the FIFO
        USBRXDPKTBUFDIS |= ucEndpointBit;                                // ensure that double buffering is disabled on this endpoint
#endif
        USBRXFIFOADD = (usFIF0address/8);                                // set the starting address of the first reception FIFO
        *(USBRXMAXP1ADD + (iRegisterOffset/sizeof(unsigned short))) = endpoint->usEndpointSize;
        *(USBTXCSRH1ADD + iRegisterOffset) = 0;
#ifdef USB_DMA_MODE
        *(USBRXCSRH1ADD + iRegisterOffset) = (ucMode | USB_DMA_RX_EN);
#else
        *(USBRXCSRH1ADD + iRegisterOffset) = ucMode;
#endif
        USBRXIE |= ucEndpointBit;                                        // enable rx interrupts on the endpoint
    }

#ifdef _WINDOWS
    fnPutUSB_FIFO_config();                                              // log the FIFO configuration in the simulator
#endif
#ifdef DOUBLE_BUFFERED
    usFIF0address += (endpoint->usEndpointSize * 2);                     // two buffers have been added to the FIFO with the endpoint buffer size
    endpoint->ucEndpointRxFlags = ENDPOINT_DUAL_BANK;                    // flag that dual bank is in use on this endpoint
    endpoint->ucEndpointTxFlags = ENDPOINT_DUAL_BANK;
#else
    usFIF0address += endpoint->usEndpointSize;                           // one buffers have been added to the FIFO with the endpoint buffer size
    endpoint->ucEndpointRxFlags = 0;
    endpoint->ucEndpointTxFlags = 0;
#endif

    _SIM_USB(0, USB_SIM_ENUMERATED,0,0);                                 // inform the simultor that USB enumeration has completed
}

