sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
// This routine reads rx FIFO into an intermediate buffer. It returns a pointer to the start of the static buffer
//
extern unsigned char *fnReadUSB_FIFO(volatile unsigned char *fifo_addr, unsigned short length, unsigned short Offset)
{
    static unsigned char ucFIFO[MAX_FIFO_LENGTH];                        // intermediate FIFO data buffer for simpler and compatible interface with the application
    unsigned short usBufOffset = Offset;
    while (length--) {
        ucFIFO[usBufOffset++] = *fifo_addr;
    #ifdef _WINDOWS
        fifo_addr++;
    #endif
    }
    return ucFIFO;
}

    #ifdef _WINDOWS
// Request an endpoint buffer size
//
extern unsigned short fnGetEndpointInfo(int iEndpoint)
{
    USB_END_POINT *endpoint = (usb_endpoints + iEndpoint);
    return endpoint->usEndpointSize;
}
    #endif

#endif                                                                   // end if defined USB_INTERFACE



#if defined CAN_INTERFACE
// Hardware configuration of CAN controller
//
extern void fnConfigCAN(QUEUE_HANDLE DriverID, CANTABLE *pars)
{
}

// Hardware initialisation of CAN controller
//
extern void fnInitCAN(CANTABLE *pars)
{
}

// The CAN driver has called this to collect a received message
//
extern unsigned char fnCAN_get_rx(QUEUE_HANDLE DriverID, unsigned char *ptBuffer, QUEUE_TRANSFER Counter)
{
return 0;
}

// The CAN driver has called this to send a message
//
unsigned char fnCAN_tx(QUEUE_HANDLE DriverID, unsigned char *ptBuffer, QUEUE_TRANSFER Counter)
{
    return 0;
}
#endif


#ifdef SUPPORT_PORT_INTERRUPTS                                           // ports A..H
    #ifdef SUPPORT_PORT_A_INTERRUPTS
        static void (*port_a_handler[8])( void ) = {0};
        static __interrupt void port_A_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_A != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_A) {
                    _CLEAR_INTERRUPT(GPIOICR, A, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_a_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_B_INTERRUPTS
        static void (*port_b_handler[8])( void ) = {0};
        static __interrupt void port_B_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_B != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_B) {
                    _CLEAR_INTERRUPT(GPIOICR, B, ulBit);                 // clear the interrupt
                    if (port_b_handler[iHandler] != 0) {                 // allow a dummy interrupt when used only for triggering ADC
                        uDisable_Interrupt();                            // ensure interrupts remain blocked during subroutines
                        port_b_handler[iHandler]();                      // call the user's handler
                        uEnable_Interrupt();                             // release
                    }
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_C_INTERRUPTS
        static void (*port_c_handler[8])( void ) = {0};
        static __interrupt void port_C_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_C != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_C) {
                    _CLEAR_INTERRUPT(GPIOICR, C, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_c_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_D_INTERRUPTS
        static void (*port_d_handler[8])( void ) = {0};
        static __interrupt void port_D_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_D != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_D) {
                    _CLEAR_INTERRUPT(GPIOICR, D, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_d_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_E_INTERRUPTS
        static void (*port_e_handler[8])( void ) = {0};
        static __interrupt void port_E_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_E != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_E) {
                    _CLEAR_INTERRUPT(GPIOICR, E, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_e_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_F_INTERRUPTS
        static void (*port_f_handler[8])( void ) = {0};
        static __interrupt void port_F_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_F != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_F) {
                    _CLEAR_INTERRUPT(GPIOICR, F, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_f_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_G_INTERRUPTS
        static void (*port_g_handler[8])( void ) = {0};
        static __interrupt void port_G_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_G != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_G) {
                    _CLEAR_INTERRUPT(GPIOICR, G, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_g_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

