sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
    #ifdef SUPPORT_PORT_H_INTERRUPTS
        static void (*port_h_handler[8])( void ) = {0};
        static __interrupt void port_H_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_H != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_H) {
                    _CLEAR_INTERRUPT(GPIOICR, H, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_h_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release                
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif

    #ifdef SUPPORT_PORT_J_INTERRUPTS
        static void (*port_j_handler[8])( void ) = {0};
        static __interrupt void port_J_irq(void)
        {
            unsigned long ulBit = 0x80;
            int iHandler = 7;
            while ((ulBit != 0) && (GPIOMIS_J != 0)) {                   // while interrupts on this port
                if (ulBit & GPIOMIS_J) {
                    _CLEAR_INTERRUPT(GPIOICR, J, ulBit);                 // clear the interrupt
                    uDisable_Interrupt();                                // ensure interrupts remain blocked during subroutines
                    port_j_handler[iHandler]();                          // call the user's handler
                    uEnable_Interrupt();                                 // release
                }
                ulBit >>= 1;
                iHandler--;
            }
        }
    #endif
#endif

#if defined SUPPORT_TIMER                                                 // {5}
static void (*timer_handler[CHIP_HAS_GP_TIMER * 2])( void ) = {0};       // {30}
static __interrupt void timer_0_irq(void)
{
    _CLEAR_INTERRUPT(GPTMICR, 0, TATOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[0]();
    uEnable_Interrupt();                                                 // release
}     

static __interrupt void timer_0b_irq(void)                                // {30}
{
    _CLEAR_INTERRUPT(GPTMICR, 0, TBTOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[1]();
    uEnable_Interrupt();                                                 // release
}     


static __interrupt void timer_1_irq(void)
{
    _CLEAR_INTERRUPT(GPTMICR, 1, TATOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[2]();
    uEnable_Interrupt();                                                 // release
}

static __interrupt void timer_1b_irq(void)                               // {30}
{
    _CLEAR_INTERRUPT(GPTMICR, 1, TBTOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[3]();
    uEnable_Interrupt();                                                 // release
}      


    #if CHIP_HAS_GP_TIMER > 2
static __interrupt void timer_2_irq(void)
{
    _CLEAR_INTERRUPT(GPTMICR, 2, TATOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[4]();
    uEnable_Interrupt();                                                 // release
}

static __interrupt void timer_2b_irq(void)                               // {30}
{
    _CLEAR_INTERRUPT(GPTMICR, 2, TBTOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[5]();
    uEnable_Interrupt();                                                 // release
}   
    #endif

    #if CHIP_HAS_GP_TIMER > 3
static __interrupt void timer_3_irq(void)
{
    _CLEAR_INTERRUPT(GPTMICR, 3, TATOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[6]();
    uEnable_Interrupt();                                                 // release
}

static __interrupt void timer_3b_irq(void)                               // {30}
{
    _CLEAR_INTERRUPT(GPTMICR, 3, TBTOCINT);                              // clear the interrupt
    uDisable_Interrupt();                                                // ensure interrupts remain blocked during subroutines
    timer_handler[7]();
    uEnable_Interrupt();                                                 // release
}
    #endif

static void (*_timer_irq[CHIP_HAS_GP_TIMER * 2])( void ) = {             // {30}
timer_0_irq, timer_0b_irq,
timer_1_irq, timer_1b_irq,
    #if CHIP_HAS_GP_TIMER > 2
timer_2_irq, timer_2b_irq,
    #endif
    #if CHIP_HAS_GP_TIMER > 3
timer_3_irq, timer_3b_irq
    #endif
};

#endif


#if defined SUPPORT_ADC && PART_DC1 & ADC0_PRESENT1

static void ( *adc_int_complete_handler)( void ) = 0;
static unsigned short usSampleCount = 0;
static unsigned short *ptrSamples = 0;

static __interrupt void _ADC_sequence_0_complete(void)
{
    int iSamples = 0;
    ADCISC_0 = INT_SS0;                                                  // clear the interrupt
    while ((ADCSSFSTAT0_0 & FIFO_EMPTY) == 0) {
        if (ptrSamples != 0) {
            *ptrSamples++ = (signed short)GET_ADC_FIFO(0, 0, ADCSSFIFO0_0); // read, clear and store the samples
            iSamples++;
        }
    }
    if (usSampleCount <= 1) {
        RCGC0 &= ~CGC_SARADC0;                                           // disable clocks to module
        uDisable_Interrupt();                                            // {19} protect the call from interrupts
            adc_int_complete_handler();                                  // call the interrupt handler
        uEnable_Interrupt();
    }
    else {
        if (adc_int_complete_handler != 0) {
            usSampleCount--;
        }
        else {                                                           // no interrupt routine so infinite sampling to fixed buffer
            ptrSamples -= iSamples;                                      // reset sample array for next sequence
        }
        if ((ADCEMUX_0 & SS0_MASK) == TRIG_CONTROLLER) {
            ADCPSSI_0 = INITIATE_SS0;                                    // trigger next sequence sampling by software
        }
    }
}


#if defined SUPPORT_ADC && PART_DC1 & ADC1_PRESENT1

