sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
static void ( *adc1_int_complete_handler)( void ) = 0;
static unsigned short usSample1Count = 0;
static unsigned short *ptrSamples1 = 0;

static __interrupt void _ADC_sequence_1_complete(void)
{
    int iSamples = 0;
    ADCISC_1 = INT_SS0;                                                  // clear the interrupt
    while (!(ADCSSFSTAT0_1 & FIFO_EMPTY)) {
        if (ptrSamples1 != 0) {
            *ptrSamples1++ = (signed short)GET_ADC_FIFO(1, 0, ADCSSFIFO0_1); // read, clear and store the samples
            iSamples++;
        }
    }
    if (usSample1Count <= 1) {
        RCGC0 &= ~CGC_SARADC1;                                           // disable clocks to module
        uDisable_Interrupt();                                            // protect the call from interrupts
        adc1_int_complete_handler();                                     // call the interrupt handler
        uEnable_Interrupt();
    }
    else {
        if (adc1_int_complete_handler != 0) {
            usSample1Count--;
        }
        else {                                                           // no interrupt routine so infinite sampling to fixed buffer
            ptrSamples1 -= iSamples;                                     // reset sample array for next sequence
        }
        if ((ADCEMUX_1 & SS0_MASK) == TRIG_CONTROLLER) {
            ADCPSSI_1 = INITIATE_SS0;                                    // trigger next sequence sampling by software
        }
    }
}
#endif

#ifdef _TEMPEST_CLASS                                                    // {24}
static void fnConfigADC(ADC_SETUP *ptrADC_settings, int iChannel)        // used only by Tempest class devices with more that 8 ADC inputs (more than 1 ADC module)
{
    LM3XXXXX_ADC *ptrADC_reg;
    int iInputs = 0;
    unsigned long ulConfig = 0;
    unsigned long ulControl = 0;
    unsigned long ulInternalTemp = 0;
    unsigned long ulInputNumber = 0;
    unsigned long ulInputPinNumber;
    unsigned long ulBit = 0x00000001;
    unsigned long ulDifInputs  = ptrADC_settings->int_adc_differential_inputs;
    unsigned long ulSingInputs = ptrADC_settings->int_adc_single_ended_inputs;
    if (iChannel == 0) {
        ptrADC_reg = (LM3XXXXX_ADC *)ADC_0_BLOCK;
        ulInputPinNumber = 0;
    }
    else {
        ptrADC_reg = (LM3XXXXX_ADC *)ADC_1_BLOCK;
        ulSingInputs >>= 8;
        ulDifInputs  >>= 8;
        ulInputPinNumber = 8;
    }
    ptrADC_reg->ADCACTSS &= ~ASEN0;                                      // ensure sequencer is disabled before configuring
    ptrADC_reg->ADCEMUX  &= ~SS0_MASK;                                   // clear sequencer mode
    if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING | ADC_TRIGGER_COMPARATOR_0 | ADC_TRIGGER_COMPARATOR_1 | ADC_TRIGGER_COMPARATOR_2 | ADC_TRIGGER_TIMER | ADC_TRIGGER_PWM_0 | ADC_TRIGGER_PWM_1 | ADC_TRIGGER_PWM_2 | ADC_TRIGGER_PWM_3)) {
        if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING)) {
            INTERRUPT_SETUP interrupt_setup;                             // interrupt configuration parameters
            interrupt_setup.int_type = PORT_INTERRUPT;                   // identifier when configuring
            interrupt_setup.int_handler = 0;                             // no specific handling function
            switch (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING)) {
            case ADC_TRIGGER_GPIO_PB4_RISING:
                interrupt_setup.int_port_sense = IRQ_RISING_EDGE;        // trigger on rising edge
                break;
            case ADC_TRIGGER_GPIO_PB4_FALLING:
                interrupt_setup.int_port_sense = IRQ_FALLING_EDGE;       // trigger on falling edge
                break;
            case (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING):
                interrupt_setup.int_port_sense = IRQ_BOTH_EDGES;         // trigger on both edges
                break;
            }
            interrupt_setup.int_port = PORTB;                            // the port used
            interrupt_setup.int_priority = PORTB_INTERRUPT_PRIORITY;     // port interrupt priority
            interrupt_setup.int_port_bit = PORTB_BIT4;                   // the input connected
            interrupt_setup.int_port_characteristic = SET_ADC_TRIGGER;   // don't change configuration
            fnConfigureInterrupt(&interrupt_setup);                      // configure PB4 accordingly
            ptrADC_reg->ADCEMUX |= TRIG_GPIO_PB4;                        // trigger on PB4 input
        }
        else if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_COMPARATOR_0 | ADC_TRIGGER_COMPARATOR_1 | ADC_TRIGGER_COMPARATOR_2)) {
            switch (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_COMPARATOR_0 | ADC_TRIGGER_COMPARATOR_1 | ADC_TRIGGER_COMPARATOR_2)) {
            case ADC_TRIGGER_COMPARATOR_0:
                ptrADC_reg->ADCEMUX |= TRIG_AN_COMP_0;
                break;
            case ADC_TRIGGER_COMPARATOR_1:
                ptrADC_reg->ADCEMUX |= TRIG_AN_COMP_1;
                break;
            case ADC_TRIGGER_COMPARATOR_2:
                ptrADC_reg->ADCEMUX |= TRIG_AN_COMP_2;
                break;
            }
        }
        else if (ptrADC_settings->int_adc_mode & ADC_TRIGGER_TIMER) {
            ptrADC_reg->ADCEMUX |= TRIG_TIMER;                           // trigger from any enabled timer source
        }
        else if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_PWM_0 | ADC_TRIGGER_PWM_1 | ADC_TRIGGER_PWM_2 | ADC_TRIGGER_PWM_3)) {
            switch (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_PWM_0 | ADC_TRIGGER_PWM_1 | ADC_TRIGGER_PWM_2 | ADC_TRIGGER_PWM_3)) {
            case ADC_TRIGGER_PWM_0:
                ptrADC_reg->ADCEMUX |= TRIG_PMW_0;
                break;
            case ADC_TRIGGER_PWM_1:
                ptrADC_reg->ADCEMUX |= TRIG_PMW_1;
                break;
            case ADC_TRIGGER_PWM_2:
                ptrADC_reg->ADCEMUX |= TRIG_PMW_2;
                break;
            case ADC_TRIGGER_PWM_3:
                ptrADC_reg->ADCEMUX |= TRIG_PMW_3;
                break;
            }
        }                        
    }
    else {
        ptrADC_reg->ADCEMUX |= TRIG_CONTROLLER;                          // started by software
    }
    ptrADC_reg->ADCSAC = ptrADC_settings->int_adc_averaging;
    while (ulBit <= 0x80) {                                              // count the number of inputs to be sampled
        if (ulBit & (ulSingInputs | ulDifInputs)) {
            if (ulBit & ulDifInputs) {
                if (!(ulInputNumber & 0x1)) {                            // enter only one of the differential pairs
                    ulControl |= (DIF_SAMPLE_1 << (iInputs * 4));        // mark that this belongs to a differential input pair
                    ulConfig |= (ulInputNumber/2 << (iInputs * 4));      // enter the differential pair in the sampling sequence
                    iInputs++;
                }
            }
            else {
                if (ulSingInputs & (ulBit << 16)) {                      // the channel is from the internal temperature
                    ulInternalTemp |= (TEMP_SAMPLE_1 << (iInputs * 4));
                }
                else {
                    ulConfig |= ((ulInputNumber + ulInputPinNumber) << (iInputs * 4));  // enter the channel in the sampling sequence
                }
                iInputs++;
            }
            if (ulInputPinNumber >= 12) {                                // 12 = PD3, 14 = PD2, 14 = PD1, 15 = PD0
                _CONFIG_PERIPHERAL(D, SARADC1, 0, (PORTD_BIT3 >> (ulInputPinNumber - 12)), 0);
                GPIOAMSEL_D |= (0x01 << (3 - (ulInputPinNumber - 12)));  // disable analogue isolation on pin
            }
            else if (ulInputPinNumber >= 10) {                           // 10 = PB4, 11 = PB5
                _CONFIG_PERIPHERAL(B, SARADC1, 0, (PORTB_BIT4 << (ulInputPinNumber - 10)), 0);
                GPIOAMSEL_B |= (0x01 << (4 + (ulInputPinNumber - 10)));  // disable analogue isolation on pin
            }
            else if (ulInputPinNumber >= 8) {                            // 8 = PE3, 9 = PE2
                _CONFIG_PERIPHERAL(E, SARADC1, 0, (PORTE_BIT3 >> (ulInputPinNumber - 8)), 0);
                GPIOAMSEL_E |= (0x01 << (3 - (ulInputPinNumber - 8)));   // disable analogue isolation on pin
            }
            else if (ulInputPinNumber >= 4) {                            // 4 = PD7, 5 = PD6, 6 = PD5, 7 = PD4
                _CONFIG_PERIPHERAL(D, SARADC0, 0, (PORTD_BIT7 >> (ulInputPinNumber - 4)), 0);
                GPIOAMSEL_D |= (0x01 << (7 - (ulInputPinNumber - 4)));   // disable analogue isolation on pin
            }
            else {                                                       // 0 = PE7, 1 = PE6, 2 = PE5, 3 = PE4
                _CONFIG_PERIPHERAL(E, SARADC0, 0, (PORTE_BIT7 >> ulInputPinNumber), 0);
                GPIOAMSEL_E |= (0x01 << (7 - ulInputPinNumber));         // disable analogue isolation on pin
            }
        }
        else {
            if (ulInputPinNumber >= 12) {                                // 12 = PD3, 14 = PD2, 14 = PD1, 15 = PD0
                GPIOAMSEL_D &= ~(0x01 << (3 - (ulInputPinNumber - 12))); // enable analogue isolation on pin
            }
            else if (ulInputPinNumber >= 10) {                           // 10 = PB4, 11 = PB5
                GPIOAMSEL_B &= ~(0x01 << (4 + (ulInputPinNumber - 10))); // enable analogue isolation on pin
            }
            else if (ulInputPinNumber >= 8) {                            // 8 = PE3, 9 = PE2
                GPIOAMSEL_E &= ~(0x01 << (3 - (ulInputPinNumber - 8)));  // enable analogue isolation on pin
            }
            else if (ulInputPinNumber >= 4) {                            // 4 = PD7, 5 = PD6, 6 = PD5, 7 = PD4
                GPIOAMSEL_D &= ~(0x01 << (7 - (ulInputPinNumber - 4)));  // enable analogue isolation on pin
            }
            else {                                                       // 0 = PE7, 1 = PE6, 2 = PE5, 3 = PE4
                GPIOAMSEL_E &= ~(0x01 << (7 - ulInputPinNumber));        // enable analogue isolation on pin
            }
        }
        ulBit <<= 1;
        ulInputNumber++;
        ulInputPinNumber++;
    }
    if (iInputs == 0) {
        return;                                                          // no inputs found
    }
    iInputs--;
    ulControl |= (((END_SAMPLE_1 | INT_SAMPLE_1) << (iInputs * 4)) | ulInternalTemp); // mark last sample which will interrupt 
    ptrADC_reg->ADCSSMUX0 = ulConfig;                                    // program the sequencer
    ptrADC_reg->ADCSSCTL0 = ulControl;
}
#endif
#endif

// Configure a specific interrupt, including processor specific settings and enter a handler routine.
// Some specific peripheral control may be performed here.
//
extern void fnConfigureInterrupt(void *ptrSettings)
{
    switch (((INTERRUPT_SETUP *)ptrSettings)->int_type) {
#ifdef SUPPORT_PORT_INTERRUPTS
    case PORT_INTERRUPT:
        {   
            LM3XXXXX_PORT_CONTROL *port;
            unsigned char ucIRQ_bit = (((INTERRUPT_SETUP *)ptrSettings)->int_port_bit);
            int iRef = 0;
            unsigned long irq_ID;
            unsigned long ulPortEnable;
            void (**port_handler)(void);
            void (*port_irq)(void);
            if (ucIRQ_bit == 0) {
                return;                                                  // invalid port bit
            }
            while ((ucIRQ_bit & (1 << iRef)) == 0) {
                iRef++;
            }
            port = fnGetPortBlock(((INTERRUPT_SETUP *)ptrSettings)->int_port);
            switch (((INTERRUPT_SETUP *)ptrSettings)->int_port) {
    #if defined SUPPORT_PORT_A_INTERRUPTS && (PART_DC4 & GPIOA_PRESENT4)
            case PORTA:
                ulPortEnable = CGC_GPIOA;
                irq_ID = irq_GPIO_Port_A_ID;
                port_irq = port_A_irq;
                port_handler = &port_a_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_B_INTERRUPTS
            case PORTB:
                ulPortEnable = CGC_GPIOB;
                irq_ID = irq_GPIO_Port_B_ID;
                port_irq = port_B_irq;
                port_handler = &port_b_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_C_INTERRUPTS
            case PORTC:
                ulPortEnable = CGC_GPIOC;
                irq_ID = irq_GPIO_Port_C_ID;
                port_irq = port_C_irq;
                port_handler = &port_c_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_D_INTERRUPTS
            case PORTD:
                ulPortEnable = CGC_GPIOD;
                irq_ID = irq_GPIO_Port_D_ID;
                port_irq = port_D_irq;
                port_handler = &port_d_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_E_INTERRUPTS
            case PORTE:
                ulPortEnable = CGC_GPIOE;
                irq_ID = irq_GPIO_Port_E_ID;
                port_irq = port_E_irq;
                port_handler = &port_e_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_F_INTERRUPTS
            case PORTF:
                ulPortEnable = CGC_GPIOF;
                irq_ID = irq_GPIO_Port_F_ID;
                port_irq = port_F_irq;
                port_handler = &port_f_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_G_INTERRUPTS
            case PORTG:
                ulPortEnable = CGC_GPIOG;
                irq_ID = irq_GPIO_Port_G_ID;
                port_irq = port_G_irq;
                port_handler = &port_g_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_H_INTERRUPTS
            case PORTH:
                ulPortEnable = CGC_GPIOH;
                irq_ID = irq_GPIO_Port_H_ID;
                port_irq = port_H_irq;
                port_handler = &port_h_handler[iRef];
                break;
    #endif
    #ifdef SUPPORT_PORT_J_INTERRUPTS
            case PORTJ:
                ulPortEnable = CGC_GPIOJ;
                irq_ID = irq_GPIO_Port_J_ID;
                port_irq = port_J_irq;
                port_handler = &port_j_handler[iRef];
                break;
    #endif
            default:                                                     // invalid port
                return;
            }
            if (((((INTERRUPT_SETUP *)ptrSettings)->int_handler) == 0) && (((INTERRUPT_SETUP *)ptrSettings)->int_port_characteristic != SET_ADC_TRIGGER)) {  // disable interrupt
                port->GPIOIM &= ~ucIRQ_bit;                              // mask interrupt
                if (port->GPIOIM == 0) {                                 // if no more interrupts are required on the port
    #ifdef _WINDOWS
                    unsigned long ulState0 = IRQ0_31_SER;
    #endif
                    IRQ0_31_CER = (0x01 << irq_GPIO_Port_B_ID);          // disable them to the core
    #ifdef _WINDOWS
                    ulState0 &= ~IRQ0_31_CER;
                    IRQ0_31_SER   = ulState0;                            // synchronise the interrupt masks
                    IRQ0_31_CER   = IRQ0_31_SER;
    #endif
                }
                return;
            }
            RCGC2 |= ulPortEnable;                                       // ensure port is enabled
            SRCR2 &= ~ulPortEnable;
            port->GPIOAFSEL &= ~(ucIRQ_bit);                             // GPIO pin use
            port->GPIODIR &= ~(ucIRQ_bit);                               // input
            port->GPIODEN |= (ucIRQ_bit);                                // digital function

            if (((INTERRUPT_SETUP *)ptrSettings)->int_port_sense >= IRQ_FALLING_EDGE) { // edge sentivive
                port->GPIOIS &= ~ucIRQ_bit;                              // disable level sensitivity
                if (IRQ_BOTH_EDGES == ((INTERRUPT_SETUP *)ptrSettings)->int_port_sense) {
                    port->GPIOIBE |= ucIRQ_bit;                          // interrupt on both edges
                }
                else {
                    port->GPIOIBE &= ~ucIRQ_bit;                         // not both edges
                    if (IRQ_RISING_EDGE == ((INTERRUPT_SETUP *)ptrSettings)->int_port_sense) { // set the required edge only
                        port->GPIOIEV |= ucIRQ_bit;                      // rising edge sensitive
                    }
                    else {
                        port->GPIOIEV &= ~ucIRQ_bit;                     // falling edge sensitive
                    }
                }
            }
            else {                                                       // level sensitive
                port->GPIOIBE &= ~ucIRQ_bit;                             // no edge sensitivity
                port->GPIOIS |= ucIRQ_bit;                               // level sensitive
                if (IRQ_LEVEL_SENSITIVE_HIGH == ((INTERRUPT_SETUP *)ptrSettings)->int_port_sense) {
                    port->GPIOIEV |= ucIRQ_bit;                          // high level sensitive
                }
                else {
                    port->GPIOIEV &= ~ucIRQ_bit;                         // low level sensitive
                }
            }
            switch (((INTERRUPT_SETUP *)ptrSettings)->int_port_characteristic) {
            case PULLUP_ON:
                port->GPIOPUR |= ucIRQ_bit;
    #ifdef _WINDOWS
                port->GPIOPDR &= ~ucIRQ_bit;                             // pull down is automatically disabled
    #endif
                break;
            case PULLDOWN_ON:
                port->GPIOPDR |= ucIRQ_bit;
    #ifdef _WINDOWS
                port->GPIOPUR &= ~ucIRQ_bit;                             // pull up is automatically disabled
    #endif
            case SET_ADC_TRIGGER:                                        // input being configured for ADC trigger use (only valid for Port B)
                if (!(IRQ0_31_SER & (1 << irq_GPIO_Port_B_ID))) {        // port B interrupt is not enabled at the code
                    _CLEAR_INTERRUPT(GPIOICR, B, PORTB_BIT4);            // ensure interrupt cleared if not handled by general port interrupts
                }
                port->GPIOIM |= ucIRQ_bit;                               // unmask interrupt to allow ADC triggering, but it won't cause interrupts to occur unless they are already being used as normal port interrupts
                return;
            default:
                break;
            }
            port->_GPIOICR = ucIRQ_bit;                                  // clear pending
    #ifdef _WINDOWS
            port->_GPIOICR = 0;
    #endif
            fnEnterInterrupt(irq_ID, (((INTERRUPT_SETUP *)ptrSettings)->int_priority), port_irq);
            *port_handler = (((INTERRUPT_SETUP *)ptrSettings)->int_handler);
            port->GPIOIM |= ucIRQ_bit;                                   // unmask interrupt
        }
        break;
#endif
#if defined SUPPORT_TIMER                                                 // {5}
    case TIMER_INTERRUPT:                                                // {12}
        {
            int iTimer = (((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_reference); // the timer to use
            if (iTimer < CHIP_HAS_GP_TIMER) {                            // only handle when the referenced timer is available
                TIMER_INTERRUPT_SETUP *ptrSetup = (TIMER_INTERRUPT_SETUP *)ptrSettings;
                LM3XXXXX_GPT_CONTROL *timer_control = (LM3XXXXX_GPT_CONTROL *)GP_TIMER_0_BLOCK;
                if ((TIMER_DONT_DISTURB & ptrSetup->timer_mode) == 0) {
                    SRCR1 |= (CGC_TIMER0 << iTimer);                     // reset timer
                    timer_control += iTimer;                             // set to the timer's register block
                    if (ptrSetup->timer_mode & (TIMER_STOP_PWM_A | TIMER_STOP_PWM_B)) {
                        RCGC1 &= ~(CGC_TIMER0 << iTimer);                // power down timer
                        return;
                    }
                    RCGC1 |= (CGC_TIMER0 << iTimer);                     // ensure timer is enabled
                }
                else {
                    timer_control += iTimer;                             // set to the timer's register block
                    if (ptrSetup->timer_mode & (TIMER_STOP_PWM_A | TIMER_STOP_PWM_B)) {
                        if (ptrSetup->timer_mode & TIMER_STOP_PWM_A) {   // stop PWM A output
                            timer_control->GPTMCTL &= ~(TAEN);
                        }
                        if (ptrSetup->timer_mode & TIMER_STOP_PWM_B) {   // stop PWM B output
                            timer_control->GPTMCTL &= ~(TBEN);
                        }
                        return;
                    }
                }
 
