sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
                SRCR1 &= ~(CGC_TIMER0 << iTimer);                        // take out of reset
                if (ptrSetup->int_handler != 0) {
                    int iIrq = irq_Timer0_A_ID;
    #if CHIP_HAS_GP_TIMER > 3
                    if (iTimer < 3) {
                        iIrq += (iTimer * 2);
                    }
                    else {
                        iIrq = irq_Timer3_A_ID;
                    }
    #else
                    iIrq += (iTimer * 2);
    #endif
                    if (ptrSetup->timer_mode & TIMER_16BIT_CHANNEL_B) {  // 16 bit mode using channel B {30}
                        fnEnterInterrupt((iIrq + 1), ptrSetup->int_priority, (void (*)( void ))_timer_irq[(iTimer * 2) + 1]);
                        timer_handler[(iTimer * 2) + 1] = ptrSetup->int_handler;
                        timer_control->GPTMIMR |= TBTOIM;                // interrupt on timeout
                    }
                    else {
                        fnEnterInterrupt(iIrq, ptrSetup->int_priority, (void (*)( void ))_timer_irq[iTimer * 2]);
                        timer_handler[iTimer * 2] = ptrSetup->int_handler;
                        timer_control->GPTMIMR |= TATOIM;                // interrupt on timeout
                    }
                }
                else {
                    if (ptrSetup->timer_mode & TIMER_16BIT_CHANNEL_B) {  // 16 bit mode using channel B {30}
                        timer_control->GPTMIMR &= ~TBTOIM;               // no interrupt on timeout
                    }
                    else {
                        timer_control->GPTMIMR &= ~TATOIM;               // no interrupt on timeout
                    }
                }
                if (ptrSetup->timer_mode & (TIMER_PWM_A | TIMER_PWM_B)) {// {13}
                    timer_control->GPTMCFG = GPTMCFG_16_BIT_MODE;
                    if (ptrSetup->timer_mode & TIMER_PWM_A) {
                        switch (iTimer) {
                        case 0:
        #if defined _LM3S8962 || defined _LM3S6965
                            _CONFIG_PERIPHERAL(D, TIMER0, 1, (PORTD_BIT4), 0); // CCP0
        #else
                            _CONFIG_PERIPHERAL(B, TIMER0, 1, (PORTB_BIT0), (PB0_CCP0));
        #endif
                            break;
                        case 1:
                            _CONFIG_PERIPHERAL(B, TIMER1, 1, (PORTB_BIT1), (PB1_CCP2)); // CCP2
                            break;
        #if CHIP_HAS_GP_TIMER > 2
                        case 2:
                            _CONFIG_PERIPHERAL(A, TIMER2, 1, (PORTA_BIT7), (PA7_CCP4)); // CCP4
                            break;
        #endif
        #if CHIP_HAS_GP_TIMER > 3
                        case 3:
                            _CONFIG_PERIPHERAL(H, TIMER3, 1, (PORTH_BIT0), (PH0_CCP6)); // CCP6
                            break;
        #endif
                        }
                        timer_control->GPTMTAMR = (TAMS_PWM_MODE | TMR_PERIODIC);// set PWM mode
                        timer_control->GPTMTAMATCHR = ptrSetup->pwm_value; //((ptrSetup->timer_value * ptrSetup->pwm_value)/1000); // {16} set the PWM match value
                        timer_control->GPTMTAILR = ptrSetup->timer_value;// set the base frequence
                        timer_control->GPTMCTL |= (TAEN | TAPWML);       // enable operation - the timer will count down
                    }
                    else if (ptrSetup->timer_mode & TIMER_PWM_B) {
                        switch (iTimer) {
                        case 0:
        #if defined _LM3S8962 || defined _LM3S6965
                            _CONFIG_PERIPHERAL(D, TIMER0, 1, (PORTD_BIT7), PD7_CCP1); // CCP1
        #else
                            _CONFIG_PERIPHERAL(A, TIMER0, 1, (PORTA_BIT6), PA6_CCP1); // CCP1
        #endif
                            break;
                        case 1:
                            _CONFIG_PERIPHERAL(D, TIMER1, 1, (PORTD_BIT4), (PD4_CCP3)); // CCP3
                            break;
        #if CHIP_HAS_GP_TIMER > 2
                        case 2:
                            _CONFIG_PERIPHERAL(C, TIMER2, 1, (PORTC_BIT4), (PC4_CCP5)); // CCP5
                            break;
        #endif
        #if CHIP_HAS_GP_TIMER > 3
                        case 3:
                            _CONFIG_PERIPHERAL(B, TIMER3, 1, (PORTB_BIT6), (PB6_CCP7)); // CCP7
                            break;
        #endif
                        }
                        timer_control->GPTMTBMR = (TAMS_PWM_MODE | TMR_PERIODIC);// set PWM mode
                        timer_control->GPTMTBMATCHR = ptrSetup->pwm_value; //((ptrSetup->timer_value * ptrSetup->pwm_value)/1000); // {16} set the PWM match value
                        timer_control->GPTMTBILR = ptrSetup->timer_value;// set the base frequence
                        timer_control->GPTMCTL |= (TBEN | TBPWML);       // enable operation - the timer will count down
                    }
                }
                else {
                    if (ptrSetup->timer_mode & (TIMER_16BIT_CHANNEL_A | TIMER_16BIT_CHANNEL_B)) { // 16 bit mode using a single channel {30}
                        timer_control->GPTMCFG = GPTMCFG_16_BIT_MODE;
                        if (ptrSetup->timer_mode & TIMER_16BIT_CHANNEL_A) { // channel A in 16 bit mode
                            if (ptrSetup->timer_mode & (TIMER_PERIODIC)) {
                                timer_control->GPTMTAMR = (TMR_PERIODIC);// set to periodic mode
                            }
                            else {
                                timer_control->GPTMTAMR = (TMR_ONE_SHOT);// set to single-shot mode
                            }
                            if (ptrSetup->timer_mode & TIMER_MS_VALUE) { // ms value
                                timer_control->GPTMTAILR = ((MASTER_CLOCK/1000)*ptrSetup->timer_value); // set the ms timeout value
                            }
                            else {
                                timer_control->GPTMTAILR = ((MASTER_CLOCK/1000000)*ptrSetup->timer_value); // set the us timeout value
                            }
        #ifdef _WINDOWS
                            timer_control->GPTMTAILR &= 0xffff;          // ensure only lowest 16 bits are used
                            timer_control->GPTMTAR = timer_control->GPTMTAILR; // set initial timer count
        #endif
                            if (ptrSetup->timer_mode & TIMER_TRIGGER_ADC) {
                                timer_control->GPTMCTL = (TAOTE | TAEN); // enable operation - the timer will count down and trigger the ADC on reaching zero
                            }
                            else {
                                timer_control->GPTMCTL = (TAEN);         // enable operation - the timer will count down
                            }
                        }
                        else {                                           // channel B in 16 bit mode
                            if (ptrSetup->timer_mode & (TIMER_PERIODIC)) {
                                timer_control->GPTMTBMR = (TMR_PERIODIC);// set to periodic mode
                            }
                            else {
                                timer_control->GPTMTBMR = (TMR_ONE_SHOT);// set to single-shot mode
                            }
                            if (ptrSetup->timer_mode & TIMER_MS_VALUE) { // ms value
                                timer_control->GPTMTBILR = ((MASTER_CLOCK/1000)*ptrSetup->timer_value); // set the ms timeout value
                            }
                            else {
                                timer_control->GPTMTBILR = ((MASTER_CLOCK/1000000)*ptrSetup->timer_value); // set the us timeout value
                            }
        #ifdef _WINDOWS
                            timer_control->GPTMTBILR &= 0xffff;          // ensure only lowest 16 bits are used
                            timer_control->GPTMTBR = timer_control->GPTMTBILR; // set initial timer count
        #endif
                            if (ptrSetup->timer_mode & TIMER_TRIGGER_ADC) {
                                timer_control->GPTMCTL = (TBOTE | TBEN); // enable operation - the timer will count down and trigger the ADC on reaching zero
                            }
                            else {
                                timer_control->GPTMCTL = (TBEN);         // enable operation - the timer will count down
                            }
                        }
                    }
                    else {
                        if (ptrSetup->timer_mode & (TIMER_PERIODIC)) {
                            timer_control->GPTMTAMR = (TMR_PERIODIC);    // set to periodic mode
                        }
                        else {
                            timer_control->GPTMTAMR = (TMR_ONE_SHOT);    // set to single-shot mode
                        }
                        if (ptrSetup->timer_mode & TIMER_MS_VALUE) {     // ms value
                            timer_control->GPTMTAILR = ((MASTER_CLOCK/1000)*ptrSetup->timer_value); // set the ms timeout value
                        }
                        else {
                            timer_control->GPTMTAILR = ((MASTER_CLOCK/1000000)*ptrSetup->timer_value); // set the us timeout value
                        }
        #ifdef _WINDOWS
                        timer_control->GPTMTAR = timer_control->GPTMTAILR; // set initial timer count
        #endif
                        if (ptrSetup->timer_mode & TIMER_TRIGGER_ADC) {
                            timer_control->GPTMCTL = (TAOTE | TAEN);     // enable operation - the timer will count down and trigger the ADC on reaching zero
                        }
                        else {
                            timer_control->GPTMCTL = (TAEN);             // enable operation - the timer will count down
                        }
                    }
                }
            }
        }
        break;
#endif
#if defined SUPPORT_ADC && PART_DC1 & ADC0_PRESENT1
    case ADC_INTERRUPT:
        {
            ADC_SETUP *ptrADC_settings = (ADC_SETUP *)ptrSettings; 
            if (ADC_DISABLE_ADC & ptrADC_settings->int_adc_mode) {
                ADCIM_0 = 0;                                             // mask interrupt sources
    #if defined _DUST_DEVIL_CLASS || defined _TEMPEST_CLASS
                GPIOAMSEL_D = 0;                                         // disable isolation on all analogue pins
                GPIOAMSEL_E = 0;
        #ifdef _TEMPEST_CLASS                                            // {24}
                GPIOAMSEL_B = 0;
        #endif
    #endif
    #ifdef _TEMPEST_CLASS                                                // {24}
                RCGC0 &= ~(CGC_SARADC0 | CGC_SARADC1);                   // disable clocks to ADC modules
    #else
                RCGC0 &= ~CGC_SARADC0;                                   // disable clocks to ADC module
    #endif
                return;
            }
            if ((ptrADC_settings->int_adc_mode & ADC_ALL_RESULTS) && (ptrADC_settings->int_adc_result != 0)) {// if there is a result structure
                unsigned short usResultsToReturn = ptrADC_settings->int_sequence_count;
                unsigned long ulSample;
                unsigned short *usResult = ptrADC_settings->int_adc_result;
                if (RCGC0 & CGC_SARADC0) {
                    while (!(ADCSSFSTAT0_0 & FIFO_EMPTY)) {
                        ulSample = GET_ADC_FIFO(0, 0, ADCSSFIFO0_0);     // read and clear the sample
                        if (usResultsToReturn != 0) {
                            *usResult++ = (unsigned short)ulSample;      // store
                            usResultsToReturn--;
                        }
                    }
                }
    #ifdef _TEMPEST_CLASS                                                // {24}
                if (RCGC0 & CGC_SARADC1) {
                    while (!(ADCSSFSTAT0_1 & FIFO_EMPTY)) {
                        ulSample = GET_ADC_FIFO(1, 0, ADCSSFIFO0_1);     // read and clear the sample
                        if (usResultsToReturn != 0) {
                            *usResult++ = (unsigned short)ulSample;      // store
                            usResultsToReturn--;
                        }
                    }
                }
    #endif
            }
            if (!(ptrADC_settings->int_adc_mode & ADC_READ_ONLY)) {
                unsigned long ulDifInputs  = ptrADC_settings->int_adc_differential_inputs;
                unsigned long ulSingInputs = ptrADC_settings->int_adc_single_ended_inputs;
                if (ptrADC_settings->int_adc_mode & ADC_CONFIGURE_ADC) { // main configuration
    #ifndef _TEMPEST_CLASS                                               // {24}
                    int iInputs = 0;
                    unsigned long ulConfig = 0;
                    unsigned long ulControl = 0;
                    unsigned long ulInternalTemp = 0;                    // {14}
                    unsigned long ulInputNumber = 0;
                    unsigned long ulBit = 0x00000001;
    #endif
    #ifdef _TEMPEST_CLASS                                                // {24}
                    if ((ulDifInputs | ulSingInputs) & (ADC_CHANNEL_0 | ADC_CHANNEL_1 | ADC_CHANNEL_2 | ADC_CHANNEL_3 | ADC_CHANNEL_4 | ADC_CHANNEL_5 | ADC_CHANNEL_6 | ADC_CHANNEL_7)) {
                        RCGC0 |= (CGC_SARADC0);                          // enable clocks to ADC0 module
                        RCGC0 |= CGC_SARADC0;                            // {33} enable clocks to ADC module (slow down slightly so that the ADC is ready for the first access)
                        fnConfigADC(ptrADC_settings, 0);
                        fnEnterInterrupt(irq_ADC_Sequence_0_ID, ptrADC_settings->int_priority, _ADC_sequence_0_complete); // enter the interrupt
                        adc_int_complete_handler = ptrADC_settings->int_handler;
                        usSampleCount = ptrADC_settings->int_sequence_count;
                        ptrSamples = ptrADC_settings->int_adc_result;
                        if (adc_int_complete_handler != 0) {
                            ADCIM_0 |= MASK_SS0;                         // enable interrupt from sequencer
                        }
                        ADCACTSS_0 |= ASEN0;                             // enable sequencer operation
                    }
                    else if ((ulDifInputs | ulSingInputs) & (ADC_CHANNEL_8 | ADC_CHANNEL_9 | ADC_CHANNEL_10 | ADC_CHANNEL_11 | ADC_CHANNEL_12 | ADC_CHANNEL_13 | ADC_CHANNEL_14 | ADC_CHANNEL_15)) {
                        RCGC0 |= (CGC_SARADC1);                          // enable clocks to ADC1 module
                        fnConfigADC(ptrADC_settings, 1);
                        fnEnterInterrupt(irq_ADC1_Sequence_0_ID, ptrADC_settings->int_priority, _ADC_sequence_1_complete); // enter the interrupt
                        adc1_int_complete_handler = ptrADC_settings->int_handler;
                        usSample1Count = ptrADC_settings->int_sequence_count;
                        ptrSamples1 = ptrADC_settings->int_adc_result;
                        if (adc1_int_complete_handler != 0) {
                            ADCIM_1 |= MASK_SS0;                         // enable interrupt from sequencer
                        }
                        ADCACTSS_1 |= ASEN0;                             // enable sequencer operation
                    }
    #else
                    RCGC0 |= CGC_SARADC0;                                // enable clocks to ADC module
                    RCGC0 |= CGC_SARADC0;                                // {33} enable clocks to ADC module (slow down slightly so that the ADC is ready for the first access)
                    ADCACTSS_0 &= ~ASEN0;                                // ensure sequencer is disabled before configuring
                    ADCEMUX_0 &= ~SS0_MASK;                              // clear sequencer mode
                    if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING | ADC_TRIGGER_COMPARATOR_0 | ADC_TRIGGER_COMPARATOR_1 | ADC_TRIGGER_COMPARATOR_2 | ADC_TRIGGER_TIMER | ADC_TRIGGER_PWM_0 | ADC_TRIGGER_PWM_1 | ADC_TRIGGER_PWM_2 | ADC_TRIGGER_PWM_3)) {
                        if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING)) {
                            INTERRUPT_SETUP interrupt_setup;             // interrupt configuration parameters
                            interrupt_setup.int_type = PORT_INTERRUPT;   // identifier when configuring
                            interrupt_setup.int_handler = 0;             // no specific handling function
                            switch (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING)) {
                            case ADC_TRIGGER_GPIO_PB4_RISING:
                                interrupt_setup.int_port_sense = IRQ_RISING_EDGE; // trigger on rising edge
                                break;
                            case ADC_TRIGGER_GPIO_PB4_FALLING:
                                interrupt_setup.int_port_sense = IRQ_FALLING_EDGE; // trigger on falling edge
                                break;
                            case (ADC_TRIGGER_GPIO_PB4_FALLING | ADC_TRIGGER_GPIO_PB4_RISING):
                                interrupt_setup.int_port_sense = IRQ_BOTH_EDGES; // trigger on both edges
                                break;
                            }
                            interrupt_setup.int_port = PORTB;            // the port used
                            interrupt_setup.int_priority = PORTB_INTERRUPT_PRIORITY; // port interrupt priority
                            interrupt_setup.int_port_bit = PORTB_BIT4;   // the input connected
                            interrupt_setup.int_port_characteristic = SET_ADC_TRIGGER; // don't change configuration
                            fnConfigureInterrupt(&interrupt_setup);      // configure PB4 accordingly
                            ADCEMUX_0 |= TRIG_GPIO_PB4;                  // trigger on PB4 input
                        }
                        else if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_COMPARATOR_0 | ADC_TRIGGER_COMPARATOR_1 | ADC_TRIGGER_COMPARATOR_2)) {
                            switch (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_COMPARATOR_0 | ADC_TRIGGER_COMPARATOR_1 | ADC_TRIGGER_COMPARATOR_2)) {
                            case ADC_TRIGGER_COMPARATOR_0:
                                ADCEMUX_0 |= TRIG_AN_COMP_0;
                                break;
                            case ADC_TRIGGER_COMPARATOR_1:
                                ADCEMUX_0 |= TRIG_AN_COMP_1;
                                break;
                            case ADC_TRIGGER_COMPARATOR_2:
                                ADCEMUX_0 |= TRIG_AN_COMP_2;
                                break;
                            }
                        }
                        else if (ptrADC_settings->int_adc_mode & ADC_TRIGGER_TIMER) {
                            ADCEMUX_0 |= TRIG_TIMER;                     // trigger from any enabled timer source
                        }
                        else if (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_PWM_0 | ADC_TRIGGER_PWM_1 | ADC_TRIGGER_PWM_2 | ADC_TRIGGER_PWM_3)) {
                            switch (ptrADC_settings->int_adc_mode & (ADC_TRIGGER_PWM_0 | ADC_TRIGGER_PWM_1 | ADC_TRIGGER_PWM_2 | ADC_TRIGGER_PWM_3)) {
                            case ADC_TRIGGER_PWM_0:
                                ADCEMUX_0 |= TRIG_PMW_0;
                                break;
                            case ADC_TRIGGER_PWM_1:
                                ADCEMUX_0 |= TRIG_PMW_1;
                                break;
                            case ADC_TRIGGER_PWM_2:
                                ADCEMUX_0 |= TRIG_PMW_2;
                                break;
                            case ADC_TRIGGER_PWM_3:
                                ADCEMUX_0 |= TRIG_PMW_3;
                                break;
                            }
                        }                        
                    }
                    else {
                        ADCEMUX_0 |= TRIG_CONTROLLER;                    // started by software
                    }
                    ADCSAC_0 = ptrADC_settings->int_adc_averaging;
                    while (ulBit <= 0x80) {                              // count the number of inputs to be sampled
                        if (ulBit & (ulSingInputs | ulDifInputs)) {
                            if (ulBit & ulDifInputs) {
                                if (!(ulInputNumber & 0x1)) {            // enter only one of the differential pairs
                                    ulControl |= (DIF_SAMPLE_1 << (iInputs * 4)); // mark that this belongs to a differential input pair
                                    ulConfig |= (ulInputNumber/2 << (iInputs * 4)); // enter the differential pair in the sampling sequence
                                    iInputs++;
                                }
                            }
                            else {
                                if (ulSingInputs & (ulBit << 16)) {      // {14} the channel is from the internal temperature
                                    ulInternalTemp |= (TEMP_SAMPLE_1 << (iInputs * 4));
                                }
                                else {
                                    ulConfig |= (ulInputNumber << (iInputs * 4)); // enter the channel in the sampling sequence
                                }
                                iInputs++;
                            }
        #if defined _DUST_DEVIL_CLASS || defined _TEMPEST_CLASS
                            if (ulInputNumber > 3) {
                                RCGC2 |= CGC_GPIOD;                      // clock the appropriate GPIO module
                                GPIOAMSEL_D |= (0x01 << (7 - (ulInputNumber - 4)));  // disable analogue isolation on pin
                            }
                            else {
                                RCGC2 |= CGC_GPIOE;
                                GPIOAMSEL_E |= (0x01 << (7 - ulInputNumber));
                            }
        #endif
                        }
        #if defined _DUST_DEVIL_CLASS || defined _TEMPEST_CLASS
                        else {
                            if (ulInputNumber > 3) {
                                if (RCGC2 & CGC_GPIOD) {
                                    GPIOAMSEL_D &= ~(0x01 << (7 - (ulInputNumber - 4))); // enable analogue isolation on pin
                                }
                            }
                            else {
                                if (RCGC2 & CGC_GPIOE) {
                                    GPIOAMSEL_E &= ~(0x01 << (7 - ulInputNumber));
                                }
                            }
                        }
        #endif
                        ulBit <<= 1;
                        ulInputNumber++;
                    }
                    if (iInputs == 0) {
                        return;                                          // no inputs found
                    }
                    iInputs--;
                    ulControl |= (((END_SAMPLE_1 | INT_SAMPLE_1) << (iInputs * 4)) | ulInternalTemp); // {14} mark last sample which will interrupt 
                    ADCSSMUX0_0 = ulConfig;                              // program the sequencer
                    ADCSSCTL0_0 = ulControl;

