sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
                    fnEnterInterrupt(irq_ADC_Sequence_0_ID, ptrADC_settings->int_priority, _ADC_sequence_0_complete); // enter the interrupt
                    adc_int_complete_handler = ptrADC_settings->int_handler;

                    usSampleCount = ptrADC_settings->int_sequence_count;
                    ptrSamples = ptrADC_settings->int_adc_result;
                    if (adc_int_complete_handler != 0) {                 // {22}
                        ADCIM_0 |= MASK_SS0;                             // enable interrupt from sequencer
                    }
                    ADCACTSS_0 |= ASEN0;                                 // enable sequencer operation
    #endif
                }
                if (ptrADC_settings->int_adc_mode & ADC_START_OPERATION) {
    #ifdef _TEMPEST_CLASS
                    if ((ulDifInputs | ulSingInputs) & (ADC_CHANNEL_0 | ADC_CHANNEL_1 | ADC_CHANNEL_2 | ADC_CHANNEL_3 | ADC_CHANNEL_4 | ADC_CHANNEL_5 | ADC_CHANNEL_6 | ADC_CHANNEL_7)) {
                        ADCPSSI_0 = INITIATE_SS0;                        // trigger sampling of ADC0 by software
                    }
                    else if ((ulDifInputs | ulSingInputs) & (ADC_CHANNEL_8 | ADC_CHANNEL_9 | ADC_CHANNEL_10 | ADC_CHANNEL_11 | ADC_CHANNEL_12 | ADC_CHANNEL_13 | ADC_CHANNEL_14 | ADC_CHANNEL_15)) {
                        ADCPSSI_1 = INITIATE_SS0;                        // trigger sampling of ADC1 by software
                    }
    #else
                    ADCPSSI_0 = INITIATE_SS0;                            // trigger sampling by software
    #endif
                }
            }
        }
        break;
#endif
#ifdef SUPPORT_PWM_CONTROLLER                                            // {32}
    case PWM_CONFIGURATION:                                              // configure PWM controller
        {
            int iTimer = (((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_reference); // the PWM channel to use
            unsigned short usMode = (((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_mode);
            if (iTimer >= (PWM_AVAILABLE * 2)) {                         // check for valid PWM controller channel
                return;
            }
            if (usMode & TIMER_STOP_PWM) {                               // PWM is to be stopped
                PWMENABLE &= ~(usMode & (TIMER_PWM_START_0 | TIMER_PWM_START_1 | TIMER_PWM_START_2 | TIMER_PWM_START_3 | TIMER_PWM_START_4 | TIMER_PWM_START_5 | TIMER_PWM_START_6 | TIMER_PWM_START_7)); // disable outputs
                if ((usMode & (TIMER_PWM_START_0 | TIMER_PWM_START_1)) && (!(PWMENABLE & (TIMER_PWM_START_0 | TIMER_PWM_START_1)))) {
                    PWM0CTL = 0;
                }
                if ((usMode & (TIMER_PWM_START_2 | TIMER_PWM_START_3)) && (!(PWMENABLE & (TIMER_PWM_START_2 | TIMER_PWM_START_3)))) {
                    PWM1CTL = 0;
                }
                if ((usMode & (TIMER_PWM_START_4 | TIMER_PWM_START_5)) && (!(PWMENABLE & (TIMER_PWM_START_4 | TIMER_PWM_START_5)))) {
                    PWM2CTL = 0;
                }
                if ((usMode & (TIMER_PWM_START_6 | TIMER_PWM_START_7)) && (!(PWMENABLE & (TIMER_PWM_START_6 | TIMER_PWM_START_7)))) {
                    PWM3CTL = 0;
                }
                if (!(PWMENABLE & (TIMER_PWM_START_0 | TIMER_PWM_START_1 | TIMER_PWM_START_2 | TIMER_PWM_START_3 | TIMER_PWM_START_4 | TIMER_PWM_START_5 | TIMER_PWM_START_6 | TIMER_PWM_START_7))) { // no more channels are active
                    RCGC0 &= ~CGC_PWM;                                   // power down the PWM controller
                }
                return;
            }
            if (!(TIMER_PWM_NO_CONFIG & usMode)) {                       // if configuration is not expressly disabled
                if (usMode & PWM_DIV_64) {                               // PWM clock is to be divided from system clock
                    unsigned long ulDivide = ((usMode & PWM_DIV_64) - PWM_DIV_2);
                    ulDivide <<= 9;
                    ulDivide |= USEPWMDIV;
                    RCC = ((RCC & ~(PWMDIV_64)) | ulDivide);             // program the divide value
                }
                else {
                    RCC &= ~(USEPWMDIV);                                 // no PWM divide
                }
                switch (iTimer) {                                        // configure the PWM channel output
                case 0:                                                  // PWM0
    #ifdef _LM3S1776
                    _CONFIG_PERIPHERAL(D, PWM, 0, (PORTD_BIT0), (PD0_PWM0)); // PWM0 on PD0 - configure port and power up module
    #else
                    _CONFIG_PERIPHERAL(F, PWM, 0, (PORTF_BIT0), (PF0_PWM0)); // PWM0 on PF0
    #endif
                    PWM0GENA = (ACT_CMPAD_SET | ACT_LOAD_CLEAR);         // clear A output when counter value matches the load value and set output when counter matches comparator A
                    PWM0LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM0CMPA = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 1:                                                  // PWM1
    #ifdef _LM3S1776
                    _CONFIG_PERIPHERAL(D, PWM, 0, (PORTD_BIT1), (PD1_PWM1)); // PWM1 on PD1 - configure port and power up module
    #else
                    _CONFIG_PERIPHERAL(G, PWM, 0, (PORTG_BIT1), (PG1_PWM1)); // PWM1 on PG1
    #endif
                    PWM0GENB = (ACT_CMPBD_SET | ACT_LOAD_CLEAR);         // clear B output when counter value matches the load value and set output when counter matches comparator B
                    PWM0LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM0CMPB = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 2:                                                  // PWM2
                    _CONFIG_PERIPHERAL(B, PWM, 0, (PORTB_BIT0), (PB0_PWM2)); // PWM2 on PB0
                    PWM1GENA = (ACT_CMPAD_SET | ACT_LOAD_CLEAR);         // clear A output when counter value matches the load value and set output when counter matches comparator A
                    PWM1LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM1CMPA = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 3:                                                  // PWM3
                    _CONFIG_PERIPHERAL(B, PWM, 0, (PORTB_BIT1), (PB1_PWM3)); // PWM3 on PB1
                    PWM1GENB = (ACT_CMPBD_SET | ACT_LOAD_CLEAR);         // clear B output when counter value matches the load value and set output when counter matches comparator B
                    PWM1LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM1CMPB = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 4:                                                  // PWM4
    #ifdef _LM3S1776
                    _CONFIG_PERIPHERAL(A, PWM, 0, (PORTA_BIT6), (PA6_PWM4)); // PWM4 on PA6 - configure port and power up module
    #else
                    _CONFIG_PERIPHERAL(E, PWM, 0, (PORTE_BIT0), (PE0_PWM4)); // PWM4 on PE0
    #endif
                    PWM2GENA = (ACT_CMPAD_SET | ACT_LOAD_CLEAR);         // clear A output when counter value matches the load value and set output when counter matches comparator A
                    PWM2LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM2CMPA = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 5:                                                  // PWM5
    #ifdef _LM3S1776
                    _CONFIG_PERIPHERAL(A, PWM, 0, (PORTA_BIT7), (PA7_PWM5)); // PWM5 on PA7 - configure port and power up module
    #else
                    _CONFIG_PERIPHERAL(E, PWM, 0, (PORTE_BIT1), (PE1_PWM5)); // PWM5 on PE1
    #endif
                    PWM2GENB = (ACT_CMPBD_SET | ACT_LOAD_CLEAR);         // clear B output when counter value matches the load value and set output when counter matches comparator B
                    PWM2LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM2CMPB = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 6:                                                  // PWM6
    #ifdef _LM3S1776
                    _CONFIG_PERIPHERAL(C, PWM, 0, (PORTC_BIT4), (PC4_PWM6)); // PWM6 on PC4 - configure port and power up module
    #else
    #endif
                    PWM3GENA = (ACT_CMPAD_SET | ACT_LOAD_CLEAR);         // clear A output when counter value matches the load value and set output when counter matches comparator A
                    PWM3LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM3CMPA = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                case 7:                                                  // PWM7
    #ifdef _LM3S1776
                    _CONFIG_PERIPHERAL(C, PWM, 0, (PORTC_BIT6), (PC6_PWM7)); // PWM7 on PC6 - configure port and power up module
    #else
    #endif
                    PWM3GENB = (ACT_CMPBD_SET | ACT_LOAD_CLEAR);         // clear B output when counter value matches the load value and set output when counter matches comparator B
                    PWM3LOAD = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->timer_value;
                    PWM3CMPB = ((TIMER_INTERRUPT_SETUP *)ptrSettings)->pwm_value;
                    break;
                }
            }
            if (usMode & (TIMER_PWM_START_0 | TIMER_PWM_START_1)) {
                PWM0CTL = PWM_BLOCK_ENABLE;
            }
            if (usMode & (TIMER_PWM_START_2 | TIMER_PWM_START_3)) {
                PWM1CTL = PWM_BLOCK_ENABLE;
            }
            if (usMode & (TIMER_PWM_START_4 | TIMER_PWM_START_5)) {
                PWM2CTL = PWM_BLOCK_ENABLE;
            }
            if (usMode & (TIMER_PWM_START_6 | TIMER_PWM_START_7)) {
                PWM3CTL = PWM_BLOCK_ENABLE;
            }
            PWMENABLE |= (usMode & (TIMER_PWM_START_0 | TIMER_PWM_START_1 | TIMER_PWM_START_2 | TIMER_PWM_START_3 | TIMER_PWM_START_4 | TIMER_PWM_START_5 | TIMER_PWM_START_6 | TIMER_PWM_START_7)); // enable outputs
        }
        break;
#endif
    }
}

#if defined SUPPORT_LOW_POWER
// This routine switches to low power mode. It is always called with disabled interrupts
//
extern void fnDoLowPower(void)
{
    #if !defined _WINDOWS
    uEnable_Interrupt();
    __sleep_mode();                                                      // enter low power mode using wait for interrupt processor state
    #else
    uEnable_Interrupt();
    #endif
}

// Set a new low power mode (not yet implemented)
//
extern void fnSetLowPowerMode(int new_lp_mode)
{
}
#endif


// This routine is called to reset the card
//
extern void fnResetBoard(void)
{
  //HWREG(NVIC_APINT) = NVIC_APINT_VECTKEY | NVIC_APINT_SYSRESETREQ; other method?
    RCGC0 |= CGC_WDT;                                                    // enable clocks to the watchdog module, if not presently active
    WDTLOCK = WD_ACCESS;                                                 // ensure we can access the watchdog registers
    WDTLOAD = 0;                                                         // immediate timeout
    WDTCTL = WD_RESEN;                                                   // enable reset on second timeout
    WDTCTL = (WD_RESEN | WD_INTEN);                                      // enable watchdog and interrupt
#ifndef _WINDOWS
    while (1) {}                                                         // wait for watchdog to fire
#endif
}


