sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
#ifdef GLOBAL_HARDWARE_TIMER

static __interrupt void hwtimer_interrupt(void)
{
    static const unsigned char hw_timer_int_message[HEADER_LENGTH] = { INTERNAL_ROUTE, INTERNAL_ROUTE, TASK_TIMER, INTERRUPT_EVENT, 0 };
    volatile unsigned int dummy;

    dummy = TC_SR_2;                                                     // read the status to reset interrupt
    TC_IDR_2 = TIM_CPCS;                                                 // disable interrupt
#ifdef _WINDOWS
    TC_SR_2 &= ~TIM_CLKSTA; TC_IMR_2 &= ~TIM_CPCS;                       // flag that the timer is not running
#endif
    uDisable_Interrupt();                                                // ensure interrupts remain blocked when putting message to queue
    fnWrite(INTERNAL_ROUTE, (unsigned char*)hw_timer_int_message, HEADER_LENGTH); // Inform the global interrupt task
    uEnable_Interrupt();                                                 // release
}

// In order to support a global hardware timer a milli-second timer is required. We use the 16 bit Timer 2
//
extern CLOCK_LIMIT fnSetHardwareTimer(CLOCK_LIMIT *hw_delay)
{                                                                        // timer set in ms
    CLOCK_LIMIT Adjusted = 0;
    CLOCK_LIMIT NewDelay = *hw_delay;                                    // clock count desired

    uDisable_Interrupt();                                                // protect region against interrupts

    if (TC_IMR_2 & TIM_CPCS) {                                           // timer already running
        CLOCK_LIMIT Remaining = (CLOCK_LIMIT)(TC_RC_2 - TC_CV_2);        // time remaining before next timeout (in clock pulses)
        if (NewDelay >= Remaining) {
            uEnable_Interrupt();                                         // enable interrupt and quit
            return 0;
        }
        TC_CCR_2 = TIM_CLKDIS;                                           // freeze the timer and disable interrupt
        Adjusted = (CLOCK_LIMIT)TC_CV_2;                                 // note the frozen value
    }
    TC_RC_2 = NewDelay;                                                  // set reference
    TC_CCR_2 = (TIM_CLKEN | TIM_SWTRG);                                  // (re)start timer
    TC_IER_2  = TIM_CPCS;                                                // enable interrupt on RC Compare Interrupt
#ifdef _WINDOWS
    TC_SR_2 |= TIM_CLKSTA; TC_IMR_2 |= TIM_CPCS;                         // flag that the timer is running
#endif

    uEnable_Interrupt();                                                 // enable interrupts again

    return Adjusted;
}

#endif

#if !defined _MINIMUM_IRQ_INITIALISATION
// Serious error interrupts
//
static void irq_hard_fault(void)
{
}

static void irq_memory_man(void)
{
}

static void irq_bus_fault(void)
{
}

static void irq_usage_fault(void)
{
}

static void irq_debug_monitor(void)
{
}

static void irq_NMI(void)
{
}

static void irq_pend_sv(void)
{
}

static void irq_SVCall(void)
{
}
#endif

// Default handler to indicate processor input from unconfigured source
//
static void irq_default(void)
{
}

// Delay loop for simple but accurate short delays (eg. for stabilisation delays)
//
extern void fnDelayLoop(unsigned long ulDelay_us)
{
    #define LOOP_FACTOR 9938400                                          // tuned for GCC on Fury/Dust-Devil Class devices
    volatile unsigned long ulDelay = ((MASTER_CLOCK/LOOP_FACTOR) * ulDelay_us);
    while (ulDelay--) {}                                                 // simple loop tuned to perform us timing
}



#if defined (COMPILE_IAR) && !defined COMPILE_IAR5

#pragma segment="DATA_ID"
#pragma segment="DATA_I"
#pragma segment="DATA_Z"

static void __segment_init(void)
{
    unsigned long *pulSrc, *pulDest, *pulEnd;

    //
    // Copy the data segment initializers from flash to SRAM.
    //
    pulSrc = __segment_begin("DATA_ID");
    pulDest = __segment_begin("DATA_I");
    pulEnd = __segment_end("DATA_I");
    while(pulDest < pulEnd)
    {
        *pulDest++ = *pulSrc++;
    }

    //
    // Zero fill the bss segment.
    //
    pulDest = __segment_begin("DATA_Z");
    pulEnd = __segment_end("DATA_Z");
    while(pulDest < pulEnd)
    {
        *pulDest++ = 0;
    }
    }
#elif defined (_GNU)
extern unsigned char __data_start__, __data_end__;
extern const unsigned char __data_load_start__;
extern unsigned char __text_start__, __text_end__;
extern const unsigned char __text_load_start__;
extern unsigned char __bss_start__, __bss_end__;

extern void __init_gnu_data(void)
{
    unsigned char *ptrData = &__data_start__;
    const unsigned char *ptrFlash = &__data_load_start__;
    unsigned long ulInitDataLength = (&__data_end__ - &__data_start__);
    while (ulInitDataLength--) {                                         // initialise data
        *ptrData++ = *ptrFlash++;
    }

    ptrData = &__text_start__;
    ptrFlash = &__text_load_start__;
    ulInitDataLength = (&__text_end__ - &__text_start__);
    while (ulInitDataLength--) {                                         // initialise text
        *ptrData++ = *ptrFlash++;
    }

    ptrData = &__bss_start__;
    ulInitDataLength = (&__bss_end__ - &__bss_start__);
    while (ulInitDataLength--) {                                         // initialise bss
        *ptrData++ = 0;
    }
}
#endif

#if 1 /*defined RUN_IN_FREE_RTOS || defined _WINDOWS*/ // to satisfy FreeRTOS callbacks - even when FreeRTOS not linked
extern void *pvPortMalloc(int iSize)
{
    return uMalloc((MAX_MALLOC)iSize);                                   // use uMalloc() which assumes that memory is never freed
}
extern void vPortFree(void *free)
{
    _EXCEPTION("Unexpected free call!!");
}
extern void vApplicationStackOverflowHook(void)
{
}
extern void vApplicationTickHook(void)                                   // FreeRTOS tick interrupt
{
}
extern void vMainConfigureTimerForRunTimeStats(void)
{
}
extern unsigned long ulMainGetRunTimeCounterValue(void)
{
    return uTaskerSystemTick;
}
extern void vApplicationIdleHook(void)
{
}
extern void prvSetupHardware(void)
{
}
#endif


// Perform very low level initialisation - called by the start up code
//
static void LM3SXXXX_LowLevelInit( void)
{
    VECTOR_TABLE *ptrVect;
#if !defined _MINIMUM_IRQ_INITIALISATION
    void ( **processor_ints )( void );
#endif

    RCC &= ~USESYSDIV;
    RCC |= BYPASS;                                                       // ensure clocking is from raw clock source
    RCC &= ~(XTAL_8_1920 | OSCSRC_MASK | SYSDIV_32);                     // mask out XTAL frequency and divider fields and set main oscillator source
    #ifdef EXTENDED_PLL_SETTING                                          // {17}
    RCC2 |= (USERCC2 | DIV400 | BYPASS);                                 // control using RCC2
    RCC2 &= ~(XTAL_8_1920 | OSCSRC_MASK | SYSDIV_32 | SYSDIV2LSB);       // note that SYSDIV2LSB is disabled here since it can only be disabled after DIV400 has been set. There is never a need to enable it since the non-extended method can be used to achieve the standard frequencies
    RCC2 |= (PLL_OUTPUT_VALUE);                                          // select crystal and required PLL output frequency
    RCC |= (CRYSTAL_SPEED_VALUE);
    RCC2 &= ~(PWRDN);                                                    // clear PLL power down bit to allow it to operate
    #else
    RCC |= (CRYSTAL_SPEED_VALUE | PLL_OUTPUT_VALUE);                     // select crystal and required PLL output frequency
    RCC &= ~(PWRDN);                                                     // clear PLL power down bit to allow it to operate
    RCC |= USESYSDIV;                                                    // enable system divide
    #endif

