sWahlinRhoades/uTaskerModified/Hardware/Luminary/LM3SXXXX.c
    while (!(RIS & PLLLRIS)) {                                           // wait for PLL to lock
#if defined _WINDOWS
        RIS |= PLLLRIS;
#endif
    }
    #ifdef EXTENDED_PLL_SETTING
    RCC2 &= ~BYPASS;                                                     // switch to PLL source
    #else
    RCC &= ~BYPASS;                                                      // switch to PLL source
    #endif
    #ifdef _WINDOWS
    ptrVect = (VECTOR_TABLE *)((unsigned char *)((unsigned char *)&vector_ram + RESERVE_DMA_MEMORY));
    #else
        #ifdef _CCSTUDIO                                                 // {34}
    ptrVect = (VECTOR_TABLE *)(vectorTable + RESERVE_DMA_MEMORY);        // this is the same as (RAM_START_ADDRESS + RESERVE_DMA_MEMORY) but forces the area to be linked
        #else
    ptrVect = (VECTOR_TABLE *)(RAM_START_ADDRESS + RESERVE_DMA_MEMORY);
        #endif
    #endif
    VECTOR_TABLE_OFFSET_REG   = (TBLBASE_IN_RAM + (RESERVE_DMA_MEMORY & ~0x7f));// position the vector table at the bottom of RAM
#if !defined _MINIMUM_IRQ_INITIALISATION
    ptrVect->ptrHardFault     = irq_hard_fault;
    ptrVect->ptrMemManagement = irq_memory_man;
    ptrVect->ptrBusFault      = irq_bus_fault;
    ptrVect->ptrUsageFault    = irq_usage_fault;
    ptrVect->ptrDebugMonitor  = irq_debug_monitor;
    ptrVect->ptrNMI           = irq_NMI;
    ptrVect->ptrPendSV        = irq_pend_sv;
    ptrVect->ptrSVCall        = irq_SVCall;
    processor_ints = (void (**)(void))&ptrVect->processor_interrupts;    // fill all processor specific interrupts with a default handler
    do {
        *processor_ints = irq_default;
        if (processor_ints == (void (**)(void))&ptrVect->processor_interrupts.LAST_PROCESSOR_IRQ) {
            break;
        }
        processor_ints++;
    } while (1);
#else
    ptrVect->ptrHardFault     = irq_default;
    ptrVect->ptrMemManagement = irq_default;
    ptrVect->ptrBusFault      = irq_default;
    ptrVect->ptrUsageFault    = irq_default;
    ptrVect->ptrDebugMonitor  = irq_default;
    ptrVect->ptrNMI           = irq_default;
    ptrVect->ptrPendSV        = irq_default;
    ptrVect->ptrSVCall        = irq_default;
#endif
#if RESERVE_DMA_MEMORY > 0                                               // uDMA is activated so initialise the controller
    RCGC2 = CGC_uDMA;                                                    // clock the module
#endif
#if defined (COMPILE_IAR) && !defined COMPILE_IAR5
    __segment_init();                                                    // initialise variables
#elif defined (_GNU)
    __init_gnu_data();
#endif
#if defined _DUST_DEVIL_CLASS || defined _TEMPEST_CLASS                  // {8}
    GPIOHSCTL = 0xffffffff;                                              // all possible ports set to use high speed aperture
#endif
#if RESERVE_DMA_MEMORY > 0                                               // uDMA is activated so initialise the controller
    DMACFG = uDMA_MASTEN;                                                // enable the module
    DMACTLBASE = RAM_START_ADDRESS;                                      // enter the DMA control table with a 1024 byte aligned address
    #ifdef _WINDOWS
    DMAALTBASE += RAM_START_ADDRESS;
    #endif
#endif
#if defined _WINDOWS                                                     // check that the size of the interrupt vectors has not grown beyond that what is expected (increase its space in the script file if necessary!!)
    if (VECTOR_SIZE > CHECK_VECTOR_SIZE) {
        *(unsigned char *)0 = 0;
    }
#endif
#if defined _WINDOWS
    fnUpdateOperatingDetails();                                          // {36} update operating details to be displayed in the simulator
#endif
}


#if defined ROWLEY && !defined ROWLEY_2                                  // Rowley project requires extra initialisation for debugger to work correctly before V1.7 build 17
static void _main2(void)
{
    asm("mov lr, #0");
    asm("b _main");
}
#endif

#if defined _GNU
// Allow the jump to a foreign application as if it were a reset (load SP and PC)
//
extern void start_application(unsigned long app_link_location)
{
    asm("ldr sp, [r0,#0]");
    asm("ldr pc, [r0,#4]");
}
#endif


// The initial stack pointer and PC value - this is linked at address 0x00000000
//
#if defined COMPILE_IAR5
__root const RESET_VECTOR __vector_table @ ".intvec"                     // __root forces the function to be linked in IAR project
#elif defined COMPILE_IAR
__root const RESET_VECTOR reset_vect @ "RESETVECT"                       // __root forces the function to be linked in IAR project
#elif defined _GNU || defined _CCSTUDIO
const RESET_VECTOR __attribute__((section(".vectors"))) reset_vect
#elif defined _COMPILE_KEIL
__attribute__((section("RESET"))) const RESET_VECTOR reset_vect
#else
const RESET_VECTOR reset_vect
#endif
= {
    (void *)(RAM_START_ADDRESS + SIZE_OF_RAM - 8),                       // stack pointer to top of RAM (leaving space for non-initialised random number)
    (void (*)(void))START_CODE
};

#endif                                                                   // end _LM3SXXXX
